{"sheets":[{"title":"GC2013 Jan 04 2013","data":[["Day","Slot","Start Time","Type","Table\/Area","EVENT","Booklet Description","Addition Date"],["Friday",1,"5:00pm","BG","M3\nGamers 1","M3 Gamers presents: Dungeon Quest","By M3 Gamers\nDay: Friday \nStart Time: 5:00pm\nNumber of participants: 2 to 4 (multiple sessions)\n\nExplore the ruins of Castle Dragonfire and try to reach the treasure chamber in the center. Escape carrying as much treasure as possible as fast as possible before time runs out, because anyone left in the dungeon when time runs out dies! *Organizer note: Dungeon Quest players will not actually die.*","9-Dec-12"],["Friday",1,"5:00pm","BG","M3\nGamers 2","M3 Gamers presents: Zombies!!!","By M3 Gamers\nDay: Friday \nStart Time: 5:00pm\nNumber of participants: 2 to 6\n\nZombies!!! the board game. Search the city, school and mall for ammo and heath to survive. Try to kill 25 zombies or make it to one of the helipads to win.","9-Dec-12"],["Friday","1","5:00pm","EG",12,"Bring Your Own Computer(BYOC)","If you plan to bring your own computer to use at the LAN please sign up in Warhorn.\n\nThis will help us judge attendance and will let us know if we need to expand the seating.\n\nThere will be approximately 112 BYOC slots available which will be assigned first based on preregistered attendees with BYOC passes or add-ons (this means you must have purchased a ticket to GottaCon 2013 either at a retail location or via our website) then on a first come first serve basis. If you have purchased your ticket as described above you must log into our Warhorn site, create an account and once approved by GottaCon staff reserve a seat in the BYOC event located in slot 1. In order to be seated as a team please make sure all of your team members show up on time. We will accommodate team seating as best we can but there is no guarantee of being seated together for late arrivals. All schedules, times and events are subject to change or cancellation. This will only occur if attendance levels are lower or higher than expected.","19-Dec-12"],["Friday",1,"5:00pm","EG","12\/13","Logitech PC and \nMad Catz Console Freeplay","Day: Friday, Saturday, and Sunday\nTime: All Slots\n\nCome and play some games at the Logitech PC LAN on the free-play stations or Mad Catz Console LAN. **The Logitech PC LAN free-play stations may not be used to participate in Premium tournaments.","30-Dec-12"],["Friday",1,"5:00pm","EG",12,"PC - Free-play Servers ","By BC Gamer\nDay: Friday, Saturday, Sunday\nTime: All slots\n\nBC Gamer will be hosting the following servers all weekend long for players to join at their leisure: Team Fortress 2, Chivalry: Medieval Warfare, Counter-Strike: Source, Counter-Strike: Global Offensive, Minecraft, KillingFloor, TeamSpeak 3. End of Reality is hosting Shootmania:Storm and Battlefield 3.","8-Dec-12"],["Friday",1,"5:00pm","EG",12,"PC - Minecraft Building Contest","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All slots\nJudged: Sunday 1:00pm\nGenre: Indie - Sandbox\nOfficial Website: https:\/\/minecraft.net\/\n\nShow us your digital creativity. We will have a Minecraft server running all weekend where individual players and building teams will construct anything they can imagine. The creations will be judged on Sunday by our panel of expert architectural critics.","5-Nov-12"],["Friday",1,"5:00pm","EG",12,"PC - Tricky Truck: Time Trials","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nFinals: Sunday 2:00pm\nGenre: Indie - Racing\nOfficial Website: http:\/\/www.gravitysensation.com\/trickytruck\/\n\nThe ridiculousness of this simple game is sure to bring a smile to any one's face. You must navigate difficult terrain and park a large truck as quickly as possible. Sound easy? We will have a station running all weekend for people to hone their skills. Final time trials will take place on Sunday.","5-Nov-12"],["Friday",1,"5:00pm","EG",17,"Xbox 360 \n- Fighting Game Free Play ","By Canadian Joystick and CrossXover\nDay: Friday\nTime: 5:00pm to 11:00pm\n\nWant a chance to warm up before the major events on Saturday? Do you want to find some like minded challengers to test your mettle against? Come by the console area for some free play and practice. Bring your own fighting stick or use the ones provided by our Console LAN sponsors Mad Catz!","11-Dec-12"],["Friday",1,"6:00pm","EG",12,"PC - Left 4 Dead 2 Survival","By GottaCon and BC Gamer\nDay: Friday\nTime: 6:00pm to 9:00pm\nGenre: Co-operative First Person Shooter\nOfficial Website: http:\/\/www.l4d.com\/game.html\nSteam Store Page: http:\/\/store.steampowered.com\/app\/550\/\n\nYour will to survive shall be tested by tireless waves of undead. Teams of 4 will be assigned 3 survival challenges with their best time determining entry to the final round. The top teams will then start one last survival session simultaneously and see if they can hold out the longest!","5-Nov-12"],["Friday",1,"5:00pm","Minis","M03","Warmachine\/Hordes Iron Arena ","By GottaCon\nSponsored by: Wiser's Collectibles \nDay: Friday, Saturday, and Sunday\nTime: All Slots\n\nAll weekend, day or night, Warmachine and Hordes players at GottaCon 2013 will be able to participate in the Iron Arena! Bring an army and play against an \nOpponent in this open-play format. You decide upon the points value for the games. Collect points and redeem them to pick up some great prizes!!","17-Oct-12"],["Friday",1,"5:00pm","Special Event",18,"Lego - Kid Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will be hosting a kid ( and grown up kid ) build zone for the duration of Gottacon. You are welcome to come build at any time using the club's public brick buckets even if we are not manning our booth at the time. Parents are asked to monitor their children and everyone is welcome to leave your creations for the rest of the attendees to admire afterwards.","1-Jan-13"],["Friday",1,"6:00pm","Special Event",19,"Society for Creative \nAnachronism Demonstration","Time: 6:00pm to 7:00pm","1-Jan-13"],["Friday",2,"7:00pm","BG",3,"Board Game Library (Sign out Games to Play) ","By GottaCon\nDay: Friday, Saturday, and Sunday\nTime: All Slots\n\nThis year GottaCon is pleased to continue to have a library of board games that our attendees are free to sign out and play. Sign out games from the Event Registration Desk by requesting a game from our available titles and leaving behind a piece of ID. GottaCon would like to thank Days of Wonder, Mayfair Games, Rio Grande, Fantasy Flight Games, and AEG for making additions this year.","18-Dec-11"],["Friday",2,"7:00pm","BG","VCON 1","DEMO - VCON presents: \nRobo Rally","By Colin Fraser of VCon\nDay: Friday \nStart Time: 7:00pm\nNumber of participants: 2 to 8\n\nImagine that you're a supercomputer. Now imagine that you're bored. So you dream up a little contest for you and a couple of your supercomputing buddies. Your task is to move one of the stupid little robots out on the factory floor through a series of checkpoints scattered throughout the factory. The wrinkle, however, is that the factory floor is filled with all kinds of inconvenient (if not down-right deadly) obstacles located in various locations: conveyor belts, crushers, flame-throwers, pushers, teleporters, oil slicks, pits, et cetera. But the real fun comes when the robots cross each other's path, and suddenly your perfect route is something less than that...","1-Jan-13"],["Friday",2,"7:00pm","BG","VCON 2","DEMO - VCON presents: \nSabacc ","By Rick Arino of VCon\nDay: Friday \nStart Time: 7:00pm\nNumber of participants:  2 to 8\n\nCome play the game that won Han Solo the fastest hunk-of-junk in the Galaxy. That’s right… the popular Star Wars game of Sabacc returns to Gottacon. This high stakes game will test your mettle against your opponents as you try to claim all their money and the title of Sabacc Champion!","1-Jan-13"],["Friday",2,"7:00pm","BG","BG02","Exalted: War for the Throne","By: Cameron Young\nDay: Friday\nStart Time: 7:00pm\nNumber of participants: 2 to 5\n\nWar has come to the Blessed Isle. Arm your legions, mobilise your warships, and prepare your strongest magic. Exalted: War for the Throne is a risk-esq game for 2-5 people where you fight for supremacy of the map. Games take between two and four hours to complete.","18-Nov-12"],["Friday",2,"7:00pm","BG","BG01","German Games Night","By Michael Poplawski \nDay: Friday\nStart Time: 7:00pm\nMaximum of participants: 6\n\nMichael Poplawski presents German Games Night at GottaCon! Come demo several Spiel des Jahres winners and nominees, including Zug um Zug Märklin, Auf Achse, Die Speicherstadt, Bezzerwizzer, Funkenschlag, Thurn und Taxis and more! Michael also provides a free service for importing games from Germany. German Games Night takes place regularly throughout the year. Play great games and have fun learning about Germany, the German language, and German games.","27-Nov-12"],["Friday",2,"7:00pm","BG","M3\nGamers 1","M3 Gamers presents: Carcassone","By M3 Gamers\nDay: Friday \nStart Time: 7:00pm\nNumber of participants: 2 to 4 (multiple sessions)\n\nIn Carcassonne, you are an explorer leading a band of followers through the land surrounding the town of Carcassonne, located in the south of France. Each turn you will reveal a new randomly selected tile in your explorations, discovering cities, roads, monasteries and fields. Each feature revealed allows you the opportunity to gain control over the feature in Carcassonne. Complete exploring each new feature to win control of it and lay final claim to the land around the city of Carcassonne","1-Jan-13"],["Friday",2,"7:00pm","BG","M3\nGamers 2","M3 Gamers presents: Learn to Play Gaming","By M3 Gamers\nDay: Friday \nStart Time: 7:00pm\nNumber of participants: Up to 6 (multiple games, multiple sessions)\n\nGet set for tomorrow's tournaments or just come try something new. We'll be teaching and playing a variety of games including the tournament favourites!","1-Jan-13"],["Friday",2,"7:00pm","BG","BG03\nto\nBG08","Settlers of Catan Tournament","By GottaCon and M3 Gamers\nDay: Friday\nStart Time: 7:00pm\nPrice: Free\nMaximum number of participants: 24\nPrizes: Prize will be awarded to first overall.\n\nThe Settlers of Catan tournament will be a total of three rounds. The first round everyone will be randomly placed at a table and will play basic Catan with identical setups at each table. Then each player will play a second round of the same game, however, all participants will be randomly placed at a different table. After both rounds, the top four players with highest combined total scores will move on to the finals. This will be a fun event. Bring a great attitude and a friend too! Prize will be awarded to first overall.","18-Dec-11"],["Friday",2,"7:00pm","BG","BG10\nBG12","Steve Jackson Games \nOpen Demo","By: MIB5799 of Steve Jackson Game\nDay: Friday and Sunday\nStart Time: 7:00pm(Friday) and 2:00pm(Sunday)\nMaximum number of participants: 8\n\nKill the monsters - Steal the treasure - Stab your buddy. It's the Munchkin Way. MIB 5799 will be running open demos of Munchkin and other Steve Jackson Games for anyone who cares to drop in and play. Swag and Prizes will be awarded.","18-Nov-12"],["Friday",2,"7:00pm","BG","BG09\nBG11","The Core Gamers: Battlestar Galactica Tournament \n- Semi-Final Round 1 ","By Credence Holmes\nDay: Friday\nStart Time: 7:00pm\nMaximum number of participants: 10\nFinal: Sunday 9:00am\n\nFlee the solar system as the humans or sabatoge as the secret Cylons in Battlestar Galactica (BSG)! We're running two games of 5 people each, the winner can particpate in the Sunday final for a great prize. Can't make this event? Try the Saturday 7pm games instead! Humans get points for: winning the game, resources still blue, number of jumps, number of vipers, raptors, civvies alive, and not being sent to the brig or sickbay during the game. Cylons get points for: winning the game, resources red, distance traveled, less distance=more points, number of vipers, raptors, civvies destroyed, revealing outside the brig, playing Super Crisis.\nVote - biggest impact on game. If the Humans win, players can only vote human and vice-versa, vote most fun in game (roleplay, amazing dice throws, playing the ´blamegame´ well, etc).","17-Dec-12"],["Friday",2,"7:00pm","EG","12\/13","Logitech PC and \nMad Catz Console Freeplay","Day: Friday, Saturday, and Sunday\nTime: All Slots\n\nCome and play some games at the Logitech PC LAN on the free-play stations or Mad Catz Console LAN. **The Logitech PC LAN free-play stations may not be used to participate in Premium tournaments.","30-Dec-12"],["Friday",2,"7:00pm","EG",12,"PC - Free-play Servers ","By BC Gamer\nDay: Friday, Saturday, Sunday\nTime: All slots\n\nBC Gamer will be hosting the following servers all weekend long for players to join at their leisure: Team Fortress 2, Chivalry: Medieval Warfare, Counter-Strike: Source, Counter-Strike: Global Offensive, Minecraft, KillingFloor, TeamSpeak 3. End of Reality is hosting Shootmania:Storm and Battlefield 3.","8-Dec-12"],["Friday",2,"7:00pm","EG",12,"PC - Minecraft Building Contest","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All slots\nJudged: Sunday 1:00pm\nGenre: Indie - Sandbox\nOfficial Website: https:\/\/minecraft.net\/\n\nShow us your digital creativity. We will have a Minecraft server running all weekend where individual players and building teams will construct anything they can imagine. The creations will be judged on Sunday by our panel of expert architectural critics.","5-Nov-12"],["Friday",2,"7:00pm","EG",12,"PC - Tricky Truck: Time Trials","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nFinals: Sunday 2:00pm\nGenre: Indie - Racing\nOfficial Website: http:\/\/www.gravitysensation.com\/trickytruck\/\n\nThe ridiculousness of this simple game is sure to bring a smile to any one's face. You must navigate difficult terrain and park a large truck as quickly as possible. Sound easy? We will have a station running all weekend for people to hone their skills. Final time trials will take place on Sunday.","5-Nov-12"],["Friday",2,"8:00pm","EG",13,"Wii – Super Smash Bros. Melee Tournament","By GottaCon and IRL Events.\nDay: Friday\nStart Time: 8:00pm\nMaximum number of participants: 32\n\nThis tournament will be single elimination four player free for all. Rounds are single matches only and each match is played with timed stock, 5 lives and 10 minutes. In the case that time runs out and one or more characters have an equal amount of lives, the character with less damage wins the match. If multiple characters have equal lives and damage, Sudden Death will determine the winner. Items are turned off, matches will be seeded randomly, only neutral stages may be chosen:\n- Yoshi’s Story\n- Fountain of Dreams\n- Battlefield\n- Dream Land (N64)\n- Final Destination","8-Dec-12"],["Friday",2,"9:00pm","EG",12,"PC - Chivalry: Medieval Warfare","By GottaCon and BC Gamer\nSponsors: Chivalry Medieval War\nDay: Friday\nTime: 9:00pm to 12:00am\nPrizes: Full copies of the game for prizes\nGenre: First Person Slasher\nOfficial Website: http:\/\/www.chivalrythegame.com\/\nSteam Store Page: http:\/\/store.steampowered.com\/app\/219640\/\n\nHave you ever wished you could be like William Wallace on the battlefield? Our friends at Torn Banner Studios have created an awesome melee combat game which will bring a Braveheart-style war to the GottaCon LAN party. Players will prove themselves by hacking off limbs and successfully besieging enemy castles to qualify for an epic final battle. There will also be a duelling tournament for those who think they can out-wit an opponent 1 on 1!","5-Nov-12"],["Friday",2,"9:00pm","EG",17,"Xbox 360 \n- Fighting Game Free Play ","By Canadian Joystick and CrossXover.\nDay: Friday\nTime: 5:00pm to 11:00pm\n\nWant a chance to warm up before the major events on Saturday? Do you want to find some like minded challengers to test your mettle against? Come by the console area for some free play and practice. Bring your own fighting stick or use the ones provided by our Console LAN sponsors Mad Catz!","8-Dec-12"],["Friday",2,"7:00pm","Minis","M04","DEMO - A Call to Arms:Star Fleet ","By Jon Woodland\nDay: Friday and Saturday\nStart Time: 7:00pm\nMaximum number of participants: 6\n\nCome and learn to play this awesome starship miniatures game set in the Star Fleet Universe! Based on the 30 years of \"Star Fleet Battles\" by Amarillo Design Bureau, A Call to Arms: Star Fleet brings fleet level action to the tabletop. Take on the forces of the Federation, Romulans, Klingons, or Kzinti with easy to learn rules and beautiful 1:3125 scale miniatures by Mongoose Publishing. http:\/\/www.mongoosepublishing.com\/us\/miniatures\/ctastarfleet.html\n\nEverything you need to play is provided. Just bring your imagination and tactical.","3-Nov-12"],["Friday",2,"7:00pm","Minis","M07","DEMO – Flames of War","Day: Friday\nStart Time: 7:00pm\nNumber of participants: As seating allows\n\nIn Flames Of War, a WWII miniature game, players command a company level force in Europe or North Africa, re-creating actual battles, or fighting missions verses other Flames of War armies. Come try out this exciting game produced by Battlefront Miniatures! No experience is necessary. Miniatures will be provided.","30-Oct-12"],["Friday ",2,"7:00pm","Minis","M01","DEMO - Infinity","Day: Friday, Saturday, and Sunday\nStart Time: 7:00pm(Friday), 9:00am(Saturday), and 2:00pm(Sunday)\nNumber of participants: As seating allows\n\nOne hundred and seventy-five years into the future Humanity has managed to survive despite itself, but for how much longer? Infinity is a game with 28mm high metal miniatures that simulates combat and special operations in a science fiction environment with Manga aesthetics. No experience is necessary. Miniatures will be provided.","30-Oct-12"],["Friday",2,"7:00pm","Minis","M03","DEMO - Malifaux Demo Games","Day: Friday, Saturday, Sunday\nTime: All daytime slots\nMaximum number of participants: As Seating Allows\n\nTrigger-happy gunslingers, misguided Victorian science, hungry undead, and monsters hidden in every shadow; these are the terrors that will plague you in Malifaux. Are you willing to risk your soul for a chance at great wealth and power? Because it's the only thing you have worth trading. In Malifaux, you lead your crew in the battle for control of The Breach, a dark portal to a world of limitless magic. A Demonstrator will be on hand to provide introductory games to those wishing to learn this game. No Experience Necessary. Miniatures will be provided.","30-Oct-12"],["Friday",2,"7:00pm","Minis","M03","DEMO - Warmachine\/Hordes Demo Games ","Day: Friday, Saturday, Sunday\nTime: All daytime slots\nMaximum number of participants: As Seating Allows\n\nIn the Game WARMACHINE players take on the role of warcasters as they lead their titanic forces into battle. Warcasters possess significant martial prowess of their own as well as having hardened warriors and magical spells to bring to bear. No Experience Necessary. Miniatures provided.","30-Oct-12"],["Friday",2,"7:00pm","Minis","M01","GottaCon Blood Bowl Tournament – Round 1","By GottaCon.\nSponsored by: Imperial Hobbies\nDay: Friday and Saturday\nTime: 7:00pm\nPrice: Free\nMaximum number of participants: 8\nPrizes:Prizes will be awarded for The Tournament Champion, Sportsmanship, and Best Painted Team.\n\nRules can be found here: http:\/\/www.games-workshop.com\/MEDIA_CustomProductCatalog\/m750496a_BB_Competition_Rules_Pack.pdf\n\nAttention Blood Bowl Fans! GottaCon Conventions is proud to announce the GottaCon 2013 Blood Bowl Cup. It will be a 4 round, Double Elimination Tournament, with the first 2 rounds played Friday evening and the final 2 rounds played on Saturday evening . Players will start with a Million Gold Piece team. The Tournament will be run as a League so there will be advancement between each round.","27-Oct-12"],["Friday",2,"7:00pm","Minis","M01","GottaCon Infinity Tournament","By GottaCon\nSponsored by: Corvus Belli\nDay: Friday\nTime: 7:00pm\nPrice: Free (signups for this event can be done in advance on our Warhorn site or once you arrive at the convention)\nMaximum number of participants: 16\n\nGottaCon and Corvus Belli are pleased to Introduce the First Annual GottaCon Infinity Tournament! Players will each field a force of up to 250 points and use the Same force for each round. The Tournament will consist of 3 rounds of play; each Round Players will use objectives determined using Y.A.M.S. (http:\/\/wargamingtrader.com\/files\/downloads\/YAMS%201.1.pdf).","27-Oct-12"],["Friday",2,"7:00pm","Minis","M03","Malifaux - Swing by the Hanging Tree, Story Encounter Tournament","By GottaCon\nSponsored by: Wyrd Miniatures\nDay: Friday\nTime: 7:00pm\nPrice: Free (signups for this event can be done in advance on our Warhorn site or once you arrive at the convention)\nMaximum number of participants: 32\n\nRules Packet: http:\/\/www.gottacon.com\/components\/tournaments\/swingbythehangingtreegottacon2013web.pdf\n\nGottaCon and Wyrd Miniatures are proud to present an exciting Lineup of Malifaux Tournaments throughout the weekend. Prizes will be awarded individually in each Tournament, and the Player with the most combined Tournament Points for the weekend will earn the title of GottaCon 2013 Malifaux Champion! Purchase of a GottaCon Malifaux ticket package secures a place in each Malifaux Tournament and is required for pre-registration and entry in the “First into the Breach”, “One Way Ticket”, and “Masters of Malifaux” Events, as well space is limited to 16 players for the three mentioned events.","28-Oct-12"],["Friday",2,"7:00pm","Minis","M06","Pulp Racing","By Corey Burger\nDay: Friday\nStart Time: 7:00pm\nMaximum number of Players: 6\n\nAre your driving skills up to the madness of an English countryside road in the 1930's? Dodge cows in your Model A, whip around stalled cars in your roadster, and generally play havoc. No skills, experience or English accent requires. 28mm with customized .45 Adventures 2nd rules.","24-Dec-12"],["Friday",2,"7:00pm","Minis","M05","Savage Showdown\n- Star Wars: Cargo Struggle ","By: Bayden Woodland\nDay: Friday\nStart Time: 7:00pm\nNumber of participants 1 to 4\n\nEvent Description: Savage Showdown is the miniatures battle version of the pulpy Savage Worlds RPG system. The rebels have made an alliance with the local space scum and are about to transport valuable black market weapons components off world, but the Empire has arrived just in time to stop them-or die trying. Newcomers welcome!","10-Dec-12"],["Friday",2,"7:00pm","Minis","M01","Warhammer 40K Apocalypse Prize Battle","By GottaCon\nSponsored by: Imperial Hobbies\nDay: Friday\nTime: 7:00pm\nPrice: Free\nMaximum number of participants: 20\n\n1000pt Armies, No paint restrictions\n\nCome out and take part in a free 40K Apocalypse tournament where you will have the chance to battle against others in an effort to grab and\/or hold objectives and win prizes. This event is a great way to warm up for the major Warhammer events that will begin on Saturday and continue into Sunday. Priority seating is granted to miniature package holders that have pre-regged for this event, followed by mini package holders then walk-ins.","17-Oct-12"],["Friday",2,"7:00pm","Minis","M02","Warhammer Lord of the Rings: War of the Ring \nTournament","By GottaCon\nSponsored by: Imperial Hobbies\nDay: Friday\nTime: 7:00pm\nPrice: Free with weekend minis package\nMaximum number of participants: 20\nPrizes: Prizes for best painted army, best sportsmanship and best general.\n\nFor complete details on this event please go here:  http:\/\/www.gottacon.com\/components\/2013warhammerrules.pdf\nor please speak with the event registration desk or the organizers of the event.","17-Oct-12"],["Friday",2,"7:00pm","Minis","M03","Warmachine\/Hordes Iron Arena ","By GottaCon\nSponsored by: Wiser's Collectibles \nDay: Friday, Saturday, and Sunday\nTime: All Slots\n\nAll weekend, day or night, Warmachine and Hordes players at GottaCon 2013 will be able to participate in the Iron Arena! Bring an army and play against an \nOpponent in this open-play format. You decide upon the points value for the games. Collect points and redeem them to pick up some great prizes!!","17-Oct-12"],["Friday",2,"7:30pm","Minis","M03","Warmachine\/Hordes Steamroller Doubles Tournament","By GottaCon\nSponsored by: Wiser's Collectibles\nDay: Friday\nTime: 7:30pm\nPrice: Free\nMaximum number of participants: 16 players(8 teams)\nPrizes: Prizes awarded to top teams\n\nSR 2013\/2013 rules with 4 rounds: Each player will bring a 25pt list (50pts for each team), Theme Forces: allowed., Standard Steamroller scenarios, Character restrictions\n\nTeams of two will face off against other teams battling it out for first overall in this four round event. Rules and restrictions as per the official doubles tournament format.","17-Oct-12"],["Friday",2,"7:00pm","RPG","R11"," Pathfinder RPG\n– Standard Action: The Cannibals are Crashing Life Day!","By Joanna Gaskell of Standard Action\nDay: Friday\nStart Time: 7:00pm\nNumber of participants: 3 to 5\n\nSnuffles the Badger, the party's animal companion, has been invited to share in the celebration of Owlbear Life Day, the seasonal Owlbear festivities of light and music. Snuffles invites the rest of the party along, and it looks to be a fantastic time. But what's this? The local halfling tribe of cannibals wasn't invited, and they're angry! Can the party save the Owlbears from the rampaging little cannibalistic creatures with furry feet? Will the halflings get fat on Owlbear this winter? Will there be Star Wars jokes? Of course there will!      Pre-generated characters will be the Season 2 Standard Action party (Edda, Martin, Fernando and Wendy) at level 3","6-Nov-12"],["Friday",2,"7:00pm","RPG","R05","Boundless RPG \n– Welcome to Legion","By Dan Spiller of Yellowjacket Comics\nDay: Friday\nStart Time: 7:00pm\nMaximum number of participants: 6\n\nAfter a routine expedition goes horribly wrong, our heroes find themselves stranded in uncharted territory. Trapped between an imminent war and a deadly necromantic plague, our heroes soon realize that their lack of provisions is the least of their concerns...   Boundless is a new fantasy-based Role Playing Game that is fast and easy to learn.  This scenario will be story-based, and prizes will be given out at random while supplies last.  Pre-generated characters will be provided.","13-Nov-12"],["Friday",2,"7:00pm","RPG","R06","Boundless RPG \n– Welcome to Legion","By Matthew Bartram of Yellowjacket Comics\nDay: Friday\nStart Time: 7:00pm\nMaximum number of participants: 6\n\nAfter a routine expedition goes horribly wrong, our heroes find themselves stranded in uncharted territory. Trapped between an imminent war and a deadly necromantic plague, our heroes soon realize that their lack of provisions is the least of their concerns...    Boundless is a new fantasy-based Role Playing Game that is fast and easy to learn.  This scenario will be story-based, and prizes will be given out at random while supplies last.  Pre-generated characters will be provided.","13-Nov-12"],["Friday",2,"7:00pm","RPG","R04","d20 Brickstyle \n– The Incident at Hrdan","By Kier Robins\nDay: Friday\nStart Time: 7:00pm\nNumber of participants: 4 to 7\n\nUVic LEGO Robotics Coordinator Kier Robins' pared down d20\/LEGO mashup rules are quick and fun, giving it a Blue Box feel, with just enough skills and feats to make building, jumping, running and hiding work. Players will have .5 level characters adapted from 3.0 D&D with classes like Warrior, Acolyte, Scholar, Builder, Noble, and Camp Follower. The LEGO Ethos of cartoon violence, get back up and keep playing and fun is adhered to. This makes it a perfect entry into Role Playing that is fun, safe, and nerfed silly, just like LEGO LotR.  Get your dice and bricks on!  Participants aged 7 and up welcome.","13-Nov-12"],["Friday",2,"7:00pm","RPG","R09","Dresden Files RPG \n– Introduction to the Dresden Files","By Jason Tice\nDay: Friday and Saturday\nStart Time: 7:00pm\nMaximum number of participants: 6\n\nThe Dresden Files is an Urban Supernatural Fantasy setting based on Jim Butcher’s book (and television) series of the same name.  This session will introduce you to the basics of the Dresden Files, and the FATE system of game-play.  Characters are pre-generated but customized at time-of-play.","13-Nov-12"],["Friday",2,"7:00pm","RPG","R08","Homebrew Star Wars Universe \n– Froth Barrel: HK-51: The Problematic Moments","By Dylan Kaye “Oakenkeg” Sharpe of The Froth Barrel Sodality\nDay: Friday\nStart Time: 7:00pm\nNumber of participants: 1 to 5\n\nThings just went downhill ever since the ship’s captain rebooted that ancient HK-51. Every transaction has been one damn blow up after another. Before our shift went to sleep, the captain was assessing a possible jump back to the Galactic Core. Now I awake to find the freighter landed on a rural planet. Engines are down, half the crew is gone, and I can see the HK droid communicating outside with planet residents. Correction, inhabitants have raised weapons, and yes, it appears HK-51 is now eliminating the local greeting committee. Smeg, there is what, five of us left on board? Wait for it, yep; the bloody HK unit is coming back. Hutt slime, I need a moment to think...                      Warning: mature gaming content.","13-Nov-12"],["Friday",2,"7:00pm","RPG","R10","Iron Kingdoms Roleplaying – Fools Rush In","By Nathan Bosa of Attack-Ex\nDay: Friday\nStart Time: 7:00pm\nMaximum number of participants: 4\n\nPrivateer Press has just released their new RPG called the Iron Kingdoms. Come and see what it is all about with a fun filled, action packed demo adventure called “Fools Rush In”.\nA fast paced, but very easy to learn quick start adventure, where your mercenary band is trying to become established by helping a city official rescue his family, all the while working in the shadows piecing together the facts of their disappearance, which turn out to be the real mystery. Without knowing who to trust, remember, only fools rush in!","6-Nov-12"],["Friday",2,"7:00pm","RPG","R03","Marvel Heroic Roleplaying\n– Ghost Box","By Justin Schmid\nDay: Friday\nStart Time: 7:00pm\nMaximum number of participants: 4\n\nYou're called to the scene of a bizarre murder involving strange mutants. In an investigation spanning the globe, you'll discover a secret that threatens to destroy the world. And it all comes back to the mysterious Ghost Box whose owner would rather die than give up its secrets. With new mutants popping up out of nowhere, you'll have to struggle with strange forces to unlock the mysteries of the Ghost Box: What is it and what is it's purpose? And what lengths will you go to to save the universe?\n\nTake on the role of X-Men in the Marvel Heroic Roleplaying RPG and help save the world!","29-Dec-12"],["Friday",2,"7:00pm","RPG","R02","Pathfinder RPG  \n– Pathfinder Society: The Blackros Matrimony","By Todd Conrod\nDay: Friday and Saturday\nStart Time: 7:00pm\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 3 to 7.\n\nThe eldest daughter of the prominent Blakros family is set to wed an influential Hellknight, and the Pathfinder Society is invited to the festivities. Dressed for a wedding befitting royalty, a team of Pathfinders attend the ceremony on behalf of the Decemvirate, but will their presence ultimately strengthen the Society's relationship with the influential Blakroses, or will events at the wedding bring the already tenuous alliance to a breaking point?","6-Nov-12"],["Friday",2,"7:00pm","RPG","R01","Pathfinder RPG \n– Pathfinder Society: Rise of the Goblin Guild","By David Van Ommen\nDay: Friday, Saturday, and Sunday\nStart Time: 7:00pm(Friday and Saturday), 2:00pm(Saturday), and 9:00am(Sunday)\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 1 to 5.\n\nWhen a monster is discovered on the grounds of the Pathfinder Lodge at Heidmarch Manor in Magnimar, an investigation into its appearance leads the PCs deep under the City of Monuments—and face to face with a burgeoning thieves’ guild.","6-Nov-12"],["Friday",2,"7:00pm","RPG","R07","RIFTS \n– Froth Barrel: Guns for Hire!","By James \"Beorgen Fæstrǽd\" Derksen of The Froth Barrel Sodality\nDay: Friday\nStart Time: 7:00pm\nNumber of participants: 3 to 6\n\nThe globe has changed since the Great Cataclysm, and now rifts in the fabric of time and space have linked the earth to countless other planets and dimensions, from which come creatures and monsters of all kinds. In a world of magic and technology, you and your group of bounty hunters find yourselves struggling to make a life for yourselves, until adventure finds you! If you have played RIFTS before, you will find the themes and environment familiar; if not, get ready for a fun adventure in a strange world.","6-Nov-12"],["Friday",2,"7:00pm","Special",6,"Miniature Painting Contest","By GottaCon\nDay: Friday to Saturday\nTime: See schedule below\nPrice: Free\nPrizes: Trophies will be provided for 1st as well as awards for 2nd and 3rd Place in each category.\nRules: can be found here: http:\/\/www.gottacon.com\/components\/tournaments\/paintingcompetitiongc2013.pdf\n\nCompetition Registration Schedule:\nFriday, February 1st, 5pm – 9pm  Saturday, February 2nd, 9am – 6pm\n\nCategories are open to any scale model from any genre or manufacturer. Maximum 1 entry per category, per contestant. All Entries must be in by Saturday 6pm! All figures entered can be picked-up by owners on Sunday, February 3rd  between 1pm – 5pm and no later than 5pm Sunday!","27-Oct-12"],["Friday",2,"7:00pm","Special Event",18,"Lego - Blind Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will have an ongoing blind build competition while our booths are open. Drop in, attempt to make the model and put your score on the leaderboard. We will be bringing a set of blind build stands where the participant won't be able to see what they are building but everyone else will!","24-Dec-12"],["Friday",2,"7:00pm","Special Event",18,"Lego - Kid Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will be hosting a kid ( and grown up kid ) build zone for the duration of Gottacon. You are welcome to come build at any time using the club's public brick buckets even if we are not manning our booth at the time. Parents are asked to monitor their children and everyone is welcome to leave your creations for the rest of the attendees to admire afterwards.","1-Jan-13"],["Friday",2,"7:00pm","Special Event",18,"Lego - Speed Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will have an ongoing speed build competition while our booths are open. Drop in, attempt to make the model as fast as possible, and put your score on the leaderboard.","24-Dec-12"],["Friday",2,"7:00pm","Special Event",18,"Lego - VicWars","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will be hosting their tabletop minifig game, VicWars, again this year with a few new rule additions for returning fans. Games will run for 2 hours and are drop in\/out, very easy to pickup. Appropriate for any age but parents need to attend their children. Check times posted on game table for any schedule changes.","1-Jan-13"],["Friday",2,"5:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n- GottaCon MTG Open (2013) \nPart 1 Constructed","By The GottaCon and Yellowjacket\nDay: Friday\nStart Time: Registration 5:00pm, flights begins at 6:30pm\nPrice: This event is included if you purchase the Magic: the Gathering weekend pass. The cost to participate in the entire M:TG Open is $40 (only includes entry into one Standard flight). If you have purchased a full weekend pass to GottaCon 2013 you must upgrade your pass to a Magic: the Gathering weekend pass. If you wish to only take part in the standard event and not the overall M:TG Open, entry is $10 per flight and you can not qualify for the finals. If you wish to only take part in the sealed event and not the overall M:TG Open, entry is $30 and you can not qualify for the finals.\nMaximum number of participants: 150\nPrizes: Will be awarded based on attendance in each flight.\n\nWelcome to the GottaCon MTG Open Tournament. This tournament consists of three formats (two qualifiers and one final) in which participants face off for hundreds of dollars in prizes. Qualifier finish order will be determined by the formats detailed below. In each format there is a prize pool to be won.\nIn Part one, each participant must bring their own Standard constructed deck (deck lists required) consisting of no less than 60 cards and follow the current standard constructed rules. This section of the MTG Open will consist of eight (8) flights of 16 to 32 players in each flight and will be single elimination style rounds. First place overall in each flight receives an invite to the top 16 Sunday at 2:00pm. Prizes will be awarded based on attendance in each flight.","28-Oct-12"],["Friday",2,"7:00pm","TCG","W01\nW02","DEMO - World of Warcraft - WoW Demo Event","By GottaCon and Skyhaven Games\nDay: Friday, Saturday, and Sunday\nTime: All daytime slots.\n\nCome learn to play the World of Warcraft Trading Card Game! Each demo will take only a short ten minutes, and we'll step you through the basics of the game! Then, if you like, you can enter our Beginner's Sealed Event, and play with a preconstructed starter. Play two rounds, get two free booster packs!","3-Nov-12"],["Friday",2,"7:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering - Intro Deck Duels Event","By GottaCon, Wizards of the Coast and Yellowjacket.\nDay: All weekend\nStart Time: 7:00PM Friday Night, ending Sunday at 4:00PM\nPrice: Free with MTG weekend pass or $15 at the Yellowjacket tournament reporting centre.\nMaximum number of participants: 150\nPrizes: To Be Determined\n\nEach participant will receive a random Intro Duel Deck. Participants may face off against any other Intro Pack Convention League participants in one game at any time over the span of the weekend and report the results, who won and who lost, on their record sheet as well as to the Yellowjacket reporting centre. Players are paired against other players and may not play the same player two (2) times in a row. The winner of the match will be granted two random cards from a pool of cards. The winner then may view and select one of those cards to keep and add it to their intro deck if they so choose and return the other card to the pool or cards. The loser will receive one random card to keep and add to their deck should they choose to. Decks must be a minimum 40 cards. There is no limit to the number of individual opponents you can play.","28-Oct-12"],["Friday",2,"7:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– Gunslinging ","By GottaCon and Yellowjacket Comics and Toys.\nStart time: All weekend at select times at the Yellowjacket tournament reporting centre\nPrice: Free\n\nFace off against professional level MTG players from BC. Win a game and you win a booster!","9-Dec-12"],["Friday",2,"7:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– Pickup Draft","By Yellowjacket Comics and Toys.\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nPrice: $15\nPrizes: 5-3-2-2","9-Dec-12"],["Friday",2,"7:00pm","TCG","Please\nVisit WOW\nTO Centre\nArea 6","World of Warcraft \n- Beginners Sealed Events","By GottaCon and Skyhaven Games\nDay: Friday, Saturday, and Sunday\nStart Time: 7:00pm(Friday), 1:00pm(Saturday), and 10:00am(Sunday)\nPrice: $10 + HST\n\nEach player receives one random 2011 class deck and then one War of the Elements booster after each round. With 10 players, two rounds of 30 minute rounds are played.","3-Nov-12"],["Friday",2,"9:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n- FNM Standard Constructed “I Flailed in the Flight\" Event","By GottaCon and Yellowjacket\nDay: Friday\nStart Time: 9:00pm\nPrice: Free with MTG weekend pass or $5 at the Yellowjacket tournament reporting centre.\nMaximum number of participants: 64\nPrizes: One booster per win.\n\nIf you didn’t do so well in the MTG Open part one and you don’t want to re-buy into another flight or maybe you just want to play some standard constructed in a casual environment we have just the event for you. GottaCon and Yellowjacket present the “I Flailed in the Flights” standard constructed event where there are a set number of four rounds of play and players receive one booster per win. Seating for this event is based on a first come, first serve basis and each player must sign up for this event at the Yellowjacket tournament reporting centre.","28-Oct-12"],["Friday",3,"11:00pm","BG","VCON 1","DEMO - VCON presents: The Walking Dead: The Board Game","By Rick Arino of VCon\nDay: Friday \nStart Time: 11:00pm\nNumber of participants: 2 to 6\n\nThe Walking Dead: The Board Game from Z-Man Games transforms the Robert Kirkman comic book series into a board game, giving \"fans the opportunity to play Rick, Shane, Andrea, and other favourite The Walking Dead characters as they deal with zombies, collect supplies and pick up the pieces of their lives\". Encounter and location cards recreate scenes and events from the comic book series.","1-Jan-13"],["Saturday",3,"12:00am","BG",3,"Board Game Library (Sign out Games to Play) ","By GottaCon\nDay: Friday, Saturday, and Sunday\nTime: All Slots\n\nThis year GottaCon is pleased to continue to have a library of board games that our attendees are free to sign out and play. Sign out games from the Event Registration Desk by requesting a game from our available titles and leaving behind a piece of ID. GottaCon would like to thank Days of Wonder, Mayfair Games, Rio Grande, Fantasy Flight Games, and AEG for making additions this year.","17-Oct-12"],["Saturday",3,"12:00am","BG","BG04","Level 7 [Escape]","By Nathan Bosa\nDay: Saturday and Sunday\nStart Time: 12:00am, with multiple sessions\nNumber of participants: 1 to 4 \n\nYou are a captive of Subterra Bravo, imprisoned in the facility’s deepest laboratory, the hall of nightmares known as LEVEL 7. Your singular goal is to escape.  Will you work together with your fellow prisoners to endure Subterra Bravo’s endless perils, or will you use them to secure your own escape? Ultimately, your chances of survival will depend on how well you manage your greatest weapon, which is also your greatest threat: fear itself. LEVEL 7 [ESCAPE] is a semi-cooperative, story-driven survival-horror board game for 1–4 players Published by Privateer Press. No Experience Necessary.","6-Nov-12"],["Saturday",3,"12:00am","BG","BG10\nBG12","The Core Gamers: Game of Thrones Tournament\n- Semi-Final","By Credence Holmes\nDay: Saturday \nStart Time: 12:00am\nMaximum number of participants: 8\nFinal: Sunday 12:00am\n\nThis is a Game of Thrones Tournament with 4 people per game maximum. The top players from each game can move on to the final game, Saturday at midnight for the chance to compete for a great prize! Played on the first edition base game. The winner will be decided by a point system based on number of wins and  votes cast by other players and the referee. Vote – biggest impact on game. (Most decisive move, best war, etc.) Vote – most fun in game. (Roleplay, amazing dice throwes, etc.) All players must be prepared for a full 4 hour game.","24-Dec-12"],["Saturday",3,"12:00am","EG","12\/13","Logitech PC and \nMad Catz Console Freeplay","Day: Friday, Saturday, and Sunday\nTime: All Slots\n\nCome and play some games at the Logitech PC LAN on the free-play stations or Mad Catz Console LAN. **The Logitech PC LAN free-play stations may not be used to participate in Premium tournaments.","30-Dec-12"],["Saturday",3,"12:00am","EG",12,"PC - Company of Heroes","By GottaCon and BC Gamer\nDay: Saturday\nStart Time: 12:00am\nGenre: Real-Time Strategy\nOfficial Website: http:\/\/store.steampowered.com\/app\/4560\/\n\nRelic’s award-winning World War 2 strategy game is guaranteed to produce chaos. Players will warm up in large battles of 4v4, and the more advanced strategists will carry on to battle for glory 1 on 1.","5-Nov-12"],["Saturday",3,"12:00am","EG",12,"PC - Free-play Servers ","By BC Gamer\nDay: Friday, Saturday, Sunday\nTime: All slots\n\nBC Gamer will be hosting the following servers all weekend long for players to join at their leisure: Team Fortress 2, Chivalry: Medieval Warfare, Counter-Strike: Source, Counter-Strike: Global Offensive, Minecraft, KillingFloor, TeamSpeak 3. End of Reality is hosting Shootmania:Storm and Battlefield 3.","8-Dec-12"],["Friday",3,"12:00am","EG",12,"PC - Minecraft Building Contest","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All slots\nJudged: Sunday 1:00pm\nGenre: Indie - Sandbox\nOfficial Website: https:\/\/minecraft.net\/\n\nShow us your digital creativity. We will have a Minecraft server running all weekend where individual players and building teams will construct anything they can imagine. The creations will be judged on Sunday by our panel of expert architectural critics.","5-Nov-12"],["Friday",3,"12:00am","EG",12,"PC - Tricky Truck: Time Trials","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nFinals: Sunday 2:00pm\nGenre: Indie - Racing\nOfficial Website: http:\/\/www.gravitysensation.com\/trickytruck\/\n\nThe ridiculousness of this simple game is sure to bring a smile to any one's face. You must navigate difficult terrain and park a large truck as quickly as possible. Sound easy? We will have a station running all weekend for people to hone their skills. Final time trials will take place on Sunday.","5-Nov-12"],["Saturday",3,"12:00am","RPG","R01","GottaCon Midnight Madness \n- Fire and Greed\n- Ice","By Tony Humphrey\nDay: Saturday\nStart Time: 12:00am\nNumber of Participants: 3 to 6\nTheme: Barbaric\n\nMidnight Madness is an RPG event where multiple tables work towards a common goal. Interactions between tables are encouraged and likely required, and cooperation is a must in order to succeed. Midnight Madness games take place in a unique continuity, and pregenerated characters are provided and must be used.\n\nThe goal for this year's Midnight Madness is cooperation.  The theme is based around a god, Greed, that is looking to destroy the world of mortals.  The players \nwill need to avoid temptation and help each other out in order to survive. ","1-Jan-13"],["Saturday",3,"12:00am","RPG","R03","GottaCon Midnight Madness \n- Fire and Greed\n- Stone","By Tony Humphrey\nDay: Saturday\nStart Time: 12:00am\nNumber of Participants: 3 to 6\nTheme: Western\n\nMidnight Madness is an RPG event where multiple tables work towards a common goal. Interactions between tables are encouraged and likely required, and cooperation is a must in order to succeed. Midnight Madness games take place in a unique continuity, and pregenerated characters are provided and must be used.\n\nThe goal for this year's Midnight Madness is cooperation.  The theme is based around a god, Greed, that is looking to destroy the world of mortals.  The players \nwill need to avoid temptation and help each other out in order to survive. ","1-Jan-13"],["Saturday",3,"12:00am","RPG","R06","GottaCon Midnight Madness \n- Fire and Greed\n- Water","By Tony Humphrey\nDay: Saturday\nStart Time: 12:00am\nNumber of Participants: 3 to 6\nTheme: Tribal\n\nMidnight Madness is an RPG event where multiple tables work towards a common goal. Interactions between tables are encouraged and likely required, and cooperation is a must in order to succeed. Midnight Madness games take place in a unique continuity, and pregenerated characters are provided and must be used.\n\nThe goal for this year's Midnight Madness is cooperation.  The theme is based around a god, Greed, that is looking to destroy the world of mortals.  The players \nwill need to avoid temptation and help each other out in order to survive. ","1-Jan-13"],["Saturday",3,"12:00am","RPG","R10","GottaCon Midnight Madness \n- Fire and Greed\n- Wind","By Tony Humphrey\nDay: Saturday\nStart Time: 12:00am\nNumber of Participants: 3 to 6\nTheme: Early Victorian\n\nMidnight Madness is an RPG event where multiple tables work towards a common goal. Interactions between tables are encouraged and likely required, and cooperation is a must in order to succeed. Midnight Madness games take place in a unique continuity, and pregenerated characters are provided and must be used.\n\nThe goal for this year's Midnight Madness is cooperation.  The theme is based around a god, Greed, that is looking to destroy the world of mortals.  The players \nwill need to avoid temptation and help each other out in order to survive. ","1-Jan-13"],["Saturday",3,"12:00am","RPG","RPG\nOverflow","GottaCon Midnight Madness \n- Fire and Greed\n- Wood","By Tony Humphrey\nDay: Saturday\nStart Time: 12:00am\nNumber of Participants: 3 to 6\nTheme: High Fantasy\n\nMidnight Madness is an RPG event where multiple tables work towards a common goal. Interactions between tables are encouraged and likely required, and cooperation is a must in order to succeed. Midnight Madness games take place in a unique continuity, and pregenerated characters are provided and must be used.","1-Jan-13"],["Saturday",3,"12:00am","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering - Intro Deck Duels Event","By GottaCon, Wizards of the Coast and Yellowjacket.\nDay: All weekend\nStart Time: 7:00PM Friday Night, ending Sunday at 4:00PM\nPrice: Free with MTG weekend pass or $15 at the Yellowjacket tournament reporting centre.\nMaximum number of participants: 150\nPrizes: To Be Determined\n\nEach participant will receive a random Intro Duel Deck. Participants may face off against any other Intro Pack Convention League participants in one game at any time over the span of the weekend and report the results, who won and who lost, on their record sheet as well as to the Yellowjacket reporting centre. Players are paired against other players and may not play the same player two (2) times in a row. The winner of the match will be granted two random cards from a pool of cards. The winner then may view and select one of those cards to keep and add it to their intro deck if they so choose and return the other card to the pool or cards. The loser will receive one random card to keep and add to their deck should they choose to. Decks must be a minimum 40 cards. There is no limit to the number of individual opponents you can play.","28-Oct-12"],["Saturday",3,"12:00am","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– Pickup Draft","By Yellowjacket Comics and Toys.\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nPrice: $15\nPrizes: 5-3-2-2","9-Dec-12"],["Saturday",5,"10:00am","BG","BG03\nto\nBG06","Race for the Galaxy Tournament","By Starlit Citadel\nSponsored by: Rio Grande Games\nDay: Saturday\nTime: 10:00am\nPrice: Free\nNumber of participants: Max of 16, Min of 4 players\n\nStarlit Citadel is hosting a free Race for the Galaxy tournament. The tournament requires a minimum of 4 participants with a $15 gift certificate to Starlit Citadel awarded to the winner. The format is two rounds of two games games. Players will be divided into tables of 4 players in each round and the top player at each table moves on to the next round. Placement is determined first by combined finishing score of the two games then by points for tie breaks. if 8 or less players, the top two players from each table move on to the next round.","18-Dec-11"],["Saturday",5,"10:00am","BG","BG07\nto\nBG12\n","Small World Tournament","By GottaCon and M3 Gamers\nSponsored by: Days of Wonder\nDay: Saturday\nStart Time: 10:00am\nPrice: Free\nMaximum number of participants: 24\nPrizes: Winner and runner up will receive prizes.\n\nThe tournament will be two rounds. The first round will be one game of Original Small World. At the end of the round the top player for each table will move on to round two. Round two will play one game of Small World Underground to determine a winner based on finishing rank.","18-Oct-12"],["Saturday",5,"9:00am","BG",3,"Board Game Library (Sign out Games to Play) ","By GottaCon\nDay: Friday, Saturday, and Sunday\nTime: All Slots\n\nThis year GottaCon is pleased to continue to have a library of board games that our attendees are free to sign out and play. Sign out games from the Event Registration Desk by requesting a game from our available titles and leaving behind a piece of ID. GottaCon would like to thank Days of Wonder, Mayfair Games, Rio Grande, Fantasy Flight Games, and AEG for making additions this year.","18-Dec-11"],["Saturday",5,"9:00am","BG","VCON 1","DEMO - VCON presents:  \nGalaxy Truckers","By Colin Fraser of VCon\nDay: Saturday \nStart Time: 9:00am\nNumber of participants: 2 to 4 (multiple sessions if time permits)\n\nIn a galaxy far, far away... they need sewer systems, too. Corporation Incorporated builds them. Everyone knows their drivers -- the brave men and women who fear no danger and would, if the pay was good enough, even fly through Hell.\n\nNow you can join them. You will gain access to prefabricated spaceship components cleverly made from sewer pipes. Can you build a space ship durable enough to weather storms of meteors? Armed enough to defend against pirates? Big enough to carry a large crew and valuable cargo? Fast enough to get there first? Of course you can. Become a Galaxy Trucker. It's loads of fun.","1-Jan-13"],["Saturday",5,"9:00am","BG","VCON 2","DEMO - VCON presents:  Pandemic","By Rick Arino of VCon\nDay: Saturday \nStart Time: 9:00am\nNumber of participants:  2 to 5 (multiple sessions if time permits)\n\nA Pandemic has broken out and as a member of the Center for Disease Control; you will need to find a cure before it gets out of hand! \nPandemic is a truly cooperative game where all players represent members of a team of experts that must find the cure to four virulent diseases before they wipe out the world's population. Want to get prepared for the Giant Pandemic Game happening at 7pm... come learn or refresh your memory with the smaller version first.","1-Jan-13"],["Saturday",5,"9:00am","BG","BG01","German Games Morning ","By Michael Poplawski \nDay: Saturday\nStart Time: 9:00am\nMaximum of participants: 6\n\nMichael Poplawski presents German Games Morning at GottaCon! Come demo several Spiel des Jahres winners and nominees, including Zug um Zug Märklin, Auf Achse, Die Speicherstadt, Bezzerwizzer, Funkenschlag, Thurn und Taxis and more! Michael also provides a free service for importing games from Germany. German Games Night takes place regularly throughout the year. Play great games and have fun learning about Germany, the German language, and German games.","27-Nov-12"],["Saturday",5,"9:00am","BG","M3\nGamers 1","M3 Gamers presents: Ascension","By M3 Gamers\nDay: Saturday \nStart Time: 9:00am\nNumber of participants: 2 to 4 (multiple sessions if time permits)\n\nAscension: Chronicles of the Godslayer tells the story of a great battle in and around the glorious human kingdom of Vigil, and the rise of one brave mortal (you, the Godslayer!) from anonymity to fame as humanity’s greatest champion. Recruit allies and heroes to you side, find great constructs and do battle with monstrous creatures to make your name in Ascension: Chronicles of the Godslayer.","9-Dec-12"],["Saturday",5,"9:00am","BG","M3\nGamers 2","M3 Gamers presents: Mystery in the Abbey","By M3 Gamers\nDay: Saturday \nStart Time: 9:00am\nNumber of participants: 2 to 6\n\nMystery of the Abbey is a murder mystery board game, in the tradition of Clue. A murder has been committed in an Abbey in medieval France and players must work to uncover the murderer before he strikes again.\n\nIn Mystery of the Abbey the goal is to solve the murder (or be the closest to doing so). Players gain points by correctly guessing each of the 5 characteristics of the culprit. Additional points are awarded for being correct on who the culprit is but points are taken away for incorrect guesses. Players start with 2 suspect cards (out of 24) and move through the Abbey, utilizing the different rooms to elicit further information about the killer. Players can also directly question other players when they meet, though players may choose not to answer. At the end of a set number of turns, players exchange suspect cards, providing them additional information to find the killer.","9-Dec-12"],["Saturday",5,"9:00am","BG","BG02","The Core Gamers: Through the Ages: A Story of Civilization Tournament - Semi-Final","By Credence Holmes\nDay: Saturday\nStart Time: 9:00am\nNumber of participants:  4 to 8\nFinal: Sunday 9:00am\n\nThis is a Through the Ages tournament where the top players of each game get the chance to compete for a great prize during Sunday's final round. The winner is chosen through a points system based on: number of wins, a vote on biggest impact on game (Best card choice, best military action, etc.), and a vote for most fun player in game (Roleplay, card choices, etc.) Most games are 3 players; some may be 2 or 4 player.\n\nThere'll be some adaptations to the rules: 1) Each player starts with 1 defense card 2) A notification card is placed in the deck 8-16 cards from the end of the age based upon the number of players playing. 3) Some cards have adjustments found at http:\/\/thecoregamers.yolasite.com\/games.php ","24-Dec-11"],["Saturday",5,"10:00am","EG",13,"SNES – Super Bomberman 2 ","By GottaCon and IRL Events\nDay: Saturday\nStart Time: 10:00am\nMaximum number of participants: 16\n\nThis tournament will be single elimination four player free for all. Rounds are best of 3, matches will be seeded randomly. No computer players. Time limit of 5 minutes per match. Gold Bomber is disabled, all matches played on Stage 1.","11-Dec-12"],["Saturday",5,"10:00am","EG",13,"Xbox 360 - Premium Halo 4 \nFree for All Tournament","By GottaCon and IRL Events\nSponsored by: Mad Catz\nDay: Saturday\nStart Time: 10:00am\nPrice: Requires video game add-on\nMaximum number of participants: 64\nPrizes: The first place player will receive a prize package from Mad Catz valued at over $200. The second place player will receive a prize package from Mad Catz valued at over $100. The third place player will receive a prize package from Mad Catz valued at over $75.\n\nGet your twitch finger ready and your heart rate up because reaction time is your best weapon in this event. Eight players at a time will face off in this free for all event with the bottom four scores in each round receiving a loss. This is a double elimination tournament (players will not be counted out until their second loss. No personal profiles, No recoveries and or HD swaps will be allowed. MLG rule sets will be followed for this event and full rules and restrictions will be made available on the GottaCon website.\n\nPlayers may register at the GottaCon Event Registration up to 1 hour before the tournament starts, after which they must register with IRL Events in the console area. All players must-sign in at least 15 minutes before the start of the tournament.\n\nDue to the game rating of “M” for Mature anyone under the age of 17 is required to get parental permission to compete. Please find a parental consent form HERE: http:\/\/www.gottacon.com\/components\/egpermission2012.pdf","11-Dec-12"],["Saturday",5,"10:00am","EG",17,"Xbox 360 - Ultimate Marvel vs Capcom 3 Event","By Canadian Joystick and CrossXover\nDay: Saturday\nTime: Registration starts at 10:00am with the event kicking off at 10:30am\nMaximum number of participants: 32\n\nWe will be using the following tournament format and rules (http:\/\/shoryuken.com\/evo-player-guide\/evo-tournament-rules\/). Players will be placed in pods of four or eight (depending on turnout) and face off against opponents in their pod with similar win\/loss records in a double elimination qualification round. Top two from each pod move on to the semi-finals. Finals will feature the top four or eight from the semis. Bring your own fighting stick or use the ones provided by our Console LAN sponsors Mad Catz!","11-Dec-12"],["Saturday",5,"9:00am","EG","12\/13","Logitech PC and \nMad Catz Console Freeplay","Day: Friday, Saturday, and Sunday\nTime: All Slots\n\nCome and play some games at the Logitech PC LAN on the free-play stations or Mad Catz Console LAN. **The Logitech PC LAN free-play stations may not be used to participate in Premium tournaments.","30-Dec-12"],["Saturday",5,"9:00am","EG",12,"PC - Free-play Servers ","By BC Gamer\nDay: Friday, Saturday, Sunday\nTime: All slots\n\nBC Gamer will be hosting the following servers all weekend long for players to join at their leisure: Team Fortress 2, Chivalry: Medieval Warfare, Counter-Strike: Source, Counter-Strike: Global Offensive, Minecraft, KillingFloor, TeamSpeak 3. End of Reality is hosting Shootmania:Storm and Battlefield 3.","8-Dec-12"],["Saturday",5,"9:00am","EG",12,"PC - Minecraft Building Contest","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All slots\nJudged: Sunday 1:00pm\nGenre: Indie - Sandbox\nOfficial Website: https:\/\/minecraft.net\/\n\nShow us your digital creativity. We will have a Minecraft server running all weekend where individual players and building teams will construct anything they can imagine. The creations will be judged on Sunday by our panel of expert architectural critics.","5-Nov-12"],["Saturday",5,"9:00am","EG",12,"PC - Premium League of Legends Tournament (5vs5) \nRound 1 – Pool Play","By GottaCon and LANcouver\nSponsored by: Logitech\nDay: Saturday\nTime: 9:00am to 3:00pm\nPrice: Requires video game add-on, and access to a BYOC computer that no one else is using during the tournament.\nMaximum number of teams: 16\nPrizes: 1st place: Five identical prizes bundles containing a G710+ & G400 mouse. 2nd place: Five identical prizes bundles containing a G35 headset. 3rd Place: Five identical prizes bundles containing a G400 mouse. Please note we are still waiting to hear back from Riot around skin bundles.\nTEAM CHECK-IN\nAll teams must check in when all members are at the venue with a working connection to the LAN. Teams are not allowed to check in for members who are not at the venue, and only complete teams with five players present at the designated tournament start time will be entered in to the tournament. Team Check-In begins at 6:00pm on Friday and continues until 12:00am, resuming at 8:00am Saturday morning. Any teams not registered before 8:30am on Saturday may not be entered in to the tournament. Player Registration via Warhorn is strongly recommended and guarantees entry to the tournament with your paid GottaCon 2013 Pass & Premium Video Game add-on.\nGENERAL RULES\nAll matches will be created using custom feature. Matches will use Tournament Draft Setting. Team Captains with higher seed will create game lobby and decide if they want first pick\/ban (blue side) or Last pick (purple side). In a Best of 3, the loser of each game will create the game lobby of game 2 (or 3) and will decide first pick\/ban (blue side) or Last pick (purple side). The Live Realm (NA Server) will be used for all Matches and players will use their own accounts.\nRound 1 – Pool Play (Format: Round Robin, best-of-one, Summoner’s Rift)\nTeams will be randomly seeded in to four pools of four teams each, and will play a Round Robin with matches being best-of-one. The top two teams from each pool will move on to bracket play.","28-Oct-12"],["Saturday",5,"9:00am","EG",12,"PC - Tricky Truck: Time Trials","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nFinals: Sunday 2:00pm\nGenre: Indie - Racing\nOfficial Website: http:\/\/www.gravitysensation.com\/trickytruck\/\n\nThe ridiculousness of this simple game is sure to bring a smile to any one's face. You must navigate difficult terrain and park a large truck as quickly as possible. Sound easy? We will have a station running all weekend for people to hone their skills. Final time trials will take place on Sunday.","5-Nov-12"],["Saturday",5,"10:00am","Minis","M01","Warhammer 40K Two Day GottaCon Championship Tournament - Day 1","By GottaCon.\nDay: Saturday\nTime: 10:00am to 6:00pm\nPrice: $50 (includes full weekend entry)\nMaximum number of participants: 64\nPrizes: Prizes will be awarded in the following categories; first, second, third overall score, best painted army, best sportsmanship, and best general. \n\nFor complete details on this event please go here:  http:\/\/www.gottacon.com\/components\/2013warhammerrules.pdf\nor please speak with the event registration desk or the organizers of the event.","17-Oct-12"],["Saturday",5,"10:00am","Minis","M02","Warhammer Fantasy Two Day GottaCon Championship Tournament - Day 1","By GottaCon.\nDay: Saturday\nTime: 10:00am to 6:00pm\nPrice: $50 (includes full weekend entry)\nMaximum number of participants: 50\nPrizes: Prizes will be awarded in the following categories; first, second, third overall score, best painted army, best sportsmanship, and best general. \n\nFor complete details on this event please go here:  http:\/\/www.gottacon.com\/components\/2013warhammerrules.pdf\nor please speak with the event registration desk or the organizers of the event.","17-Oct-12"],["Saturday",5,"9:00am","Minis","M04","DEMO - Infinity","Day: Friday, Saturday, and Sunday\nStart Time: 7:00pm(Friday), 9:00am(Saturday), and 2:00pm(Sunday)\nNumber of participants: As seating allows\n\nOne hundred and seventy-five years into the future Humanity has managed to survive despite itself, but for how much longer? Infinity is a game with 28mm high metal miniatures that simulates combat and special operations in a science fiction environment with Manga aesthetics. No experience is necessary. Miniatures will be provided.","30-Oct-12"],["Saturday",5,"9:00am","Minis","M03","DEMO - Malifaux Demo Games","Day: Friday, Saturday, Sunday\nTime: All daytime slots\nMaximum number of participants: As Seating Allows\n\nTrigger-happy gunslingers, misguided Victorian science, hungry undead, and monsters hidden in every shadow; these are the terrors that will plague you in Malifaux. Are you willing to risk your soul for a chance at great wealth and power? Because it's the only thing you have worth trading. In Malifaux, you lead your crew in the battle for control of The Breach, a dark portal to a world of limitless magic. A Demonstrator will be on hand to provide introductory games to those wishing to learn this game. No Experience Necessary. Miniatures will be provided.","30-Oct-12"],["Saturday",5,"9:00am","Minis","M03","DEMO - Warmachine\/Hordes Demo Games ","Day: Friday, Saturday, Sunday\nTime: All daytime slots\nMaximum number of participants: As Seating Allows\n\nIn the Game WARMACHINE players take on the role of warcasters as they lead their titanic forces into battle. Warcasters possess significant martial prowess of their own as well as having hardened warriors and magical spells to bring to bear. No Experience Necessary. Miniatures provided.","30-Oct-12"],["Saturday",5,"9:00am","Minis","M03","Malifaux - First into the Breach, Story Encounter Tournament","By GottaCon\nSponsored by: Wyrd Miniatures\nDay: Saturday\nTime: 9:00am\nPrice: Included in Malifaux Ticket Package\nMaximum number of participants: 16\nRules Packet: http:\/\/www.gottacon.com\/components\/tournaments\/firstintothebreachgottacon2013web.pdf\n\nGottaCon and Wyrd Miniatures are proud to present an exciting Lineup of Malifaux Tournaments throughout the weekend. Prizes will be awarded individually in each Tournament, and the Player with the most combined Tournament Points for the weekend will earn the title of GottaCon 2013 Malifaux Champion! Purchase of a GottaCon Malifaux ticket package secures a place in each Malifaux Tournament and is required for pre-registration and entry in the “First into the Breach”, “One Way Ticket”, and “Masters of Malifaux” Events, as well space is limited to 16 players for the three mentioned events.","28-Oct-12"],["Saturday",5,"9:00am","Minis","M03","Warmachine\/Hordes Iron Arena ","By GottaCon\nSponsored by: Wiser's Collectibles \nDay: Friday, Saturday, and Sunday\nTime: All Slots\n\nAll weekend, day or night, Warmachine and Hordes players at GottaCon 2013 will be able to participate in the Iron Arena! Bring an army and play against an \nOpponent in this open-play format. You decide upon the points value for the games. Collect points and redeem them to pick up some great prizes!!","17-Oct-12"],["Saturday",5,"9:30am","Minis","M03","Warmachine\/Hordes Two Day Steamroller GottaCon Championship - Day 1","By GottaCon.\nSponsor: Privateer Press and One Stop Shop Cards & Games\nDay: Saturday\nTime: 9:30am to 6:30pm\nPrice: $50 (includes full weekend entry and any of the Warmachine tournaments)\nMaximum number of participants: 32\nPrizes: Prizes will be awarded in the following categories; first, second, and third overall score as well as best painted army.\n\nStarting Saturday morning at 9:30am our feature Warmachine\/Hordes GottaCon Steamroller Championship tournament begins. Day one will see three rounds of play and day two will see the final three rounds of play. Rules and restrictions as per the official Steamroller tournament format.","17-Oct-12"],["Saturday",5,"9:00am","RPG","R04","d20 Brickstyle\n– Questions in Qualdris","By Kier Robins\nDay: Saturday\nStart Time: 9:00am\nNumber of participants: 4 to 7\n\nUVic LEGO Robotics Coordinator Kier Robins' pared down d20\/LEGO mashup rules are quick and fun, giving it a Blue Box feel, with just enough skills and feats to make building, jumping, running and hiding work. Players will have .5 level characters adapted from 3.0 D&D with classes like Warrior, Acolyte, Scholar, Builder, Noble, and Camp Follower. The LEGO Ethos of cartoon violence, get back up and keep playing and fun is adhered to. This makes it a perfect entry into Role Playing that is fun, safe, and nerfed silly, just like LEGO LotR.  Get your dice and bricks on!    Participants aged 7 and up welcome.","13-Nov-12"],["Saturday",5,"9:00am","RPG","R06","nWo  – In the City","By Ric Jesson of Rabbit Hole Games\nDay: Saturday and Sunday\nStart Time: 9:00am(Saturday) , 12:00am(Sunday) and 4:00am(Sunday)\nMaximum number of participants: 7\n\nnWo is a role playing game based on a grim vision of our future.  This is a game of secrets, corporate control, and metaphysical powers.  Come join us for an adventure you won't soon forget.  Room for seven players, one d10 required.","13-Nov-12"],["Saturday",5,"9:00am","RPG","R05","Otherworlds: the Ul-Zaorith RPG\n– A Mystery of Circumstance","By Astra Crompton\nDay: Saturday\nStart Time: 9:00am\nMaximum number of participants: 5\n\nFive races, five chambers, a myriad of clues and only one way out. When five strangers wake up in a dungeon with no memory of how they arrived or why they were chosen, a game of wit, brawn and casting ensues to solve the puzzle that keeps them captive.\n\nPremade characters, d8 dice, and pencils provided.","29-Dec-12"],["Saturday",5,"9:00am","RPG","R03","Pathfinder RPG \n– Pathfinder Society: In Wrath's Shadow","Day: Saturday and Sunday\nStart Time: 9:00am\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 3 to 7.\n\nIn the ruins of Xin-Bakrakhan—seat of power of the Runelord of Wrath—the Pathfinder Society stands on the verge of a great discovery, but first the brave agents exploring the ruins must survive ages-old dangers and contemporary threats to return with the knowledge and wealth they’ve unearthed.","6-Nov-12"],["Saturday",5,"9:00am","RPG","R01","Pathfinder RPG \n– Pathfinder Society: Severing Ties","Day: Saturday and Sunday\nStart Time: 9:00am(Saturday) and 2:00pm(Saturday and Sunday)\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 1 to 5.\n\nThe Pathfinder Society has discovered a new Aspis Consortium base in the pirate city of Riddleport and sends a small team of agents to infiltrate the rival cell disguised as newly hired mercenaries from Magnimar. After proving their value to the Aspis Consortium by carrying out a number of tasks throughout the City of Cyphers, the Pathfinders can learn the location of one of the consortium's local allies and ensure that the support the Aspis Consortium is counting on from their friends won't come.","6-Nov-12"],["Saturday",5,"9:00am","RPG","R02","Pathfinder RPG \n– Pathfinder Society: The Disappeared","By Jonathan Ross\nDay: Saturday and Sunday\nStart Time: 9:00am(Saturday), 2:00pm(Saturday and Sunday), and 7:00pm(Saturday)\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 1 to 5.\n\nA powerful ally of the Pathfinder Society has disappeared, and no one but the Pathfinders even remembers that she ever existed. Can the PCs discover the fate of their missing associate, or will all memory of her be erased completely from history?","6-Nov-12"],["Saturday",5,"9:00am","RPG","R11","Pathfinder RPG \n– Standard Action: The Lair of the Mime King","By Rob Hunt of Standard Action\nDay: Saturday\nStart Time: 9:00am\nNumber of participants: 3 to 5\n\nEsra, the daughter of the nobleman formerly known as The Prince, has been attacked. Some foul individual broke in to her chambers and left behind a cursed item, which has afflicted her with the mime curse! The party is hired to help, and must journey to crypt of the Mime King in The Silent Mountains to retrieve the Lute of the Cacophonous Cover Songs - for it is said that if a bard plays the songs of other, more famous, bards, it can break all bardic curses from which the listeners suffer.                                                        Pre-generated characters will be the Season 2 Standard Action party (Edda, Martin, Fernando and Wendy) at level 3","6-Nov-12"],["Saturday",5,"9:00am","RPG","R07","Savage Worlds \n– 8,000BC","By Duncan MacRae\nDay: Saturday\nStart Time: 9:00am\nNumber of participants: 2 to 5\n\nA proud tribe of hunter\/gatherers is being threatened by a nearby group possessing powerful weapons and controlling great unfamiliar beasts. A group of the tribe's bravest men and women are sent to investigate, and perhaps find a solution to this grave situation.","6-Nov-12"],["Saturday",5,"9:00am","RPG","R08","Savage Worlds \n– Froth Barrel: Episode 1: Fight for Freedom!","By Takeda Anderson of The Froth Barrel Sodality\nDay: Saturday\nStart Time: 9:00am\nNumber of participants: 1 to 6\n\nYou were once a respected mercenary fighting with honour on behalf of anyone who paid you. Your fortunes turned ill one day. Your employer turned on his mercenaries...sacrificed them in order to make his escape. It soon became obvious that your forces were surrounded and hopelessly outclassed. In short order you and your men were captured. It has been some months as prisoners of war. You have been isolated on an island prison. You have all had little food and shelter but have endured nonetheless. The season begins to turn cold and a rumour has been circulating. It appears your captors are losing the war and the number of guards has decreased. Your captors may be ill-equipped to maintain their prison...it may be that you will all be killed rather than kept captive. You and your men must escape but how?","13-Nov-12"],["Saturday",5,"9:00am","RPG","R09","Traveller \n– Risky Endeavours","By Jon Woodland\nDay: Saturday\nStart Time: 9:00am\nMaximum number of participants: 6\n\nThe crew of the free trader “Blue Horizon” ply the space-lanes of the Spinward Marches; taking whatever cargo they can get to keep their ship flying and in one piece. Of course, if the right opportunity came along, they just might be willing to break the law for big payoffs. Looks like that opportunity is here! Play as the pilot, navigator, engineer, medic, gunner or steward of this small time trading vessel as they seek adventure, excitement, and profit in the backwaters of the Third Imperium.","6-Nov-12"],["Saturday",5,"9:00am","RPG","R10","Zombie Squad RPG \n– Sweet Meats","By Todd Glawson\nDay: Saturday and Sunday\nStart Time: 9:00am(Saturday and Sunday) and 2:00pm(Sunday)\nMaximum number of participants: 6\n\nEach player will have 2 characters: one male and one female. The object of the game is to get out of the city and to the safety of the open country.  Every couple for themselves OR you could work together as a larger group to get through the chaos and survive.  Along the way you will find weapons to combat the Zombies. But surely at the sacrifice of a character or two.","6-Nov-12"],["Saturday",5,"9:00am","Special",19,"GottaCon 2013 Gamers Silent Auction","By GottaCon\nDay: Saturday\nTime: 9:00am to 6:30pm\nSubmission Deadline: 5:30pm\n\nOn Saturday February 2nd only between 9:00am and 6:30pm come out and take part in the GottaCon gamers silent auction brought to you by GottaCon Conventions. Convention goers are welcome to bring out their own items for sale as well as bid on the wide variety of items that will be available.\n\nFor full details go here: http:\/\/www.gottacon.com\/?page_id=215","30-Oct-12"],["Saturday",5,"9:00am","Special",6,"Miniature Painting Contest","By GottaCon\nDay: Friday to Saturday\nTime: See schedule below\nPrice: Free\nPrizes: Trophies will be provided for 1st as well as awards for 2nd and 3rd Place in each category.\nRules: can be found here: http:\/\/www.gottacon.com\/components\/tournaments\/paintingcompetitiongc2013.pdf\n\nCompetition Registration Schedule:\nFriday, February 1st, 5pm – 9pm  Saturday, February 2nd, 9am – 6pm\n\nCategories are open to any scale model from any genre or manufacturer. Maximum 1 entry per category, per contestant. All Entries must be in by Saturday 6pm! All figures entered can be picked-up by owners on Sunday, February 3rd  between 1pm – 5pm and no later than 5pm Sunday!","27-Oct-12"],["Saturday",5,"9:00am","Special Event",18,"Lego - Blind Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will have an ongoing blind build competition while our booths are open. Drop in, attempt to make the model and put your score on the leaderboard. We will be bringing a set of blind build stands where the participant won't be able to see what they are building but everyone else will!","24-Dec-12"],["Saturday",5,"9:00am","Special Event",18,"Lego - Kid Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will be hosting a kid ( and grown up kid ) build zone for the duration of Gottacon. You are welcome to come build at any time using the club's public brick buckets even if we are not manning our booth at the time. Parents are asked to monitor their children and everyone is welcome to leave your creations for the rest of the attendees to admire afterwards.","1-Jan-13"],["Saturday",5,"9:00am","Special Event",18,"Lego - Speed Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will have an ongoing speed build competition while our booths are open. Drop in, attempt to make the model as fast as possible, and put your score on the leaderboard.","24-Dec-12"],["Saturday",5,"9:00am","Special Event",18,"Lego - VicWars","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will be hosting their tabletop minifig game, VicWars, again this year with a few new rule additions for returning fans. Games will run for 2 hours and are drop in\/out, very easy to pickup. Appropriate for any age but parents need to attend their children. Check times posted on game table for any schedule changes.","1-Jan-13"],["Saturday",5,"1:00pm","TCG","Please\nVisit WOW\nTO Centre\nArea 6","World of Warcraft \n- Beginners Sealed Events","By GottaCon and Skyhaven Games\nDay: Friday, Saturday, and Sunday\nStart Time: 7:00pm(Friday), 1:00pm(Saturday), and 10:00am(Sunday)\nPrice: $10 + HST\n\nEach player receives one random 2011 class deck and then one War of the Elements booster after each round. With 10 players, two rounds of 30 minute rounds are played.","8-Jan-12"],["Saturday",5,"10:00am","TCG","Please\nVisit WOW\nTO Centre\nArea 6"," World of Warcraft \n- GottaCon WoW TCG Sealed Tournament","By GottaCon Conventions and Skyhaven Games\nDay: Saturday\nStart time: Registration is at 10am and the event starts at 11pm.\nPrice: $30 + HST. If you have purchased the World of Warcraft full weekend package entry is free.\nPrizes: Will be award to the top four or eight based on attendance.\n\nWelcome to the World of Warcraft TCG GottaCon Championship – sealed deck event. Each player makes a minimum 30 card deck from the 6 packs they open, and can choose any Hero from the set used (we will be using the most recent set). This tournament features best of three rounds, timed to 60 minutes.\n\nIf you have any questions regarding World of Warcraft TCG Events please contact: skyhavenvictoria@shaw.ca","28-Oct-12"],["Saturday",5,"9:00am","TCG","Please\nVisit WOW\nTO Centre\nArea 6","DEMO - World of Warcraft - WoW Demo Event","By GottaCon and Skyhaven Games\nDay: Friday, Saturday, and Sunday\nTime: All daytime slots.\n\nCome learn to play the World of Warcraft Trading Card Game! Each demo will take only a short ten minutes, and we'll step you through the basics of the game! Then, if you like, you can enter our Beginner's Sealed Event, and play with a preconstructed starter. Play two rounds, get two free booster packs!","3-Nov-12"],["Saturday",5,"9:00am","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering - Intro Deck Duels Event","By GottaCon, Wizards of the Coast and Yellowjacket.\nDay: All weekend\nStart Time: 7:00PM Friday Night, ending Sunday at 4:00PM\nPrice: Free with MTG weekend pass or $15 at the Yellowjacket tournament reporting centre.\nMaximum number of participants: 150\nPrizes: To Be Determined\n\nEach participant will receive a random Intro Duel Deck. Participants may face off against any other Intro Pack Convention League participants in one game at any time over the span of the weekend and report the results, who won and who lost, on their record sheet as well as to the Yellowjacket reporting centre. Players are paired against other players and may not play the same player two (2) times in a row. The winner of the match will be granted two random cards from a pool of cards. The winner then may view and select one of those cards to keep and add it to their intro deck if they so choose and return the other card to the pool or cards. The loser will receive one random card to keep and add to their deck should they choose to. Decks must be a minimum 40 cards. There is no limit to the number of individual opponents you can play.","28-Oct-12"],["Saturday",5,"9:00am","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering - Massive Mini Master Event","By GottaCon, Wizards of the Coast and Yellowjacket.\nDay: Saturday, finals on Sunday\nTime: 9:00am\nCost: Free with MTG weekend pass or $10 at the Yellowjacket tournament reporting centre.\nMaximum number of participants: 150\nPrizes: To be determined, based on attendance.\n\nSimilar to what MTG fans experienced on Magic Celebration day and just like we did at GottaCon 2012, this format is a fast fun way to play Magic! Each participant will received two boosters and have 15 minutes to construct a 25 card minimum deck. Participants will then be paired in a single elimination format with 50 minute rounds. The winner of each round will receive an additional booster and will have 10 minutes to modify their decks with these new cards. After round three deck size must be a minimum of 40 cards. Participants will then be paired for the next round. This pattern will continue until there in one overall winner. Round for this event will discontinue at 2pm Saturday and any remaining player’s decks will be collected and boxed by judges at the tournament reporting desk. The final rounds will continue on Sunday at 9am. This is in an effort to reduce conflict with the MTG Open Sealed event which starts at 2pm.","28-Oct-12"],["Saturday",5,"9:00am","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– Gunslinging ","By GottaCon and Yellowjacket Comics and Toys.\nStart time: All weekend at select times at the Yellowjacket tournament reporting centre\nPrice: Free\nFace off against professional level MTG players from BC. Win a game and you win a booster!","9-Dec-12"],["Saturday",5,"9:00am","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– Pickup Draft","By Yellowjacket Comics and Toys.\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nPrice: $15\nPrizes: 5-3-2-2","9-Dec-12"],["Saturday",5,"10:00am","WS\/P","Panel Room","The Influence of D&D","Day: Saturday\nTime: 10:00am to 12:00pm\nPanelists: Alex Flagg, Douglas Lloyd, Joanna Gaskell, Chris Pramas\n\nD&D has influenced not only tabletop RPGs, but also video games, television, web series, and more. Join us as we discuss how D&D has grown from a game that was once frowned upon, to one that influences many aspects of both geek and popular culture, and how it has influenced the lives of individuals.","1-Jan-13"],["Saturday",5,"12:00pm","WS\/P","Panel Room","So You Want to Become a Published Author","Day: Saturday\nTime: 12:00pm to 2:00pm\nPanelists: Alyx Dellamonica, T.J. Silver, Dave Duncan, Matt Hughes\n\nIf you are an author who is trying to get your science fiction or fantasy book published, this panel will explore all aspects of getting published. From writing a manuscript; to finding an agent – or even if that is necessary; to shopping your book; to what to expect if your book is picked up by a publisher; and how to deal with rejection, these authors will talk about the ins and outs of the publishing business, and explore the variety of options and tools available.","1-Jan-13"],["Saturday",6,"2:00pm","BG",3,"Board Game Library (Sign out Games to Play) ","By GottaCon\nDay: Friday, Saturday, and Sunday\nTime: All Slots\n\nThis year GottaCon is pleased to continue to have a library of board games that our attendees are free to sign out and play. Sign out games from the Event Registration Desk by requesting a game from our available titles and leaving behind a piece of ID. GottaCon would like to thank Days of Wonder, Mayfair Games, Rio Grande, Fantasy Flight Games, and AEG for making additions this year.","18-Oct-12"],["Saturday",6,"2:00pm","BG","BG01","Bodger Games","By Nathan Bosa\nDay: Saturday and Sunday\nStart Time: 2:00pm, multiple sessions\nNumber of of participants: 2 to 4\n\nLooking for some wacky entertainment with a little dose of destruction? Every Bodgers game brings home fun for the whole family as you dive into the maniacal and mechanical mayhem of the always zany and sometimes dangerous goblin Bodgers. Come try out Three exciting Bodger Games by Privateer Press: ‘Infernal Contraption’, ‘Scrappers’, and ‘Heap’. No experience necessary","4-Nov-12"],["Saturday",6,"2:00pm","BG","BG09","DEMO - Discworld","By Mel Guille\nDay: Saturday\nStart Time: 2:00pm\nNumber of participants: 2 to 4 (multiple sessions as time permits)\n\nWelcome to Ankh-Morpork. Play as one of seven famous personalities from the well-known fantasy series Discworld. Depending on who you are, you'll want to conquer the city, spread chaos, make money, or just keep people guessing who you are until the very end. ","4-Jan-13"],["Saturday",6,"2:00pm","BG","BG11","DEMO - Puerto Rico","By Derek Turner\nDay: Saturday\nStart Time: 2:00pm\nNumber of participants: 2 to 5 (multiple sessions as time permits)\n\nWin by running your plantation more efficiently than your competitors: grow crops and store them efficiently, and, most importantly, ship your goods back to Europe for maximum points.","4-Jan-13"],["Saturday",6,"2:00pm","BG","VCON 1","DEMO - VCON presents:\n Quarriors","By Colin Fraser of VCon\nDay: Saturday \nStart Time: 2:00pm\nNumber of participants: 2 to 4 (multiple sessions as time permits)\n\nPlayers take on the roles of Quarriors - mighty mystical warriors who have the power to capture dangerous quarry from the untamed Wilds! They must conjure the mysterious powers of Quiddity, cast powerful spells, and summon their creatures to battle if they hope to overcome rivals and earn their rightful place as the Champion!\n\nQuarriors has the frenetic excitement of a dice battle game, with an added ‘deckbuilding’ twist: players customize their dice pools during the game using resources generated by their rolls.\nQuarriors takes the best of deckbuilding games without the tedium of shuffling. Take a typical deckbuilding game, add the speed and fun of dice and in 60 minutes you’re on your second or third game trying unique strategies against your opponents.","1-Jan-13"],["Saturday",6,"2:00pm","BG","M3\nGamers 1","M3 Gamers presents: Resident Evil","By M3 Gamers\nDay: Saturday \nStart Time: 2:00pm\nNumber of participants: 2 to 4 (multiple sessions if time permits)\n\nIn Resident Evil, a deadly virus has caused the dead to rise and infect any living thing they encounter! Fleeing to a mysterious mansion, you must gather any materials you can find to protect yourself and fight for your survival against a legion of infected beings!\n\nThe deck building game brings the story to life in a game of strategy where players construct their cards decks while they play. Choose one of your favorite characters from Resident Evil such as: Chris Redfield, Jill Valentine, or Albert Wesker among others. Players start with only the most basic of items and weapons. As the game progresses, players build their arsenal with additional Weapons, Ammunition, Action or Item cards to customize their deck and improve their ability in defeating “the Infected”! Your deck will be your lifeline to survival. How will you survive the zombie outbreak?","9-Dec-12"],["Saturday",6,"2:00pm","BG","M3\nGamers 2","M3 Gamers presents: Thunderstone","By M3 Gamers\nDay: Saturday \nStart Time: 2:00pm\nNumber of participants: 2 to 4 (multiple sessions if time permits)\n\nFor ages the vile Doom Knights have sought to gather the remaining Thunderstones to fulfill a prophecy of corruption over the lands. Now the first Thunderstone has been discovered in the Dungeons of Grimhold and the Doom Knights have sent their minions to claim the relic. The Villagers of Barrowsdale gather brave souls to face the dungeon and keep the Thunderstone out of the hands of the Doom Knights.\n\nThunderstone is a fantasy deck-building game. Fight the evils of the dungeon to prove your worth. Gain powerful weaponry and level into new and mighty hero classes. Claim the best cards and survive to take the Thunderstone.","9-Dec-12"],["Saturday",6,"2:00pm","BG","BG10\nBG12","Munchkin Victoria Open Tournament","By: MIB799 of Steve Jackson Games\nDay: Saturday\nStart Time: 2:00pm\nMaximum number of participants: 16\n\nKill the monsters - Steal the treasure - Stab your buddy. Anything goes in the race to Level 10! The annual Victoria Munchkin Tournament is ON, and the competition will be ruthless. Just remember, no cheating without a Cheat card! Do you have what it takes to screw over everyone else? Prizes for EVERYONE.","18-Nov-12"],["Saturday",6,"2:00pm","BG","BG03\nto\nBG08","Ticket to Ride Tournament","By GottaCon and M3 Gamers\nSponsored by: Days of Wonder\nDay: Saturday\nStart Time: 2:00pm\nPrice: Free\nMaximum number of participants: 24\nPrizes: Winner and runner up will receive prizes.\n\n The Ticket to Ride tournament will be a total of three rounds. The first round everyone will be randomly placed at a table and will play Ticket to Ride USA. Then each player will play a second round, but this time will play Ticket to Ride Europe if we do not have enough copies then we will just do another round of USA, however, all participants will be again randomly placed at a different table. After both rounds, the top four players with highest combined total scores will move on to the finals where they will play Ticket to Ride Asia. Prizes will be awarded to the winner and the runner up of the tournament.","18-Oct-12"],["Saturday","6","2:00pm","BG","BG02","Twilight Imperium 3rd Ed. Demo","By Darin Nieuwendorp\nDay: Saturday\nTime: 2:00pm to 8:00pm\nNumber of participants: 4 to 6 \n\nAn introduction to Twilight Imperium 3rd Edition. An epic space game of civilization, build an empire and Claim the throne of the Imperium!","22-Nov-12"],["Saturday",6,"2:00pm","BG","VCON 2","VCON presents: Free Play","By Cam Brenner of VCon\nDay: Saturday \nStart Time: 2:00pm\nNumber of participants: 2 to 6\n\nCome play with us. VCON is taking on all challengers. First folk to the table can help decide what we're playing!","1-Jan-13"],["Saturday",6,"2:00pm","EG","12\/13","Logitech PC and \nMad Catz Console Freeplay","Day: Friday, Saturday, and Sunday\nTime: All Slots\n\nCome and play some games at the Logitech PC LAN on the free-play stations or Mad Catz Console LAN. **The Logitech PC LAN free-play stations may not be used to participate in Premium tournaments.","30-Dec-12"],["Saturday",6,"2:00pm","EG",12,"PC - Free-play Servers ","By BC Gamer\nDay: Friday, Saturday, Sunday\nTime: All slots\n\nBC Gamer will be hosting the following servers all weekend long for players to join at their leisure: Team Fortress 2, Chivalry: Medieval Warfare, Counter-Strike: Source, Counter-Strike: Global Offensive, Minecraft, KillingFloor, TeamSpeak 3. End of Reality is hosting Shootmania:Storm and Battlefield 3.","8-Dec-12"],["Saturday",6,"2:00pm","EG",12,"PC - Minecraft Building Contest","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All slots\nJudged: Sunday 1:00pm\nGenre: Indie - Sandbox\nOfficial Website: https:\/\/minecraft.net\/\n\nShow us your digital creativity. We will have a Minecraft server running all weekend where individual players and building teams will construct anything they can imagine. The creations will be judged on Sunday by our panel of expert architectural critics.","5-Nov-12"],["Saturday",6,"2:00pm","EG",12,"PC - Tricky Truck: Time Trials","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nFinals: Sunday 2:00pm\nGenre: Indie - Racing\nOfficial Website: http:\/\/www.gravitysensation.com\/trickytruck\/\n\nThe ridiculousness of this simple game is sure to bring a smile to any one's face. You must navigate difficult terrain and park a large truck as quickly as possible. Sound easy? We will have a station running all weekend for people to hone their skills. Final time trials will take place on Sunday.","5-Nov-12"],["Saturday",6,"2:00pm","EG",13,"Wii – Mario Kart Wii ","By GottaCon and IRL Events\nDay: Saturday\nStart Time: 2:00pm\nMaximum number of participants: 16\n\nThis tournament will be single elimination four player free for all. Each round is played on 100cc Mushroom Cup Grand Prix. Computer players fill in any missing players. Matches will be seeded randomly, final round is played on 100cc Flower Cup Grand Prix.","11-Dec-12"],["Saturday",6,"2:00pm","EG",null,"Xbox 360 – Premium Super Street Fighter IV: Arcade Edition Tournament ","By GottaCon Conventions GottaCon Conventions, Canadian Joystick, and CrossXover.\nSponsored by: Mad Catz\nDay: Saturday\nTime: Registration starts at 2:00pm with the event kicking off at 2:30pm\nPrice: Requires video game add-on (yes you can bring your own stick)\nMaximum number of participants: 64\nPrizes: The first place player will receive a prize package from Mad Catz and Future Shop valued at over $150.\nThe second place player will receive a prize package from Mad Catz valued at over $100. The third place player will receive a prize package from Mad Catz valued at over $75.\n\nWe will be using the following tournament format and rules: http:\/\/evo.shoryuken.com\/evo-player-guide\/evo-tournament-format\/. Players will be placed in pods of 8 players and face off against opponents in their pod with similar win\/loss records in a double elimination qualification round. Top two from each pod move on to the semifinals. Finals will feature the top 8 from the semis. Please note there will be no downloadable content available in this even","10-Dec-12"],["Saturday",6,"3:00pm","EG",12,"PC – Premium StarCraft II Tournament - \nRound 1 – Open Pool Play","By GottaCon and LANcouver\nSponsored by: Antec and Kingston HyperX\nDay: Saturday\nTime: 3:00pm to 9:00pm\u2028\nPrice: requires video game add-on, and access to a BYOC computer that no one else is using during the tournament.\nMaximum number of participants: 32 (there is no league or ranking requirement for the tournament), player cap may change based on advance registration of this event. The following format is based on 32 players participating in the tournament and is subject to change based on attendance or other factors.\nPrizes: The first place player will receive a prize package from Antec and Kingston HyperX. The second place player will receive a prize package from Antec and Kingston HyperX. The third place player will receive a prize package from Antec and Kingston HyperX.\n\nRound 1 – Open Pool Play (Format: Round Robin, best-of-one matches)\nAll competitors are spread out over four pools. Players are distributed in these pools based on their current SC2 ranking. Each player plays seven matches in a round robin, and the top two players from each pool move on to a finals bracket. For complete rules: http:\/\/www.gottacon.com\/?page_id=1331#sc2","17-Oct-12"],["Saturday",6,"10:00am\n(slot 5)","Minis","M03","Warhammer 40K Two Day GottaCon Championship Tournament - Day 1","By GottaCon.\nDay: Saturday\nTime: 10:00am to 6:00pm\nPrice: $50 (includes full weekend entry)\nMaximum number of participants: 64\nPrizes: Prizes will be awarded in the following categories; first, second, third overall score, best painted army, best sportsmanship, and best general. \n\nFor complete details on this event please go here:  http:\/\/www.gottacon.com\/components\/2013warhammerrules.pdf\nor please speak with the event registration desk or the organizers of the event.","17-Oct-12"],["Saturday",6,"10:00am\n(slot 5)","Minis","M03","Warhammer Fantasy Two Day GottaCon Championship Tournament - Day 1","By GottaCon.\nDay: Saturday\nTime: 10:00am to 6:00pm\nPrice: $50 (includes full weekend entry)\nMaximum number of participants: 50\nPrizes: Prizes will be awarded in the following categories; first, second, third overall score, best painted army, best sportsmanship, and best general. \n\nFor complete details on this event please go here:  http:\/\/www.gottacon.com\/components\/2013warhammerrules.pdf\nor please speak with the event registration desk or the organizers of the event.","17-Oct-12"],["Saturday",6,"2:00pm","Minis","M03","DEMO - Malifaux Demo Games","Day: Friday, Saturday, Sunday\nTime: All daytime slots\nMaximum number of participants: As Seating Allows\n\nTrigger-happy gunslingers, misguided Victorian science, hungry undead, and monsters hidden in every shadow; these are the terrors that will plague you in Malifaux. Are you willing to risk your soul for a chance at great wealth and power? Because it's the only thing you have worth trading. In Malifaux, you lead your crew in the battle for control of The Breach, a dark portal to a world of limitless magic. A Demonstrator will be on hand to provide introductory games to those wishing to learn this game. No Experience Necessary. Miniatures will be provided.","30-Oct-12"],["Saturday",6,"2:00pm","Minis","M03","DEMO - Warmachine\/Hordes Demo Games ","Day: Friday, Saturday, Sunday\nTime: All daytime slots\nMaximum number of participants: As Seating Allows\n\nIn the Game WARMACHINE players take on the role of warcasters as they lead their titanic forces into battle. Warcasters possess significant martial prowess of their own as well as having hardened warriors and magical spells to bring to bear. No Experience Necessary. Miniatures provided.","30-Oct-12"],["Saturday",6,"2:00pm","Minis",null,"Even Whites Bleed Red, A Russian Civil War Battle","By Brian Burger.\nDay: Saturday\nStart Time: 2:00pm\nNumber of Players: 2 to 6\nSystem: \"Through The Mud & The Blood\" from TooFatLardies, 28mm figures.\n\nSomewhere in southern Russian early in the Russian Civil War, White Russian and Red forces clash to control a hamlet and the rail line that runs through it. No experience necessary.","3-Jan-13"],["Saturday",6,"2:00pm","Minis","M03","Malifaux - One Way Ticket, Gaining Ground Tournament","By GottaCon\nSponsored by: Wyrd Miniatures\nDay: Saturday\nTime: 2:00pm\nPrice: Included in Malifaux Ticket Package\nMaximum number of participants: 16\n\nRules Packet: http:\/\/www.gottacon.com\/components\/tournaments\/onewayticketgottacon2013web.pdf\n\nGottaCon and Wyrd Miniatures are proud to present an exciting Lineup of Malifaux Tournaments throughout the weekend. Prizes will be awarded individually in each Tournament, and the Player with the most combined Tournament Points for the weekend will earn the title of GottaCon 2013 Malifaux Champion! Purchase of a GottaCon Malifaux ticket package secures a place in each Malifaux Tournament and is required for pre-registration and entry in the “First into the Breach”, “One Way Ticket”, and “Masters of Malifaux” Events, as well space is limited to 16 players for the three mentioned events.","28-Oct-12"],["Saturday",6,"2:00pm","Minis","M03","Warmachine\/Hordes Iron Arena ","By GottaCon\nSponsored by: Wiser's Collectibles \nDay: Friday, Saturday, and Sunday\nTime: All Slots\n\nAll weekend, day or night, Warmachine and Hordes players at GottaCon 2013 will be able to participate in the Iron Arena! Bring an army and play against an \nOpponent in this open-play format. You decide upon the points value for the games. Collect points and redeem them to pick up some great prizes!!","17-Oct-12"],["Saturday",6,"5:00pm","Minis","M03","Warmachine\/Hordes Team \nTournament","By GottaCon\nSponsored by: Wiser's Collectibles \nDay: Saturday\nStart Time: 5:00pm\nPrice: Free\nMaximum number of participants: 36 players(12 teams)\nPrizes: Prizes awarded to top teams. Additional prizes will be awarded for best team appearance\/name\n\nThis event will pit teams of 3 players against each other in a chess style tournament. Retailers, Game Clubs and Groups of Friends are encouraged to put a team \n(or multiple teams) together and represent yourselves this year at GottaCon!! Each of the 3 players will be ranked by skill level: General, Captain, and Lieutenant. \nEach rank will be matched against the same rank during matches. Come out and show everyone why you think your team is the best!!","17-Oct-12"],["Saturday",6,"9:30am\n(slot 5)","Minis","M03","Warmachine\/Hordes Two Day Steamroller GottaCon Championship - Day 1","By GottaCon.\nSponsor: Privateer Press and One Stop Shop Cards & Games\nDay: Saturday\nTime: 9:30am to 6:30pm\nPrice: $50 (includes full weekend entry and any of the Warmachine tournaments)\nMaximum number of participants: 32\nPrizes: Prizes will be awarded in the following categories; first, second, and third overall score as well as best painted army.\n\nStarting Saturday morning at 9:30am our feature Warmachine\/Hordes GottaCon Steamroller Championship tournament begins. Day one will see three rounds of play and day two will see the final three rounds of play. Rules and restrictions as per the official Steamroller tournament format.","17-Oct-12"],["Saturday",6,"2:00pm","RPG","R05","Boundless RPG \n– The Tower of the Watcher","By Dan Spiller of Yellowjacket Comics\nDay: Saturday\nStart Time: 2:00pm\nMaximum number of participants:  6\n\nWho is the Watcher? and what secrets does he keep locked deep within his tower? Armed with swords, spells, and an animated eyeball in a box, our heroes enter the fabled Watcher's Tower in hopes of uncovering the secrets to power, glory, and fame.\n\nBoundless is a new fantasy-based Role Playing Game that is fast and easy to learn.  This scenario will be a dungeon crawl, and prizes will be given out at random while supplies last.  Pre-generated characters will be provided.","13-Nov-12"],["Saturday",6,"2:00pm","RPG","R05","Boundless RPG \n– The Tower of the Watcher","By Matthew Bartram of Yellowjacket Comics\nDay: Saturday\nStart Time: 2:00pm\nMaximum number of participants:  6\n\nWho is the Watcher? and what secrets does he keep locked deep within his tower? Armed with swords, spells, and an animated eyeball in a box, our heroes enter the fabled Watcher's Tower in hopes of uncovering the secrets to power, glory, and fame.\n\nBoundless is a new fantasy-based Role Playing Game that is fast and easy to learn.  This scenario will be a dungeon crawl, and prizes will be given out at random while supplies last.  Pre-generated characters will be provided.","13-Nov-12"],["Saturday",6,"2:00pm","RPG","R11","Dragon Age RPG\n– Green Ronin: The Ostwick Irregulars","By Chris Pramas of Green Ronin\nDay: Saturday\nStart Time: 2:00pm\nMaximum number of participants: 6\n\nJoin designer Chris Pramas for a taste of the Dragon Age RPG. You are members of the Ostwick Irregulars, a tough band of mercs from the Free Marches. The mission to Kirkwall sounds easy enough and it even involves beer. Nothing in Thedas is at seems, of course, so you best keep your wits about you in The City of Chains.","29-Dec-12"],["Saturday",6,"2:00pm","RPG","R07","Fiasco \n– Froth Barrel: Dragon Slayers","By Courtney “Lady Dame Saf” Raines of The Froth Barrel Sodality\nDay: Saturday\nStart Time: 2:00pm\nNumber of participants: 3 to 6\n\nThe bumpkins in this mountain town could never have taken down that dragon. Their biggest hero hasn't seen battle since Drozzek rode down from the Smoking Mountains three wars-to-end-all-wars ago. So yeah, we rode into town, a bunch of outsiders ready to solve that problem. And no, we don’t care what they think. And yes, we’re heroes. These yokels should worship at our feet. They sure as hell didn’t slay that dragon. That’s our dragon, and its gold is our gold. So unless you’re bringing us ale, get out before we transform you into a turkey and serve you for dinner.","13-Nov-12"],["Saturday",6,"2:00pm","RPG","R08","Homebrew Star Wars Universe \n– Froth Barrel: Imperial Intelligence","By Dylan Kaye “Darth Hoarfrost” Sharpe of The Froth Barrel Sodality\nDay: Saturday\nStart Time: 2:00pm\nNumber of participants: 1 to 5\n\n36 GrS, your cell serves the Ubiqtorate deep in the Coruscant undercity. Intelligence has ordered three marks terminated. Targets confirmed to be Black Sun. Communication ended with no further data. Warning: mature gaming content.","13-Nov-12"],["Saturday",6,"2:00pm","RPG","R01","Pathfinder RPG \n– Pathfinder Society: Rise of the Goblin Guild","By Jonathan Ross\nDay: Friday, Saturday, and Sunday\nStart Time: 7:00pm(Friday and Saturday), 2:00pm(Saturday), and 9:00am(Sunday)\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 1 to 5.\n\nWhen a monster is discovered on the grounds of the Pathfinder Lodge at Heidmarch Manor in Magnimar, an investigation into its appearance leads the PCs deep under the City of Monuments - and face to face with a burgeoning thieves’ guild.","6-Nov-12"],["Saturday",6,"2:00pm","RPG","R02","Pathfinder RPG \n– Pathfinder Society: Severing Ties","By David Van Ommen\nDay: Saturday and Sunday\nStart Time: 9:00am(Saturday) and 2:00pm(Saturday and Sunday)\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 1 to 5.\n\nThe Pathfinder Society has discovered a new Aspis Consortium base in the pirate city of Riddleport and sends a small team of agents to infiltrate the rival cell disguised as newly hired mercenaries from Magnimar. After proving their value to the Aspis Consortium by carrying out a number of tasks throughout the City of Cyphers, the Pathfinders can learn the location of one of the consortium's local allies and ensure that the support the Aspis Consortium is counting on from their friends won't come.","6-Nov-12"],["Saturday",6,"2:00pm","RPG","R03","Pathfinder RPG \n– Pathfinder Society: The Disappeared","By Mike Dowd\nDay: Saturday and Sunday\nStart Time: 9:00am(Saturday), 2:00pm(Saturday and Sunday), and 7:00pm(Saturday)\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 1 to 5.\n\nA powerful ally of the Pathfinder Society has disappeared, and no one but the Pathfinders even remembers that she ever existed. Can the PCs discover the fate of their missing associate, or will all memory of her be erased completely from history?","6-Nov-12"],["Saturday",6,"2:00pm","RPG","R04","Pathfinder RPG \n– Pathfinder Society: The Sanos Abduction","Day: Saturday and Sunday\nStart Time: 2:00pm\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 3 to 7.\n\nThe Pathfinders are sent to the Sanos Forest in central Varisia to assist an agent researching the fey who inhabit the remote wood. But like many seemingly routine tasks in a Pathfinder's adventuring career, the simple support mission quickly turns into an adventure the PCs aren't soon to forget—presuming they survive.","6-Nov-12"],["Saturday",6,"2:00pm","RPG","R09","Savage Worlds \n– They Came From Beyond Space","By Jon Woodland\nDay: Saturday\nStart Time: 2:00pm\nNumber of participants: up to 5\n\nAs you watch the images on the big screen before you, you realize these Earthlings are more primitive than you thought, they actually fear the visitation of their planet by superior lifeforms such as yourselves! But you have no time now to ponder the strangeness you see about you on this unfamiliar world. You have a mission to complete, the success of which affects the life of each and every Earthling on the planet. Beset by obstacles at every turn, you must struggle against the very souls you are trying to help. If they only knew their salvation comes from Outer Space?","6-Nov-12"],["Saturday",6,"2:00pm","RPG","R10","Spycraft Third Edition – Crafty Games: Spycraft Third Beta Playtest!","By Alex Flagg of Crafty Games\nDay: Saturday\nTime: 2:00pm to 4:00pm and 4:00pm to 6:00pm\nNumber of participants: 2-6\n\nGet a sneak peek at the new edition of the World's Greatest Espionage RPG! This short session will let you try out preliminary rules and share your opinions with co-creator Alex Flagg!","29-Dec-12"],["Saturday",6,"4:00pm","RPG","R10"," Spycraft Third Edition – Crafty Games: Spycraft Third Beta Playtest!","By Alex Flagg of Crafty Games\nDay: Saturday\nTime: 2:00pm to 4:00pm and 4:00pm to 6:00pm\nNumber of participants: 2-6\n\nGet a sneak peek at the new edition of the World's Greatest Espionage RPG! This short session will let you try out preliminary rules and share your opinions with co-creator Alex Flagg!","29-Dec-12"],["Saturday",6,"2:00am","Special",19,"GottaCon 2013 Gamers Silent Auction","By GottaCon\nDay: Saturday\nTime: 9:00am to 6:30pm\nSubmission Deadline: 5:30pm\n\nOn Saturday February 2nd only between 9:00am and 6:30pm come out and take part in the GottaCon gamers silent auction brought to you by GottaCon Conventions. Convention goers are welcome to bring out their own items for sale as well as bid on the wide variety of items that will be available.\n\nFor full details go here: http:\/\/www.gottacon.com\/?page_id=215","30-Oct-12"],["Saturday",6,"2:00pm","Special",6,"Miniature Painting Contest","By GottaCon\nDay: Friday to Saturday\nTime: See schedule below\nPrice: Free\nPrizes: Trophies will be provided for 1st as well as awards for 2nd and 3rd Place in each category.\nRules can be found here: http:\/\/www.gottacon.com\/components\/tournaments\/paintingcompetitiongc2013.pdf\n\nCompetition Registration Schedule:\nFriday, February 1st, 5pm – 9pm  Saturday, February 2nd, 9am – 6pm\nCategories are open to any scale model from any genre or manufacturer. Maximum 1 entry per category, per contestant. All Entries must be in by Saturday 6pm! All figures entered can be picked-up by owners on Sunday, February 3rd  between 1pm – 5pm and no later than 5pm Sunday!","27-Oct-12"],["Saturday",6,"1:00pm","Special Event","Please\nVisit V08","Society for Creative \nAnachronism Demonstration","Time: 1:00pm to 2:00pm\nWeather Permitting","1-Jan-13"],["Saturday",6,"2:00pm","Special Event",18,"Lego - Blind Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will have an ongoing blind build competition while our booths are open. Drop in, attempt to make the model and put your score on the leaderboard. We will be bringing a set of blind build stands where the participant won't be able to see what they are building but everyone else will!","24-Dec-12"],["Saturday",6,"2:00pm","Special Event",18,"Lego - Kid Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will be hosting a kid ( and grown up kid ) build zone for the duration of Gottacon. You are welcome to come build at any time using the club's public brick buckets even if we are not manning our booth at the time. Parents are asked to monitor their children and everyone is welcome to leave your creations for the rest of the attendees to admire afterwards.","1-Jan-13"],["Saturday",6,"2:00pm","Special Event",18,"Lego - Speed Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will have an ongoing speed build competition while our booths are open. Drop in, attempt to make the model as fast as possible, and put your score on the leaderboard.","24-Dec-12"],["Saturday",6,"2:00pm","Special Event",18,"Lego - VicWars","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will be hosting their tabletop minifig game, VicWars, again this year with a few new rule additions for returning fans. Games will run for 2 hours and are drop in\/out, very easy to pickup. Appropriate for any age but parents need to attend their children. Check times posted on game table for any schedule changes.","1-Jan-13"],["Saturday",6,"2:00pm","TCG","Please\nVisit WOW\nTO Centre\nArea 6","DEMO - World of Warcraft - WoW Demo Event","By GottaCon and Skyhaven Games\nDay: Friday, Saturday, and Sunday\nTime: All daytime slots.\n\nCome learn to play the World of Warcraft Trading Card Game! Each demo will take only a short ten minutes, and we'll step you through the basics of the game! Then, if you like, you can enter our Beginner's Sealed Event, and play with a preconstructed starter. Play two rounds, get two free booster packs!","3-Nov-12"],["Saturday",6,"2:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering - Intro Deck Duels Event","By GottaCon, Wizards of the Coast and Yellowjacket.\nDay: All weekend\nStart Time: 7:00PM Friday Night, ending Sunday at 4:00PM\nPrice: Free with MTG weekend pass or $15 at the Yellowjacket tournament reporting centre.\nMaximum number of participants: 150\nPrizes: To Be Determined\n\nEach participant will receive a random Intro Duel Deck. Participants may face off against any other Intro Pack Convention League participants in one game at any time over the span of the weekend and report the results, who won and who lost, on their record sheet as well as to the Yellowjacket reporting centre. Players are paired against other players and may not play the same player two (2) times in a row. The winner of the match will be granted two random cards from a pool of cards. The winner then may view and select one of those cards to keep and add it to their intro deck if they so choose and return the other card to the pool or cards. The loser will receive one random card to keep and add to their deck should they choose to. Decks must be a minimum 40 cards. There is no limit to the number of individual opponents you can play.","28-Oct-12"],["Saturday",6,"2:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n- GottaCon MTG Open (2013) \nPart 2 Sealed","By GottaCon and Yellowjacket.\nDay: Saturday\nStart Time: 2:00pm\nPrice: This event is included if you purchase the Magic: the Gathering weekend pass. The cost to participate in the entire M:TG Open is $40 (only includes entry into one Standard flight). If you have purchased a full weekend pass to GottaCon 2013 you must upgrade your pass to a Magic: the Gathering weekend pass. If you wish to only take part in the standard event and not the overall M:TG Open, entry is $10 per flight and you can not qualify for the finals. If you wish to only take part in the sealed event and not the overall M:TG Open, entry is $30 and you can not qualify for the finals.\nMaximum number of participants: 150\nPrizes: Prizes will be awarded based on attendance.\n\nWelcome to the GottaCon MTG Open Tournament. This tournament consists of three formats (two qualifiers and one final) in which participants face off for hundreds of dollars in prizes. Qualifier finish order will be determined by the formats detailed below. In each format there is a prize pool to be won.\n\nIn Part two, each participant will be provided with six (6) boosters of Gatecrash to construct a deck consisting of no less than 40 cards. Participants are given 20 minutes to register the sealed pool and 30 minutes to construct their deck using the sealed pool they are given. The tournament will consist of swiss style rounds. Prizes will be awarded based on attendance.","28-Oct-12"],["Saturday",6,"2:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– Gunslinging ","By GottaCon and Yellowjacket Comics and Toys.\nStart time: All weekend at select times at the Yellowjacket tournament reporting centre\nPrice: Free\n\nFace off against professional level MTG players from BC. Win a game and you win a booster!","9-Dec-12"],["Saturday",6,"2:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– Pickup Draft","By Yellowjacket Comics and Toys.\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nPrice: $15\nPrizes: 5-3-2-2","9-Dec-12"],["Saturday",6,"5:00pm","TCG","Please\nVisit WOW\nTO Centre\nArea 6","World of Warcraft - WoW Season 8 Ashenvale Forest Realm Qualifier","By GottaCon, Skyhaven Games and Cryptozoic Entertainment\nDay: Saturday\nStart Time: Registration is at 5:00pm and the event starts at 6:00pm\nPrice: This event is free if you purchase the World of Warcraft TCG Pass. Otherwise the Price is $10 +HST.\nPrizes: See event description\nFormat: Core Constructed, Realm: Ashenvale Forest\n\nWelcome to the World of Warcraft TCG Season 8 Realm Qualifier. This tournament consists of a Core Constructed format with Swiss rounds in which participants face off for prizes and glory. After the Swiss rounds, the top players will play single elimination matches to determine the final winner of this event. Deck lists must be provided. Players earn qualification points towards a Realm Championship invite based on their standings. Players need 10 points to earn their invite to a Realm Championship: 1st: 10 points, 2nd: 10 points, 3rd-4th: 6 points, 5th-8th: 4 points, 9th+: 3 points\nTop Prize – Daedek the Graveborne Foil Card\nTop 4 – Reclaimed Ashkandi Foil Card\nTop 8 – Series 5 Paladin Deckboxes (+ 1 given out as door prizes)\nBooster Packs based on final standings\nParticipation Card – Pythiss, Herald of Frost (First 24 players)\n\nIf you have any questions regarding World of Warcraft TCG Events please contact: skyhavenvictoria@shaw.ca","28-Oct-12"],["Saturday",6,"3:30pm","WS\/P","Panel Room","DRM: The Pros and Cons","Day: Saturday\nTime: 3:30pm to 5:30pm\nPanelists: Karl Johanson, Alyx Dellaconica, Jules Sherred\n\nDRM is becoming a largely debated topic. With both sides of the debate weighing in on this topic, this panel will explore what exactly is DRM; the pros and the cons; why some companies cling on to it, while others have let it go; how it effects people's purchasing decisions; ask questions such as, “Does DRM only serve to harm the legitimate consumer?” and, “Are there any situations where DRM is not a bad thing?”, and more.","1-Jan-13"],["Saturday",7,"7:00 PM","BG","BG01","A Game Of Thrones (2nd Edition)","By Aldo Santolla\nDay: Saturday\n# of participants: 3 to 6 (multiple sessions)\n\nIn the second edition of A Game of Thrones: The Board Game, 3 to 6 players take on the roles of the great Houses of the Seven Kingdoms of Westeros, as they vie for control of the Iron Throne through the use of diplomacy and warfare. Will you take power through force, use honeyed words to coerce your way onto the throne, or rally thetownsfolk to your side? Through strategic planning, masterful diplomacy, and clever card play, spread your influence over Westeros!","11-Nov-12"],["Saturday",7,"7:00pm","BG",3,"Board Game Library (Sign out Games to Play) ","By GottaCon\nDay: Friday, Saturday, and Sunday\nTime: All Slots\n\nThis year GottaCon is pleased to continue to have a library of board games that our attendees are free to sign out and play. Sign out games from the Event Registration Desk by requesting a game from our available titles and leaving behind a piece of ID. GottaCon would like to thank Days of Wonder, Mayfair Games, Rio Grande, Fantasy Flight Games, and AEG for making additions this year.","18-Oct-12"],["Saturday",7,"7:00pm","BG","VCON 1","DEMO - VCON presents: \nKingdom Builder","By Colin Fraser of VCon\nDay: Saturday \nStart Time: 7:00pm\nNumber of participants: 2 to 4\n\nIn Kingdom Builder, the players create their own kingdoms by skillfully building their settlements, aiming to earn the most gold at the end of the game. \nNine different kinds of terrain are on the variable game board, including locations and castles. During his turn, a player plays his terrain card and builds three settlements on three hexes of this kind. If possible, a new settlement must be built next to one of that player’s existing settlements. When building next to a location, the player may seize an extra action tile that he may use from his next turn on. These extra actions allow extraordinary actions such as moving your settlements. By building next to a castle, the player will earn gold at the end of the game, but the most gold will be earned by meeting the conditions of the three Kingdom Builder cards; these three cards (from a total of ten in the game) specify the conditions that must be met in order to earn the much-desired gold, such as earning gold for your settlements built next to water hexes or having the majority of settlements in a sector of the board.","1-Jan-13"],["Saturday",7,"7:00pm","BG","VCON 2","DEMO - VCON presents: Carcassone","By Cam Brenner of VCon\nDay: Saturday \nStart Time: 7:00pm\nNumber of participants: 2 to 5\n\nCarcassonne is a tile-placement game in which the players draw and place a tile with a piece of southern French landscape on it. The tile might feature a city, a road, a cloister, grassland or some combination thereof, and it must be placed adjacent to tiles that have already been played, in such a way that cities are connected to cities, roads to roads, etcetera. Having placed a tile, the player can then decide to place one of his meeples on one of the areas on it: on the city as a knight, on the road as a robber, on a cloister as a monk, or on the grass as a farmer. When that area is complete, that meeple scores points for its owner. \n\nDuring a game of Carcassonne, players are faced with decisions like: \"Is it really worth putting my last meeple there?\" or \"Should I use this tile to expand my city, or should I place it near my opponent instead, giving him a hard time to complete his project and score points?\" Since players place only one tile and have the option to place one meeple on it, turns proceed quickly even if it is a game full of options and possibilities.","1-Jan-13"],["Saturday",7,"7:00pm","BG","BG03\nto\nBG10","Dominion Tournament","By Starlit Citadel\nSponsored by: Rio Grande Games\nDay: Saturday\nStart Time: Time: 7:00pm\nPrice: $5.00\nNumber of participants: Max of 32, Min of 8 players\n\nStarlit Citadel is hosting a Dominion tournament which is sponsored by Rio Grande Games. A minimum of 8 participants is required. Each participant will receive a set of the Walled Village promo and first overall will receive a prize from Rio Grande as well as a $25 gift certificate from Starlit Citadel, the second place prize will be a $20 certificate and third place prize a $10 certificate to Starlit Citadel. The format is three rounds of three games. Players will be divided into tables of 4 players in each round and the top player at each table moves on to the next round. Placement is determined first by combined finishing score of the three games then by points for tie breaks.","18-Oct-12"],["Saturday",7,"7:00pm","BG","M3\nGamers 1","M3 Gamers presents: Star Trek Deck Building","By M3 Gamers\nDay: Saturday \nStart Time: 7:00pm\nNumber of participants: 2 to 5\n\nTake on the role of Captain of a salvaged starship explore space. The game features three separate scenarios of play:\n• Explorations [Free For All]: Explore space to complete missions and ally with characters from the show.\n• Borg Invasion [Cooperative]: Band together with your fellow Captains to defend your world from the Borg.\n• Klingon Civil War [Teams]: Form alliances, gather support, and defeat your enemies to obtain control of the Klingon Empire.","24-Dec-12"],["Saturday",7,"7:00pm","BG","M3\nGamers 2","M3 Gamers presents: Team Blood Bowl ","By M3 Gamers\nDay: Saturday \nStart Time: 7:00pm\nNumber of participants: 2 \n\nFantasy Football with humans and orcs! Takes turns moving, blocking and advancing the football down the field. The game comes with plastic miniatures, buckets of blood are purely in your imagination.","24-Dec-12"],["Saturday",7,"7:00pm","BG","BG09\nBG11","The Core Gamers: Battlestar Galactica Tournament\n- Semi-Final Round 2","By Credence Holmes\nDay: Saturday\nStart Time: 7:00pm\nMaximum number of participants: 10\nFinal: Sunday 9:00am\n\n\nFlee the solar system as the humans or sabatoge as the secret Cylons in Battlestar Galactica (BSG)! We're running two games of 5 people each, the winner can particpate in the Sunday final for a great prize. Humans get points for: winning the game, resources still blue, number of jumps, number of vipers, raptors, civvies alive, and not being sent to the brig or sickbay during the game. Cylons get points for: winning the game, resources red, distance traveled, less distance=more points, number of vipers, raptors, civvies destroyed, revealing outside the brig, playing Super Crisis. Vote - biggest impact on game. If the Humans win, players can only vote human and vice-versa, vote most fun in game (roleplay, amazing dice throws, playing the ´blamegame´ well, etc)","17-Dec-12"],["Saturday",7,"7:00pm","BG","BG10\nBG12","VCON presents: VCON Special Event – GIANT Pandemic","By Rick Arino to VCon\nDay: Saturday  \nStart time: 7:00pm\nNumber of participants: 2 to 5\n\nA Pandemic has broken out and as a member of the Center for Disease Control; you will need to find a cure before it gets out of hand! Pandemic is a truly cooperative game where all players represent members of a team of experts that must find the cure to four virulent diseases before they wipe out the world's population. What’s different about this version? It’s HUGE. A 4 foot by 6 foot ","29-Dec-12"],["Saturday",7,"11:00pm","EG",12,"PC - Battlefield 3","By GottaCon and BC Gamer\nDay: Saturday\nTime: 11:00pm to 2:00am\nGenre: First Person Shooter\nOfficial Website: http:\/\/www.battlefield.com\/battlefield3\n\nA cornerstone of modern PC gaming, Battlefield 3 is sure to bring out your inner soldier. After some time on our large free-play server, players will team up into squads of 4 and show us what they’re made of.","5-Nov-12"],["Saturday",7,"6:00pm","EG",13,"Xbox 360 - Premium Halo 4 (2vs2)","By GottaCon and IRL Events\nSponsored by: Mad Catz\nDay: Saturday\nTime: 6:00pm\nTeam Size: 2 Players\nPrice: Requires video game add-on\nMaximum number of teams: 32\nPrizes: The first place team will receive a prize package from Mad Catz valued at over $500. The second place team will receive a prize package from Mad Catz valued at over $250. The third place team will receive a prize package from Mad Catz valued at over $150.\n\nFind a friend and get ready to face off against fierce competition. This tournament will be 2 player teams facing off in a double elimination tournament (teams will not be counted out until their second loss). If a player who wants to participate does not have a teammate they can partner up with random gamers who also don’t have a teammate. No personal profiles, No recoveries and or HD swaps will be allowed. MLG rule sets will be followed for this event and full rules and restrictions will be made available on the GottaCon website. Players may register at the GottaCon Event Registration up to 1 hour before the tournament starts, after which they must register with IRL Events in the console area. All players must-sign in at least 15 minutes before the start of the tournament.\n\nDue to the game rating of “M” for Mature anyone under the age of 17 is required to get parental permission to compete. Please find a parental consent form HERE: http:\/\/www.gottacon.com\/components\/tournaments\/egpermission2013.pdf","10-Dec-12"],["Saturday",7,"7:00pm","EG","12\/13","Logitech PC and \nMad Catz Console Freeplay","Day: Friday, Saturday, and Sunday\nTime: All Slots\n\nCome and play some games at the Logitech PC LAN on the free-play stations or Mad Catz Console LAN. **The Logitech PC LAN free-play stations may not be used to participate in Premium tournaments.","30-Dec-12"],["Saturday",7,"7:00pm","EG",12,"PC - Free-play Servers ","By BC Gamer\nDay: Friday, Saturday, Sunday\nTime: All slots\n\nBC Gamer will be hosting the following servers all weekend long for players to join at their leisure: Team Fortress 2, Chivalry: Medieval Warfare, Counter-Strike: Source, Counter-Strike: Global Offensive, Minecraft, KillingFloor, TeamSpeak 3. End of Reality is hosting Shootmania:Storm and Battlefield 3.","8-Dec-12"],["Saturday",7,"7:00pm","EG",12,"PC - Minecraft Building Contest","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All slots\nJudged: Sunday 1:00pm\nGenre: Indie - Sandbox\nOfficial Website: https:\/\/minecraft.net\/\n\nShow us your digital creativity. We will have a Minecraft server running all weekend where individual players and building teams will construct anything they can imagine. The creations will be judged on Sunday by our panel of expert architectural critics.","5-Nov-12"],["Saturday",7,"7:00pm","EG",12,"PC - Tricky Truck: Time Trials","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nFinals: Sunday 2:00pm\nGenre: Indie - Racing\nOfficial Website: http:\/\/www.gravitysensation.com\/trickytruck\/\n\nThe ridiculousness of this simple game is sure to bring a smile to any one's face. You must navigate difficult terrain and park a large truck as quickly as possible. Sound easy? We will have a station running all weekend for people to hone their skills. Final time trials will take place on Sunday.","5-Nov-12"],["Saturday",7,"7:00pm","EG",17,"Xbox 360 - Tekken Tag Tournament 2 Event","By Canadian Joystick and CrossXover\nDay: Saturday\nTime: Registration starts at 7:00pm with the event kicking off at 8:00pm\n\nWe will be using the following tournament format and rules: http:\/\/evo.shoryuken.com\/evo-player-guide\/evo-tournament-format\/. Teams will be placed in pods of four or eight and face off against opponents in their pod with similar win\/loss records in a double elimination qualification round. Top two teams from each pod move on to the semi finals. Finals will feature the top four or eight from the semis. Bring your own fighting stick or use the ones provided by our Console LAN sponsors Mad Catz!","11-Dec-12"],["Saturday",7,"8:00pm","EG",12,"PC - ShootMania: Storm Deathmatch","By GottaCon and BC Gamer\nSponsors: Shootmania: Storm and Astro Gaming\nDay: Saturday\nTime: 8:00pm to 11:00am\nPrizes: ShootMania: Storm™ deathmatch event sponsored by Shootmania and Astro Gaming with over $1000 in prizes to be won along with copies of the game and swag!\n\nThe creators of ManiaPlanet have a new arena-based competitive shooter to allow the quick-fingered to prove their skills. There will be several warm-up rounds for newcomers to prepare for the final struggle, but afterward it’s every man for himself in a huge elimination-based death match.","08\/24\/2012"],["Saturday",7,"8:00pm","EG",13,"Wii – Tetris Party","By GottaCon and IRL Events\nDay: Saturday\nTime: 8:00pm\nMaximum number of participants: 32\n\nThis tournament will be double elimination – 1 vs 1 with no time limit. Players compete until one is eliminated, matches will be seeded randomly. Each round consists of a single match.","11-Dec-12"],["Saturday",7,"7:00pm","Minis","M02"," Warhammer Fantasy Storm of Magic Prize Battle","By GottaCon\nSponsored by: Imperial Hobbies\nDay: Saturday\nTime: 7:00pm\nPrice: Free\nMaximum number of participants: 6\n1000pt Armies, No paint restrictions\n\nEach Player will have a 1600 point Army created using the Storm of Magic Rules. At the end of the Game, Prizes will be awarded For Control of Arcane Fulcrums, with a special prize for the winner; whichever player controls the most Arcane Fulcrumns.. Priority seating is granted to miniature package holders that have pre-regged for this event, followed by mini package holders then walk-ins.","17-Oct-12"],["Saturday",7,"7:00pm","Minis","M03","DEMO - A Call to Arms:Star Fleet ","By Jon Woodland\nDay: Friday and Saturday\nStart Time: 7:00pm\nMaximum number of participants: 6\n\nCome and learn to play this awesome starship miniatures game set in the Star Fleet Universe! Based on the 30 years of \"Star Fleet Battles\" by Amarillo Design Bureau, A Call to Arms: Star Fleet brings fleet level action to the tabletop. Take on the forces of the Federation, Romulans, Klingons, or Kzinti with easy to learn rules and beautiful 1:3125 scale miniatures by Mongoose Publishing. http:\/\/www.mongoosepublishing.com\/us\/miniatures\/ctastarfleet.html\n\nEverything you need to play is provided. Just bring your imagination and tactical.","3-Nov-12"],["Saturday",7,"7:00pm","Minis","M03","DEMO - Malifaux Demo Games","Day: Friday, Saturday, Sunday\nTime: All daytime slots\nMaximum number of participants: As Seating Allows\n\nTrigger-happy gunslingers, misguided Victorian science, hungry undead, and monsters hidden in every shadow; these are the terrors that will plague you in Malifaux. Are you willing to risk your soul for a chance at great wealth and power? Because it's the only thing you have worth trading. In Malifaux, you lead your crew in the battle for control of The Breach, a dark portal to a world of limitless magic. A Demonstrator will be on hand to provide introductory games to those wishing to learn this game. No Experience Necessary. Miniatures will be provided.","30-Oct-12"],["Saturday",7,"7:00pm","Minis","M03","DEMO - Warmachine\/Hordes Demo Games ","Day: Friday, Saturday, Sunday\nTime: All daytime slots\nMaximum number of participants: As Seating Allows\n\nIn the Game WARMACHINE players take on the role of warcasters as they lead their titanic forces into battle. Warcasters possess significant martial prowess of their own as well as having hardened warriors and magical spells to bring to bear. No Experience Necessary. Miniatures provided.","30-Oct-12"],["Saturday",7,"7:00pm","Minis","M03","Malifaux - A Wyrd Encounter, Beginners Tournament","By: GottaCon\nSponsored by: Wyrd Miniatures\nDay: Saturday\nTime: 7:00pm\nPrice: Free (signups for this event can be done in advance on our Warhorn site or once you arrive at the convention)\nMaximum number of participants: 32\nRules Packet: http:\/\/www.gottacon.com\/components\/tournaments\/awyrdencountergottacon2013web.pdf\n\nGottaCon and Wyrd Miniatures are proud to present an exciting Lineup of Malifaux Tournaments throughout the weekend. Prizes will be awarded individually in each Tournament, and the Player with the most combined Tournament Points for the weekend will earn the title of GottaCon 2013 Malifaux Champion! Purchase of a GottaCon Malifaux ticket package secures a place in each Malifaux Tournament and is required for pre-registration and entry in the “First into the Breach”, “One Way Ticket”, and “Masters of Malifaux” Events, as well space is limited to 16 players for the three mentioned events.","28-Oct-12"],["Saturday",7,"7:00pm","Minis","M05","Savage Showdown - Star Wars: Prisoner Rescue","By: Bayden Woodland\nDay: Saturday\nStart Time: 7:00pm\nNumber of participants: 1 to 4\n\nEvent Description: Savage Showdown is the miniatures battle version of the pulpy Savage Worlds RPG system. Upon the rolling plains of one of countless struggling worlds, the forces of the Galactic Empire lead a convoy full of valuable rebel prisoners.The rebels have prepared an elite strike force to intervene, but will they be able to get the prisoners out alive? Newcomers welcome!","10-Dec-12"],["Saturday",7,"7:00pm","Minis","M03","Warmachine\/Hordes Iron Arena ","By GottaCon\nSponsored by: Wiser's Collectibles \nDay: Friday, Saturday, and Sunday\nTime: All Slots\n\nAll weekend, day or night, Warmachine and Hordes players at GottaCon 2013 will be able to participate in the Iron Arena! Bring an army and play against an \nOpponent in this open-play format. You decide upon the points value for the games. Collect points and redeem them to pick up some great prizes!!","17-Oct-12"],["Saturday",7,"7:00pm\n(slot 2)","Minis","M01","GottaCon Blood Bowl Tournament – Round 2","By GottaCon.\nSponsored by: Imperial Hobbies\nDay: Friday and Saturday\nTime: 7:00pm\nPrice: Free\nMaximum number of participants: 8\nPrizes:Prizes will be awarded for The Tournament Champion, Sportsmanship, and Best Painted Team.\n\nRules can be found here: http:\/\/www.games-workshop.com\/MEDIA_CustomProductCatalog\/m750496a_BB_Competition_Rules_Pack.pdf\n\nAttention Blood Bowl Fans! GottaCon Conventions is proud to announce the GottaCon 2013 Blood Bowl Cup. It will be a 4 round, Double Elimination Tournament, with the first 2 rounds played Friday evening and the final 2 rounds played on Saturday evening . Players will start with a Million Gold Piece team. The Tournament will be run as a League so there will be advancement between each round.","27-Oct-12"],["Saturday",7,"7:00pm","RPG","R09","Dresden Files RPG \n– Introduction to the Dresden Files","By Jason Tice\nDay: Friday and Saturday\nStart Time: 7:00pm\nMaximum number of participants: 6\n\nThe Dresden Files is an Urban Supernatural Fantasy setting based on Jim Butcher’s book (and television) series of the same name.  This session will introduce you to the basics of the Dresden Files, and the FATE system of game-play.  Characters are pre-generated but customized at time-of-play.","13-Nov-12"],["Saturday",7,"7:00pm","RPG","R07","Elemental Axes: Second Edition\n– Crosstime Games: Shipwrecked on the Skull Coast","By Eric Seaton of Crosstime Games\nDay: Saturday\nStart Time: 7:00pm\nNumber of participants: 2 to 5\n\nNo sane captain sails near the Skull Coast, but the great storms of the Sea of Fury are legendary. Your ship, overcome by waves as large as hills, has been swept, broken-masted and crushed, onto the rocky beaches of the Dragonlands. Some of the crew have chosen to throw themselves to the sea's watery depths rather than face the undying curse of this ancient, abandoned land, but as yet, you are alive...","29-Dec-12"],["Saturday",7,"7:00pm","RPG","R08","Homebrew Star Wars Universe \n– Froth Barrel: Too Much to Divide","By Dylan Kaye “The Gaffmonger” Sharpe of The Froth Barrel Sodality\nDay: Saturday\nStart Time: 7:00pm\nNumber of participants: 1 to 5\n\nYour bright, distinguished mates and you have procured a rather large shipment of Nyriaan spice. Problem is that only four blokes in your crew will serve any purpose on the next phase of this entrepreneurial adventure. Hence, you brought the whole lot back to the Moss Eislely Cantina. Before this night is done, your twelve villain crew needs to streamline into a quintet. Axe the dead weight, do it without creating problems, and then haul this spice to a broker before Jabba the Hutt invites you to visit.   Warning: mature gaming content.","13-Nov-12"],["Saturday",7,"7:00pm","RPG","R06","Judge Dredd RPG (Mongoose Traveller System)\n– A Hard Daystick's Night","By Steve Saunders\nDay: Saturday\nStart Time: 7:00pm\nNumber of participants: up to 7\n\nSector 160. Straddling the Black Atlantic and the Southern Rad Zone, the “Sour Sixteen-Nothin” is known to be a hive of scum, villainy, and some seriously drokking badass perps. Sector 160 is not the place one wants to be a Judge-- but there you are. This is supposed to be just another few hours on this short-leg tour, and you and your squad will be cycled back to the relatively safe streets of the East Meg. Until then, you need to keep your eyes peeled and your Lawgivers primed.\n\nCentral just called. Looks like there's some strange activity on the Black Wall...   Good luck.","29-Dec-12"],["Saturday",7,"7:00pm","RPG","R11","Mistborn Adventure Game\n– Crafty Games: Dance of Deceit","By Ryan Downing\nDay: Saturday and Sunday\nStart Time: 7:00pm(Saturday) and 2:00pm(Sunday)\nMaximum number of participants: 6\n\nIn the world of Mistborn, wars are waged in the halls of noble estates as they are the fields of battle. Assigned the unenviable task of keeping the peace at the Ackroyal ball, you soon find yourselves embroiled in a war of intrigue, deception, and conspiracy that tugs on the very foundations of society. Tread carefully, for in the Final Empire, the ballroom can be the most dangerous battlefield of all! Come learn how to play the Mistborn Adventure Game, set in the world of Brandon Sanderson’s best-selling Mistborn novels, in this demo.","29-Dec-12"],["Saturday",7,"7:00pm","RPG","R03","Pathfinder RPG  \n– Pathfinder Society: The Blackros Matrimony","By Todd Conrod\nDay: Friday and Saturday\nStart Time: 7:00pm\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 3 to 7.\n\nThe eldest daughter of the prominent Blakros family is set to wed an influential Hellknight, and the Pathfinder Society is invited to the festivities. Dressed for a wedding befitting royalty, a team of Pathfinders attend the ceremony on behalf of the Decemvirate, but will their presence ultimately strengthen the Society's relationship with the influential Blakroses, or will events at the wedding bring the already tenuous alliance to a breaking point?","6-Nov-12"],["Saturday",7,"7:00pm","RPG","R01","Pathfinder RPG \n– Pathfinder Society: Rise of the Goblin Guild","Day: Friday, Saturday, and Sunday\nStart Time: 7:00pm(Friday and Saturday), 2:00pm(Saturday), and 9:00am(Sunday)\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 1 to 5.\n\nWhen a monster is discovered on the grounds of the Pathfinder Lodge at Heidmarch Manor in Magnimar, an investigation into its appearance leads the PCs deep under the City of Monuments—and face to face with a burgeoning thieves’ guild.","6-Nov-12"],["Saturday",7,"7:00pm","RPG","R02","Pathfinder RPG \n– Pathfinder Society: The Disappeared","By Mike Dowd\nDay: Saturday and Sunday\nStart Time: 9:00am(Saturday), 2:00pm(Saturday and Sunday), and 7:00pm(Saturday)\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 1 to 5.\n\nA powerful ally of the Pathfinder Society has disappeared, and no one but the Pathfinders even remembers that she ever existed. Can the PCs discover the fate of their missing associate, or will all memory of her be erased completely from history?","6-Nov-12"],["Saturday",7,"7:00pm","RPG","R04","Pathfinder RPG \n– Pathfinder Society: The Refuge of Time","By Jonathan Ross\nDay: Saturday\nStart Time: 7:00pm\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 7 to 11.\n\nIn the ruins of a fallen empire built on the power of sin lies the key to awakening a great evil from a time long gone. The Pathfinder Society isn't the only organization seeking this potent artifact, however, and the result of failure could mean disaster for the whole of Varisia and beyond.","6-Nov-12"],["Saturday",7,"7:00pm","RPG","R05","Star Wars: Edge of the Empire\n– Escape from Mos Shuuta","By Riley “Jerreth” Vandall\nDay: Saturday\nStart Time: 7:00pm\nNumber of participants: 2 to 6\n\nOn the harsh Outer Rim world of Tatooine, a band of misfit fringers chafe under the yoke of a Hutt crimelord and soon learn they need to get off planet right away, preferably with their lives!\n\nBlast off to adventure in the latest iteration of Star Wars Roleplaying: Edge of the Empire! This scenario comes from the Beginner Game boxed set and is geared to teaching the mechanics and unique narrative dice system to both novice and veteran players who are interested in this new fast-paced, cinematic system!","29-Dec-12"],["Saturday",7,"7:00pm","RPG","R10","Supernatural RPG \n– The Beast of Bray Road","By Wendy Maiuro\nDay: Saturday\nStart Time: 7:00pm\nNumber of participants: 3 to 5\n\nAs Hunters in the Supernatural RPG, you are drawn to the semi rural town of Elkhorn, Manitoba.  Why? A hunt.  Reported sightings of a creature described as - \"part wolf and part man\" -  have led you and your team to believe the recent attacks, and one fatality, are the work of this creature.  There's even a local legend known as the \"Beast of Bray Road\".  The creature cannot be allowed to live, it's tasted human blood. It has to be stopped.  It's Huntin' Time!","13-Nov-12"],["Saturday",7,"7:00pm","Special Event",18,"Lego - Blind Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will have an ongoing blind build competition while our booths are open. Drop in, attempt to make the model and put your score on the leaderboard. We will be bringing a set of blind build stands where the participant won't be able to see what they are building but everyone else will!","24-Dec-12"],["Saturday",7,"7:00pm","Special Event",18,"Lego - Kid Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will be hosting a kid ( and grown up kid ) build zone for the duration of Gottacon. You are welcome to come build at any time using the club's public brick buckets even if we are not manning our booth at the time. Parents are asked to monitor their children and everyone is welcome to leave your creations for the rest of the attendees to admire afterwards.","1-Jan-13"],["Saturday",7,"7:00pm","Special Event",18,"Lego - Speed Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will have an ongoing speed build competition while our booths are open. Drop in, attempt to make the model as fast as possible, and put your score on the leaderboard.","24-Dec-12"],["Saturday",7,"7:00pm","Special Event",18,"Lego - VicWars","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will be hosting their tabletop minifig game, VicWars, again this year with a few new rule additions for returning fans. Games will run for 2 hours and are drop in\/out, very easy to pickup. Appropriate for any age but parents need to attend their children. Check times posted on game table for any schedule changes.","1-Jan-13"],["Saturday",7,"5:00pm\n(slot 6)","TCG","Please\nVisit WOW\nTO Centre\nArea 6","World of Warcraft - WoW Season 8 Ashenvale Forest Realm Qualifier","By GottaCon, Skyhaven Games and Cryptozoic Entertainment\nDay: Saturday\nStart Time: Registration is at 5pm and the event starts at 6pm\nPrice: This event is free if you purchase the World of Warcraft TCG Pass. Otherwise the Price is $10 +HST.\nPrizes: See event description\nFormat: Core Constructed, Realm: Ashenvale Forest\n\nWelcome to the World of Warcraft TCG Season 8 Realm Qualifier. This tournament consists of a Core Constructed format with Swiss rounds in which participants face off for prizes and glory. After the Swiss rounds, the top players will play single elimination matches to determine the final winner of this event. Deck lists must be provided. Players earn qualification points towards a Realm Championship invite based on their standings. Players need 10 points to earn their invite to a Realm Championship: 1st: 10 points, 2nd: 10 points, 3rd-4th: 6 points, 5th-8th: 4 points, 9th+: 3 points\nTop Prize – Daedek the Graveborne Foil Card\nTop 4 – Reclaimed Ashkandi Foil Card\nTop 8 – Series 5 Paladin Deckboxes (+ 1 given out as door prizes)\nBooster Packs based on final standings\nParticipation Card – Pythiss, Herald of Frost (First 24 players)\n\nIf you have any questions regarding World of Warcraft TCG Events please contact: skyhavenvictoria@shaw.ca","28-Oct-12"],["Saturday",7,"7:00pm","TCG","Please\nVisit WOW\nTO Centre\nArea 6","DEMO - World of Warcraft - WoW Demo Event","By GottaCon and Skyhaven Games\nDay: Friday, Saturday, and Sunday\nTime: All daytime slots.\n\nCome learn to play the World of Warcraft Trading Card Game! Each demo will take only a short ten minutes, and we'll step you through the basics of the game! Then, if you like, you can enter our Beginner's Sealed Event, and play with a preconstructed starter. Play two rounds, get two free booster packs!","3-Nov-12"],["Saturday",7,"7:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering - Intro Deck Duels Event","By GottaCon, Wizards of the Coast and Yellowjacket.\nDay: All weekend\nStart Time: 7:00PM Friday Night, ending Sunday at 4:00PM\nPrice: Free with MTG weekend pass or $15 at the Yellowjacket tournament reporting centre.\nMaximum number of participants: 150\nPrizes: To Be Determined\n\nEach participant will receive a random Intro Duel Deck. Participants may face off against any other Intro Pack Convention League participants in one game at any time over the span of the weekend and report the results, who won and who lost, on their record sheet as well as to the Yellowjacket reporting centre. Players are paired against other players and may not play the same player two (2) times in a row. The winner of the match will be granted two random cards from a pool of cards. The winner then may view and select one of those cards to keep and add it to their intro deck if they so choose and return the other card to the pool or cards. The loser will receive one random card to keep and add to their deck should they choose to. Decks must be a minimum 40 cards. There is no limit to the number of individual opponents you can play.","28-Oct-12"],["Saturday",7,"7:00pm","TCG",null,"Magic: The Gathering \n– GottaCon Legacy Tournament","By GottaCon and Yellowjacket.\nDay: Saturday\nStart Time: 7:00pm\nPrice: $10\nPrizes: Based on attendance\n\nEach participant must bring their own minimum 60 card deck built using the current Legacy rules and restrictions.","2-Jan-13"],["Saturday",7,"7:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– Gunslinging ","By GottaCon and Yellowjacket Comics and Toys.\nStart time: All weekend at select times at the Yellowjacket tournament reporting centre\nPrice: Free\n\nFace off against professional level MTG players from BC. Win a game and you win a booster!","9-Dec-12"],["Saturday",7,"7:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– Pickup Draft","By Yellowjacket Comics and Toys.\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nPrice: $15\nPrizes: 5-3-2-2","9-Dec-12"],["Saturday",7,"9:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering – GottaCon Two Headed Giant Sealed Tournament","By GottaCon and Yellowjacket.\nDay: Saturday\nStart Time: 9:00pm\nPrice: $40 per team\nPrizes: 3 boosters per team entered into pool.\n\nTeams will receive eight boosters of Gatecrash to construct two decks in this sanctioned Gatecrash tournament. Teams will be given 45 minutes to construct their decks. Teams will face off in a swiss style tournament.","24-Dec-12"],["Saturday",7,"6:30pm","WS\/P","Panel Room","Standard Action: Exclusive Showing and Q&A","Day: Saturday\nTime: 6:30pm to 8:30pm\nPanelists: Joanna Gaskell, Rob Hunt, and three other members of the Standard Action cast and crew.\n\nJoin the Standard Action crew and be the first to view one of the episodes of Season 2 of this award winning web series. After you become the first to view this exclusive screening, the cast and crew of Standard Action will take your questions.","1-Jan-13"],["Sunday",8,"12:00am","BG",3,"Board Game Library (Sign out Games to Play) ","By GottaCon\nDay: Friday, Saturday, and Sunday\nTime: All Slots\n\nThis year GottaCon is pleased to continue to have a library of board games that our attendees are free to sign out and play. Sign out games from the Event Registration Desk by requesting a game from our available titles and leaving behind a piece of ID. GottaCon would like to thank Days of Wonder, Mayfair Games, Rio Grande, Fantasy Flight Games, and AEG for making additions this year.","18-Oct-12"],["Sunday",8,"12:00am","BG","BG04","Level 7 [Escape]","By Nathan Bosa\nDay: Saturday and Sunday\nStart Time: 12:00am, with multiple sessions\nNumber of participants: 1 to 4 \n\nYou are a captive of Subterra Bravo, imprisoned in the facility’s deepest laboratory, the hall of nightmares known as LEVEL 7. Your singular goal is to escape.  Will you work together with your fellow prisoners to endure Subterra Bravo’s endless perils, or will you use them to secure your own escape? Ultimately, your chances of survival will depend on how well you manage your greatest weapon, which is also your greatest threat: fear itself. LEVEL 7 [ESCAPE] is a semi-cooperative, story-driven survival-horror board game for 1–4 players Published by Privateer Press. No Experience Necessary.","6-Nov-12"],["Sunday",8,"12:00am","BG","M3\nGamers 1","M3 Gamers presents: Talisman","By M3 Gamers\nDay: Sunday\nStart Time: 12:00am\nNumber of participants: 2 to 6\n\nA cult classic fantasy board game with a fantasy theme. Control one of 14 characters to find and claim the Crown of Command, a magical artifact with the power to make the bearer the true ruler of the kingdom. ","9-Dec-12"],["Sunday",8,"12:00am","BG","BG07\nBG08","The Core Gamers: Game of Thrones Tournament\n- Final","By Credence Holmes\nDay: Saturday\nStart Time: 12:00am\nMaximum number of participants: 8\n\nThe winners of Friday's Game of Thrones Tournament continue on, competing for a great prize. Played on the first edition base game. The winner will be decided by a point system based on number of wins and votes cast by other players and the referee. Vote – biggest impact on game. (Most decisive move, best war, etc.) Vote – most fun in game. (Roleplay, amazing dice throwes, etc.) All players must be prepared for a full 4 hour game.","24-Dec-12"],["Sunday",8,"12:00am","EG","12\/13","Logitech PC and \nMad Catz Console Freeplay","Day: Friday, Saturday, and Sunday\nTime: All Slots\n\nCome and play some games at the Logitech PC LAN on the free-play stations or Mad Catz Console LAN. **The Logitech PC LAN free-play stations may not be used to participate in Premium tournaments.","30-Dec-12"],["Sunday",8,"12:00am","EG",12,"PC - Free-play Servers ","By BC Gamer\nDay: Friday, Saturday, Sunday\nTime: All slots\n\nBC Gamer will be hosting the following servers all weekend long for players to join at their leisure: Team Fortress 2, Chivalry: Medieval Warfare, Counter-Strike: Source, Counter-Strike: Global Offensive, Minecraft, KillingFloor, TeamSpeak 3. End of Reality is hosting Shootmania:Storm and Battlefield 3.","8-Dec-12"],["Sunday",8,"12:00am","EG",12,"PC - Minecraft Building Contest","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All slots\nJudged: Sunday 1:00pm\nGenre: Indie - Sandbox\nOfficial Website: https:\/\/minecraft.net\/\n\nShow us your digital creativity. We will have a Minecraft server running all weekend where individual players and building teams will construct anything they can imagine. The creations will be judged on Sunday by our panel of expert architectural critics.","5-Nov-12"],["Sunday",8,"12:00am","EG",12,"PC - Tricky Truck: Time Trials","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nFinals: Sunday 2:00pm\nGenre: Indie - Racing\nOfficial Website: http:\/\/www.gravitysensation.com\/trickytruck\/\n\nThe ridiculousness of this simple game is sure to bring a smile to any one's face. You must navigate difficult terrain and park a large truck as quickly as possible. Sound easy? We will have a station running all weekend for people to hone their skills. Final time trials will take place on Sunday.","5-Nov-12"],["Sunday",8,"12:00am","RPG","R08","Conspiracy X \n– Froth Barrel: Outside Interference","By Pat “Lord Blackthorne” Klassen of The Froth Barrel Sodality\nDay: Sunday\nStart Time: 12:00am\nNumber of participants: 2 to 6\n\nMarch 14th 2012, 3:27am an alien transmission is detected directed at Washington D.C. Unknown origin.\nMarch 14th 2012, 4:01am a 2nd alien transmission is detected directed as Washington D.C. Unknown origin\n\nYou receive a call from your contact at the O.S.I. Known only as Hunter.  There is a situation and you are being tapped to get to the bottom of this mystery and preserve the citizens’ perception of safety and normalcy. You have three hours before you are to rendezvous with your team for this mission.  Hunter says this mission is of potentially the utmost importance and danger, good luck Soldier.","13-Nov-12"],["Sunday",8,"12:00am","RPG","R04","nWo  – In the City","By Ric Jesson of Rabbit Hole Games\nDay: Saturday and Sunday\nStart Time: 9:00am(Saturday) , 12:00am(Sunday) and 4:00am(Sunday)\nMaximum number of participants: 7\n\nnWo is a role playing game based on a grim vision of our future.  This is a game of secrets, corporate control, and metaphysical powers.  Come join us for an adventure you won't soon forget.  Room for seven players, one d10 required.","13-Nov-12"],["Sunday",8,"12:00am","RPG","R11","Paranoia - PARANOIA: The Roleplaying Game of a Darkly Humorous Future (Paranoia)","By Jaime Tiampo\nDay: Sunday\nStart Time: 12:00am\nMaximum number of participants: 4\n\nIn service to a well-meaning but deranged Computer, you and your fellow players seek to eliminate traitors. You will have lots of fun rooting out Communist mutant traitors. The Computer says so. Your deepest fear: Your fellow players will discover YOU are one of those traitors.","30-Dec-12"],["Sunday",8,"12:00am","RPG","R05 and \nR06","Werewolf, the social game of intrigue, murder, suspicion, and betrayal","By Knoll Stevenson.\nDay: Sunday\nTime 12:00am to 3:00am\nNumber of participants: 5 to 30\n\nJoin me for an opportunity to play the classic Werewolf game, when the werewolves murder by night, but are hunted by day. Each player is randomly assigned a role, that of villager or werewolf. There are also special roles that will be introduced as the game progresses. Each night, the werewolves secretly select a villager to murder. If all the villagers die, the werewolves win the game. Each day, the villagers have an opportunity to gang up on the werewolves and hang one. Getting a majority of people to support the hanging will allow the villagers to kill one player, hopefully it's a werewolf, but nothing is certain until they are dead. As time passes, numbers dwindle, and if the werewolves aren't killed, then they will murder the entire village, and move on to the next one.","24-Dec-12"],["Sunday",8,"12:00am","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering - Intro Deck Duels Event","By GottaCon, Wizards of the Coast and Yellowjacket.\nDay: All weekend\nStart Time: 7:00PM Friday Night, ending Sunday at 4:00PM\nPrice: Free with MTG weekend pass or $15 at the Yellowjacket tournament reporting centre.\nMaximum number of participants: 150\nPrizes: To Be Determined\n\nEach participant will receive a random Intro Duel Deck. Participants may face off against any other Intro Pack Convention League participants in one game at any time over the span of the weekend and report the results, who won and who lost, on their record sheet as well as to the Yellowjacket reporting centre. Players are paired against other players and may not play the same player two (2) times in a row. The winner of the match will be granted two random cards from a pool of cards. The winner then may view and select one of those cards to keep and add it to their intro deck if they so choose and return the other card to the pool or cards. The loser will receive one random card to keep and add to their deck should they choose to. Decks must be a minimum 40 cards. There is no limit to the number of individual opponents you can play.","28-Oct-12"],["Sunday",8,"12:00am","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– Pickup Draft","By Yellowjacket Comics and Toys.\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nPrice: $15\nPrizes: 5-3-2-2","9-Dec-12"],["Sunday",9,"4:00am","RPG","R04","nWo  – In the City","By Ric Jesson of Rabbit Hole Games\nDay: Saturday and Sunday\nStart Time: 9:00am(Saturday) , 12:00am(Sunday) and 4:00am(Sunday)\nMaximum number of participants: 7\n\nnWo is a role playing game based on a grim vision of our future.  This is a game of secrets, corporate control, and metaphysical powers.  Come join us for an adventure you won't soon forget.  Room for seven players, one d10 required.","13-Nov-12"],["Sunday",10,"9:00am","BG",3,"Board Game Library (Sign out Games to Play) ","By GottaCon\nDay: Friday, Saturday, and Sunday\nTime: All Slots\n\nThis year GottaCon is pleased to continue to have a library of board games that our attendees are free to sign out and play. Sign out games from the Event Registration Desk by requesting a game from our available titles and leaving behind a piece of ID. GottaCon would like to thank Days of Wonder, Mayfair Games, Rio Grande, Fantasy Flight Games, and AEG for making additions this year.","18-Oct-12"],["Sunday",10,"9:00am","BG","BG10","DEMO - Agricola","By Derek Turner\nDay: Sunday\nStart Time: 9:00am\nNumber of participants: 2 to 5  (multiple sessions)\n\nIn Agricola, you're a farmer in a wooden shack with your spouse and little else. On a turn, you get to take only two actions, one for you and one for your spouse. Will you collect clay, wood, or stone; or build fences; and other improvements? Choose your course wisely, the player with the best farm wins!","4-Jan-13"],["Sunday",10,"9:00am","BG","BG09","DEMO - Star Munchkin","By Duncan Hauser\nDay: Sunday\nStart Time: 9:00am\nNumber of participants: 2 to 6  (multiple sessions)\n\nKill the monsters - Steal the treasure - Stab your buddy, IN SPACE. Laugh at every trope that sci-fi can throw at you. Come fight the Brain in a Jar, Fanged Fuzzballs, Clown Troopers, and most dangerous of all, your fellow Munchkins!\n","4-Jan-13"],["Sunday",10,"9:00am","BG","BG12","DEMO - Ticket to Ride","By Mel Guille\nDay: Sunday\nStart Time: 9:00am\nNumber of participants: 2 to 5 (multiple sessions)\n\nWith elegantly simple gameplay, Ticket to Ride can be learned in 3 minutes, while providing players with intense strategic and tactical decisions every turn. Players collect cards of various types of train cars they then use to claim railway routes in North America. The longer the routes, the more points they earn. Additional points come to those who fulfill Destination Tickets – goal cards that connect distant cities; and to the player who builds the longest continuous route.","4-Jan-13"],["Sunday",10,"9:00am","BG","VCON 1\nVCON 2","DEMO - VCON presents:\n Dominion","By Rick Arino & Cam Brenner and VCon\nDay: Sunday \nStart Time: 9:00am\nNumber of participants: 2 to 6 (multiple sessions as time permits)\n \nDominion is the card game of choice for emperors and bandits alike. The simple goal of building the best kingdom becomes trickier as you have to choose what you spend your resources on. No two games play the same! ","29-Dec-12"],["Sunday",10,"9:00am","BG","M3\nGamers 1","M3 Gamers presents: \nNuns on the Run","By M3 Gamers\nDay: Sunday\nStart Time: 9:00am\nNumber of participants: 2 to 8\n\nhe novices are on the loose! Temptation has lured them out of their cells, and they hope not to be caught by the abbess and the prioress. But the guards are swift and their hearing is excellent, so it will take craftiness and a bit of luck in order to make it back to their beds without being caught! ","9-Dec-12"],["Sunday",10,"9:00am","BG","M3\nGamers 2","M3 Gamers presents: \nRed Dragon Inn","By M3 Gamers\nDay: Sunday\nStart Time: 9:00am\nNumber of participants: 2 to 4\n\nYou've raided the dungeon, killed the monsters, and taken their treasure. Now, it’s time to party! The last person sober enough to remain conscious and shrewd enough to hold onto their gold wins.","9-Dec-12"],["Sunday",10,"9:00am","BG","BG01","The Core Gamers: Battlestar Galactica Tournament\n- Final","By Credence Holmes\nDay: Sunday \nStart Time: 9:00am\nMaximum number of participants: 10\n\nThis is a Battlestar Galactica (BSG) game. The winner is decided by a point system. Humans get points for: winning the game, resources still blue, number of jumps, number of vipers, raptors, civvies alive, and not being sent to the brig or sickbay during the game. Cylons get points for: winning the game, resources red, distance traveled, less distance=more points, number of vipers, raptors, civvies destroyed, revealing outside the brig, playing Super Crisis. Vote - biggest impact on game. If the Humans win, players can only vote human and vice-versa. Vote - most fun in game (roleplay, amazing dice throwes, playing the ´blamegame´ well, etc)","17-Dec-12"],["Sunday",10,"9:30am","BG","BG02\nto\nBG08","The Great Canadian Board Game Blitz Qualifier","By GottaCon\nDay: Sunday\nStart Time: Registration at 9:30am games start at 10:00am\nPrice: Free\nMaximum number of participants: 28\nPrizes: Our sponsors have provided some prizes and GottaCon has gathered up some additional prizes as well. Each round a random prize will be awarded and there will be prizes for top finishing ranks based on attendance.\n\nFor complete details on this event please go here:  http:\/\/www.gottacon.com\/?page_id=1313#blitz\nor please speak with the event registration desk or the organizers of the event.","18-Oct-12"],["Sunday",10,"10:00am","EG",13,"PS3 – Super Rub-a-Dub Event","By GottaCon and IRL Events.\nDay: Sunday\nTime: 10:00am to 4:00pm\nMaximum number of participants: Unlimited\nTournament Style: Time Trial\n\nThe tournament will consist of 3 stages, to be kept secret until the start of the tournament. Each contestant will play through each of the 3 stages, all times will be combined for their final time count. The contestant with the shortest final time count wins. Players may re-play levels for better times if the station is available, with priority going to new contestants. Winner to be announced at 4:00pm on Sunday.","1-Jan-13"],["Sunday",10,"10:00am","EG",13,"Xbox 360 - Premium Call of Duty Modern Warfare Black Ops 2 \nFree for All Tournament","By GottaCon and IRL Events\nSponsored by: Astro Gaming and GUNNAR Optiks\nDay: Sunday\nTime: 10:00am\nPrice: Requires video game add-on\nMaximum number of participants: 32\nPrizes: The first place player will receive a prize package from Astro Gaming and GUNNAR Optiks valued at over $300. The second place player will receive a prize package from Astro Gaming and GUNNAR Optiks valued at over $150. The third place player will receive a prize package from Astro Gaming valued at over $100.\n\nThis is a Free for all format tournament that does not require a team. Eight players at a time will face off in this free for all event with the bottom four scores in each round receiving a loss. This is a double elimination tournament (players will not be counted out until their second loss). Players will use a default profile. No personal profiles, No recoveries and or HD swaps will be allowed. These matches will be set up via Private match so all weapon and perk unlocks will be available. MLG rule sets will be followed for this event and full rules and restrictions will be made available on the GottaCon website.\n\nPlayers may register at the GottaCon Event Registration up to 1 hour before the tournament starts, after which they must register with IRL Events in the console area. All players must-sign in at least 15 minutes before the start of the tournament.\n\nDue to the game rating of “M” for Mature anyone under the age of 17 is required to get parental permission to compete. Please find a parental consent form HERE: http:\/\/www.gottacon.com\/components\/tournaments\/egpermission2013.pdf","11-Dec-12"],["Sunday",10,"11:00am","EG",12,"PC - Team Fortress 2","By GottaCon and BC Gamer\nSponsor: Roccat\nDay: Sunday\nStart Time: 11:00am\nPrizes: Sponsored by ROCCAT and Valve with over $800 in prizes!\nGenre: First Person Shooter\nOfficial Website: http:\/\/www.teamfortress.com\/\nSteam Store Page: http:\/\/store.steampowered.com\/app\/440\/\n\nValve’s free team-based cartoon shooter is incredibly popular for a reason... if you haven’t given it a chance yet, the time is now! Everyone will be encouraged to join our dedicated server and fight along side your fellow red or blue LAN-goers. A competition may follow based on participation.","5-Nov-12"],["Sunday",10,"12:00pm","EG",13,"Wii – Super Smash Bros. Brawl Tournament","By GottaCon and IRL Events\nDay: Sunday\nTime: 12:00pm\nEntry Fee: $5.00\nMaximum number of participants: 32\nPrizes: All entry fees will be given out between 1st, 2nd and 3rd place.\n\nThis tournament will be double elimination – 1 vs 1. Rounds are best 2 out of 3 matches, final rounds are best 3 out of 5 matches. Each match is played with timed stock, 5 lives and 10 minutes. In the case that time runs out and one or more characters have an equal amount of lives, the character with less damage wins the match. If multiple characters have equal lives and damage, Sudden Death will determine the winner. Items are turned off, matches will be seeded randomly.\n\nMeta Knight is banned. Stalling is banned. (Stalling is defined as any action that deliberately avoids all conflict as to make the game unplayable. Running from an opponent to get to a better position is not considered stalling, but using chain grabs infinitely against a wall beyond 300% or using Sonic’s homing attack repeatedly underneath the stage is). Any action that prevents the game from continuing results in a forfeiture of the match for the offender. Some interactions (for example, interrupting a throw with a wind attack, can cause one character to become frozen until being hit. If this happens, the free character is expected to capitalize on this in a timely manner; a failure to do so is considered stalling).\n\nOnly the following stages may be used:\n- Battlefield, Yoshi’s Island, and Smashville\n-Group 2\n- Lylat Cruise and  Pokémon Stadium (Melee)\nGroup 3\n- Final Destination and Castle Siege\nGroup 4\n- Delfino Plaza and Halberd","8-Dec-12"],["Sunday",10,"9:00am","EG","12\/13","Logitech PC and \nMad Catz Console Freeplay","Day: Friday, Saturday, and Sunday\nTime: All Slots\n\nCome and play some games at the Logitech PC LAN on the free-play stations or Mad Catz Console LAN. **The Logitech PC LAN free-play stations may not be used to participate in Premium tournaments.","30-Dec-12"],["Sunday",10,"9:00am","EG",12,"PC - Free-play Servers ","By BC Gamer\nDay: Friday, Saturday, Sunday\nTime: All slots\n\nBC Gamer will be hosting the following servers all weekend long for players to join at their leisure: Team Fortress 2, Chivalry: Medieval Warfare, Counter-Strike: Source, Counter-Strike: Global Offensive, Minecraft, KillingFloor, TeamSpeak 3. End of Reality is hosting Shootmania:Storm and Battlefield 3.","8-Dec-12"],["Sunday",10,"9:00am","EG",12,"PC - Minecraft Building Contest","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All slots\nJudged: Sunday 1:00pm\nGenre: Indie - Sandbox\nOfficial Website: https:\/\/minecraft.net\/\n\nShow us your digital creativity. We will have a Minecraft server running all weekend where individual players and building teams will construct anything they can imagine. The creations will be judged on Sunday by our panel of expert architectural critics.","5-Nov-12"],["Sunday",10,"9:00am","EG",12,"PC - Premium League of Legends Tournament (5vs5) \nRound 2 – Bracket Play","By GottaCon and LANcouver\nSponsored by: Logitech\nDay: Sunday\nTime: 9:00am to 2:00pm  \nNOTE: Some bracket matches may begin on Saturday if time allows and if the seed matches from two pools are known.\nPrice: You must qualify to play in this tournament.\nPrizes: 1st place: Five identical prizes bundles containing a G710+ & G400 mouse. 2nd place: Five identical prizes bundles containing a G35 headset. 3rd Place: Five identical prizes bundles containing a G400 mouse. Please note we are still waiting to hear back from Riot around skin bundles.\n\nGENERAL RULES\nAll matches will be created using custom feature. Matches will use Tournament Draft Setting. Team Captains with higher seed will create game lobby and decide if they want first pick\/ban (blue side) or Last pick (purple side). In a Best of 3, the loser of each game will create the game lobby of game 2 (or 3) and will decide first pick\/ban (blue side) or Last pick (purple side). The Live Realm (NA Server) will be used for all Matches and players will use their own accounts.\n\nRound 2 – Bracket Play (Format: Single-elimination bracket, best-of-three, Summoner’s Rift)\nTeams will be seeded in the following fashion based on the results of the Pool Play:\nPool A top seed will play Pool C low seed , Pool A low seed will play Pool C high seed\u2028\nPool B top seed will play Pool D low seed\u2028, Pool B low seed will play Pool D high seed\nBracket play will be best-of-three, single elimination. The higher seed will create the first game lobby and the loser of each game will create the game lobby of game 2 (or 3) and will decide first pick\/ban (blue side) or last pick (purple side). All other tournament rules will remain the same as pool play.\n\nBest-of five finals will be played on Sunday and will include the 3rd place match if not already completed. All rules from bracket play remain the same.","28-Oct-12"],["Sunday",10,"9:00am","EG",12,"PC - Tricky Truck: Time Trials","By GottaCon and BC Gamer\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nFinals: Sunday 2:00pm\nGenre: Indie - Racing\nOfficial Website: http:\/\/www.gravitysensation.com\/trickytruck\/\n\nThe ridiculousness of this simple game is sure to bring a smile to any one's face. You must navigate difficult terrain and park a large truck as quickly as possible. Sound easy? We will have a station running all weekend for people to hone their skills. Final time trials will take place on Sunday.","5-Nov-12"],["Sunday",10,"9:00am","EG",17,"Xbox 360 - The Four Game Gauntlet","By Canadian Joystick and CrossXover\nDay: Sunday\nTime: 9:00am to 6:00pm\nMaximum number of participants: 16\nPrize: TBA\n\nThink you got what it take to be the ultimate puzzle gamer? Prove it in CrossXovers’ 4 round elimination gauntlet! Out-think, out- wit and out-play your opponents in Super Puzzle Fighter II Turbo HD Remix, Wario’s Woods, Puyo Puyo and if you manage be among the last 2 standing prepare yourself for a special mystery game. There is a 16 player cap, single elimination rounds, all games are best of three to five rounds. Multiple tournaments will be run over the day.","11-Dec-12"],["Sunday",10,"10:00am","Minis","M03","Malifaux - Masters of Malifaux, Gaining Grounds Tournament","By GottaCon\nSponsored by: Wyrd Miniatures\nDay: Sunday\nTime: 10:00am\nPrice: Included in Malifaux Ticket Package\nMaximum number of participants: 16\n\nRules Packet: http:\/\/www.gottacon.com\/components\/tournaments\/masterofmalifauxgottacon2013web.pdf\n\nGottaCon and Wyrd Miniatures are proud to present an exciting Lineup of Malifaux Tournaments throughout the weekend. Prizes will be awarded individually in each Tournament, and the Player with the most combined Tournament Points for the weekend will earn the title of GottaCon 2013 Malifaux Champion! Purchase of a GottaCon Malifaux ticket package secures a place in each Malifaux Tournament and is required for pre-registration and entry in the “First into the Breach”, “One Way Ticket”, and “Masters of Malifaux” Events, as well space is limited to 16 players for the three mentioned events.","28-Oct-12"],["Sunday",10,"10:00am","Minis","M01","Warhammer 40K Two Day GottaCon Championship Tournament - Day 2","By GottaCon.\nDay: Sunday\nTime: 10:00am to 6:00pm\nPrice: $50 (includes full weekend entry)\nMaximum number of participants: 64\nPrizes: Prizes will be awarded in the following categories; first, second, third overall score, best painted army, best sportsmanship, and best general. \n\nFor complete details on this event please go here:  http:\/\/www.gottacon.com\/components\/2013warhammerrules.pdf\nor please speak with the event registration desk or the organizers of the event.","17-Oct-12"],["Sunday",10,"10:00am","Minis","M02","Warhammer Fantasy Two Day GottaCon Championship Tournament - Day 2","By GottaCon.\nDay: Sunday\nTime: 10:00am to 6:00pm\nPrice: $50 (includes full weekend entry)\nMaximum Number of participants: 50\nPrizes: Prizes will be awarded in the following categories; first, second, third overall score, best painted army, best sportsmanship, and best general. \n\nFor complete details on this event please go here:  http:\/\/www.gottacon.com\/components\/2013warhammerrules.pdf\nor please speak with the event registration desk or the organizers of the event.","17-Oct-12"],["Sunday",10,"9:00am","Minis","M03","DEMO - Malifaux Demo Games","Day: Friday, Saturday, Sunday\nTime: All daytime slots\nMaximum number of participants: As Seating Allows\n\nTrigger-happy gunslingers, misguided Victorian science, hungry undead, and monsters hidden in every shadow; these are the terrors that will plague you in Malifaux. Are you willing to risk your soul for a chance at great wealth and power? Because it's the only thing you have worth trading. In Malifaux, you lead your crew in the battle for control of The Breach, a dark portal to a world of limitless magic. A Demonstrator will be on hand to provide introductory games to those wishing to learn this game. No Experience Necessary. Miniatures will be provided.","30-Oct-12"],["Sunday",10,"9:00am","Minis","M03","DEMO - Warmachine\/Hordes Demo Games ","Day: Friday, Saturday, Sunday\nTime: All daytime slots\nMaximum number of participants: As Seating Allows\n\nIn the Game WARMACHINE players take on the role of warcasters as they lead their titanic forces into battle. Warcasters possess significant martial prowess of their own as well as having hardened warriors and magical spells to bring to bear. No Experience Necessary. Miniatures provided.","30-Oct-12"],["Sunday",10,"9:00am","Minis","M03","Warmachine\/Hordes Iron Arena ","By GottaCon\nSponsored by: Wiser's Collectibles \nDay: Friday, Saturday, and Sunday\nTime: All Slots\n\nAll weekend, day or night, Warmachine and Hordes players at GottaCon 2013 will be able to participate in the Iron Arena! Bring an army and play against an \nOpponent in this open-play format. You decide upon the points value for the games. Collect points and redeem them to pick up some great prizes!!","17-Oct-12"],["Sunday",10,"9:30am","Minis","M03","Warmachine\/Hordes Two Day Steamroller GottaCon Championship - Day 2","By GottaCon.\nSponsor: Privateer Press and One Stop Shop Cards & Games\nDay: Sunday\nTime: 9:30am to 6:30pm\nPrice: $50 (includes full weekend entry and any of the Warmachine tournaments)\nMaximum number of participants: 32\nPrizes: Prizes will be awarded in the following categories; first, second, and third overall score as well as best painted army.\n\nStarting Saturday morning at 9:30am our feature Warmachine\/Hordes GottaCon Steamroller Championship tournament begins. Day one will see three rounds of play and day two will see the final three rounds of play. Rules and restrictions as per the official Steamroller tournament format.","17-Oct-12"],["Sunday",10,"9:00am","RPG","R04","d20 Brickstyle\n– Rescue!","By Kier Robins\nDay: Sunday\nStart Time: 9:00am\nNumber of participants: 4 to 7\n\nUVic LEGO Robotics Coordinator Kier Robins' pared down d20\/LEGO mashup rules are quick and fun, giving it a Blue Box feel, with just enough skills and feats to make building, jumping, running and hiding work. Players will have .5 level characters adapted from 3.0 D&D with classes like Warrior, Acolyte, Scholar, Builder, Noble, and Camp Follower. The LEGO Ethos of cartoon violence, get back up and keep playing and fun is adhered to. This makes it a perfect entry into Role Playing that is fun, safe, and nerfed silly, just like LEGO LotR.  Get your dice and bricks on!  Participants aged 7 and up welcome.","13-Nov-12"],["Sunday",10,"9:00am","RPG","R05","DnD 4th ed. Gamma World \n– Steading of the Iron King","By Daniel Oberreiter\nDay: Sunday\nStart Time: 9:00am\nNumber of participants: 3 to 5\n\nIt started about a month ago. A robot rolled down from the foothills to the village edge. The Ancient device blinked and buzzed then blew up. The same thing happened the next day, and the next, and almost everyday since. However, on at least four occasions, a robot succeeded in reaching the village periphery, buzzed, blinked and then fired a rocket at the wall (without much effect) before it died out. What the heck is going on in the foot hills???\n\nPlayers have a chance at the quick and fun character creation of Gamma World before the game starts. See how far you can get before you're zapped, blasted, beaten, or mutated into a gibbering mess!","6-Nov-12"],["Sunday",10,"9:00am","RPG","R03","Marvel Heroic Roleplaying \n– Heroes Again","By Dwayne Morash\nDay: Sunday\nStart Time: 9:00am\nMaximum number of participants: 5\n\nThe Avengers have vanished and New York needs them! A small group of heroes have banded together in their absence and discover a plot that threatens the safety of the \"Big Apple\" itself. Does this motley crew have what it takes to fill the shoes of Earth's mightiest heroes and if not, will the Avengers re surface in time to save the city? Jump into the shoes of popular superheroes in a session of Marvel Heroic RPG!","6-Nov-12"],["Saturday",10,"9:00am","RPG","R02","Pathfinder RPG \n– Pathfinder Society: In Wrath's Shadow","Day: Saturday and Sunday\nStart Time: 9:00am\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 3 to 7.\n\nIn the ruins of Xin-Bakrakhan—seat of power of the Runelord of Wrath—the Pathfinder Society stands on the verge of a great discovery, but first the brave agents exploring the ruins must survive ages-old dangers and contemporary threats to return with the knowledge and wealth they’ve unearthed.","6-Nov-12"],["Sunday",10,"9:00am","RPG","R01","Pathfinder RPG \n– Pathfinder Society: Rise of the Goblin Guild","By David Van Ommen\nDay: Friday, Saturday, and Sunday\nStart Time: 7:00pm(Friday and Saturday), 2:00pm(Saturday), and 9:00am(Sunday)\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 1 to 5.\n\nWhen a monster is discovered on the grounds of the Pathfinder Lodge at Heidmarch Manor in Magnimar, an investigation into its appearance leads the PCs deep under the City of Monuments - and face to face with a burgeoning thieves’ guild.","6-Nov-12"],["Sunday",10,"9:00am","RPG","R07","Savage Wolrds \n– DSE-13","By Duncan MacRae\nDay: Sunday\nStart Time: 9:00am\nNumber of participants: 2 to 5\n\nAn interstellar vessel, The Deep Space Explorer-13, is on a mission to study an unknown star system for potential colonization.  The crew is awoken from cryosleep earlier than expected due to malfunctions aboard the ship.  The ship is the only thing keeping them alive, and if they can't get it running again then it becomes their tomb.  Let's hope nothing else goes wrong.","6-Nov-12"],["Sunday",10,"9:00am","RPG","R08","Savage Worlds \n– Froth Barrel: Episode 2: Flight for Freedom!","By Takeda Anderson of The Froth Barrel Sodality\nDay: Sunday\nStart Time: 9:00am\nNumber of participants: 1 to 6\n\nYou and your men have just escaped with many losses from a prisoner-of-war camp. You have scavenged some weapons and supplies but if you are found out you will be killed. It had become obvious that if you had remained there that your men would have starved to death or worse. The escape was daring and many lives were lost. You are many weeks of travel from the border but it is your only option. It appears that you can try disguise, guile or camouflage but you must do anything you can to find your way home. Odds are that your cadre are being pursued...you are the hunted. It is likely that you will meet your death but the how and when are in your hands.","13-Nov-12"],["Sunday",10,"9:00am","RPG","R09","Savage Worlds \n– Savage Worlds for Beginners:  The Tomb of Terrors","By Bayden Woodland\nDay: Sunday\nStart Time: 9:00am\nNumber of participants: 2 to 5\n\nSavage Worlds is an easy to use, pulpy, story driven game system playable with any setting. This adventure is a short dungeon crawl style fantasy adventure for early level adventurers. Newcomers welcome!","6-Nov-12"],["Sunday",10,"9:00am","RPG","R11","Warhammer Fantasy Roleplay \n2nd Edition\n– Green Ronin: Freeport\nWFRP Style","By Chris Pramas of Green Ronin\nDay: Sunday\nStart Time: 9:00am\nMaximum number of participants: 6\n\nGreen Ronin's Freeport has been one of the signtature cities of modern roleplaying since 2000. In this scenario, Freeport and WFRP2 designer Chris Pramas mashes two of his creations together for madness, mayhem, and chaos in the City of Adventure. Small but vicious dogs encouraged but not required.","29-Dec-12"],["Sunday",10,"9:00am","RPG","R06","Warhammer Fantasy Roleplay 3rd Edition \n– A Day Late and a Shilling Short","By Bryan Skinner\nDay: Sunday\nStart Time: 9:00am\nNumber of participants: 2 to 4\n\nA Day late and a Shilling Short is a Demo Scenario for Warhammer Fantasy Roleplay 3rd Edition.\n\nSomething is definitely wrong. Vaerun the High Elf Envoy is expecting an important package that was supposed to arrive on the last coach. Birgitta the Roadwarden’s partner Rutger was escorting the package. The coach, the package, and Rutger are all a day late. Worried about what may have happened, Birgitta and Vaerun head off to investigate. Kurgi Balginson the Dwarf Troll Slayer joins them, eager to pay back his honour debt to Birgitta – or die trying.","6-Nov-12"],["Sunday",10,"9:00am","RPG","R10","Zombie Squad RPG \n– Sweet Meats","By Todd Glawson\nDay: Saturday and Sunday\nStart Time: 9:00am(Saturday and Sunday) and 2:00pm(Sunday)\nMaximum number of participants: 6\n\nEach player will have 2 characters: one male and one female. The object of the game is to get out of the city and to the safety of the open country.  Every couple for themselves OR you could work together as a larger group to get through the chaos and survive.  Along the way you will find weapons to combat the Zombies. But surely at the sacrifice of a character or two.","6-Nov-12"],["Sunday",10,"9:00am","Special Event",18,"Lego - Blind Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will have an ongoing blind build competition while our booths are open. Drop in, attempt to make the model and put your score on the leaderboard. We will be bringing a set of blind build stands where the participant won't be able to see what they are building but everyone else will!","24-Dec-12"],["Sunday",10,"9:00am","Special Event",18,"Lego - Kid Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will be hosting a kid ( and grown up kid ) build zone for the duration of Gottacon. You are welcome to come build at any time using the club's public brick buckets even if we are not manning our booth at the time. Parents are asked to monitor their children and everyone is welcome to leave your creations for the rest of the attendees to admire afterwards.","1-Jan-13"],["Sunday",10,"9:00am","Special Event",18,"Lego - Speed Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will have an ongoing speed build competition while our booths are open. Drop in, attempt to make the model as fast as possible, and put your score on the leaderboard.","24-Dec-12"],["Sunday",10,"9:00am","Special Event",18,"Lego - VicWars","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will be hosting their tabletop minifig game, VicWars, again this year with a few new rule additions for returning fans. Games will run for 2 hours and are drop in\/out, very easy to pickup. Appropriate for any age but parents need to attend their children. Check times posted on game table for any schedule changes.","1-Jan-13"],["Sunday",10,"10:00am","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– GottaCon Modern Tournament","By GottaCon and Yellowjacket.\nDay: Sunday\nStart Time: 10:00am\nPrice: $10\nPrizes: Based on attendance\n\nEach participant must bring their own minimum 60 card deck built using the current Modern rules and restrictions.","2-Jan-13"],["Sunday",10,"10:00am","TCG","Please\nVisit WOW\nTO Centre\nArea 6","World of Warcraft \n- Beginners Sealed Events","By GottaCon and Skyhaven Games\nDay: Friday, Saturday, and Sunday\nStart Time: 7:00pm(Friday), 1:00pm(Saturday), and 10:00am(Sunday)\nPrice: $10 + HST\n\nEach player receives one random 2011 class deck and then one War of the Elements booster after each round. With 10 players, two rounds of 30 minute rounds are played.","3-Nov-12"],["Sunday",10,"10:00am","TCG","Please\nVisit WOW\nTO Centre\nArea 6","World of Warcraft TCG \nSpectral “Kitten” Safari","By GottaCon Conventions, Skyhaven Games and Cryptozoic Entertainment\nDay: Sunday\nStart Time: Registration is at 10:00am and the event starts at 11:00am.\nPrice: This event is free if you purchase the World of Warcraft TCG Pass. Otherwise the Price is $20+HST.\nPrizes: First to fourth place will receive additional prizes and additional prizes may be awarded based on attendance. At the end of the tournament, one lucky participant chosen at random will win a Spectral Kitten Loot card.\n\nThe format is Class Deck Starters with 30 min rounds, number of rounds based on attendance. You don’t need to own any cards to participate; you just need knowledge of how to play. Participants will receive one Block 4 Starter deck (yes this is what was sent to us).\n\nIf you have any questions regarding World of Warcraft TCG Events please contact: skyhavenvictoria@shaw.ca","28-Oct-12"],["Sunday",10,"11:00am","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering – GottaCon Victoria vs. Vancouver Grudge Match","By GottaCon Team and Yellowjacket.\nDay: Sunday\nStart Time: 11:00am\nFormats to be played: Standard Constructed, Draft, Cube Draft\nTeam Composition:\nTeams will be composed of nine players. One of the nine players will be considered the team captain and he will speak for the team. Each team will break their nine players into three groupings or three players, which will be called a cluster. One cluster will represent Standard Constructed, one cluster will represent Draft and one cluster will represent cube draft.\nHow Teams are Built:\nIt is up to the city involved to construct their team. It is recommended that both teams use the same team construction method.\nExecution of the Event:\nEach cluster will face off against the same format cluster of the opposing team in round robin format and DCI rules. Each player in a cluster will face off against each player in the opposing team cluster in a best of three games match. All clusters will play at the same time for a total of three rounds for each cluster. By running the event this way it should conclude within 2 to 4 hours. DCI team rules are in effect during matches. Judges will be watching for slow play as a result of player to player communications.\n\nPlease note that there is a maximum of four of any one card in a constructed cluster (so you can only have 4 lightning bolts between all three standard decks could also have up to four lightning bolts between them as well) The team with the most wins in the draft cluster takes possession of all the draft cards for both teams and distributes them among the overall team as the team sees fit. Teammates may communicate with each other at any time, unless they leave the area near their side of the table. If they leave that area, they may not return until the end of the match. Hidden info is not to be revealed. If a player of a team glimpses a deck type or card(s) in an opponent’s deck before the deck is made public, players are asked to keep this info to themselves. E.G. opponent watches a player shuffle and sees the cards then tells the teammate who is playing that player. First drawn hand is seen by a player, then a mulligan is taken, player should not share what they saw.","24-Dec-12"],["Sunday",10,"12:00am","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– GottaCon Commander Tournament","By GottaCon and Yellowjacket.\nDay: Sunday\nStart Time: 12:00pm\nFormat: Multiplayer free-for-all\nPrice: $10 Prizes: Based on attendance\n\nPlease go here for details on how this event works and current ban lists: http:\/\/www.wizards.com\/magic\/tcg\/resources.aspx?x=magic\/rules\/100cardsingleton-commander","2-Jan-13"],["Sunday",10,"9:00am","TCG","Please\nVisit WOW\nTO Centre\nArea 6","DEMO - World of Warcraft - WoW Demo Event","By GottaCon and Skyhaven Games\nDay: Friday, Saturday, and Sunday\nTime: All daytime slots.\n\nCome learn to play the World of Warcraft Trading Card Game! Each demo will take only a short ten minutes, and we'll step you through the basics of the game! Then, if you like, you can enter our Beginner's Sealed Event, and play with a preconstructed starter. Play two rounds, get two free booster packs!","3-Nov-12"],["Sunday",10,"9:00am","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering - Intro Deck Duels Event","By GottaCon, Wizards of the Coast and Yellowjacket.\nDay: All weekend\nStart Time: 7:00PM Friday Night, ending Sunday at 4:00PM\nPrice: Free with MTG weekend pass or $15 at the Yellowjacket tournament reporting centre.\nMaximum number of participants: 150\nPrizes: To Be Determined\n\nEach participant will receive a random Intro Duel Deck. Participants may face off against any other Intro Pack Convention League participants in one game at any time over the span of the weekend and report the results, who won and who lost, on their record sheet as well as to the Yellowjacket reporting centre. Players are paired against other players and may not play the same player two (2) times in a row. The winner of the match will be granted two random cards from a pool of cards. The winner then may view and select one of those cards to keep and add it to their intro deck if they so choose and return the other card to the pool or cards. The loser will receive one random card to keep and add to their deck should they choose to. Decks must be a minimum 40 cards. There is no limit to the number of individual opponents you can play.","28-Oct-12"],["Sunday",10,"9:00am","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– Gunslinging ","By GottaCon and Yellowjacket Comics and Toys.\nStart time: All weekend at select times at the Yellowjacket tournament reporting centre\nPrice: Free\n\nFace off against professional level MTG players from BC. Win a game and you win a booster!","9-Dec-12"],["Sunday",10,"9:00am","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– Pickup Draft","By Yellowjacket Comics and Toys.\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nPrice: $15\nPrizes: 5-3-2-2","9-Dec-12"],["Sunday",10,"9:00am\n(slot 5)","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering - Massive Mini Master Event","By GottaCon, Wizards of the Coast and Yellowjacket.\nDay: Saturday, finals on Sunday\nTime: 9:00am\nCost: Free with MTG weekend pass or $10 at the Yellowjacket tournament reporting centre.\nMaximum number of participants: You must qualifty to participate in this event.\nPrizes: To be determined, based on attendance.\n\nSimilar to what MTG fans experienced on Magic Celebration day and just like we did at GottaCon 2012, this format is a fast fun way to play Magic! Each participant will received two boosters and have 15 minutes to construct a 25 card minimum deck. Participants will then be paired in a single elimination format with 50 minute rounds. The winner of each round will receive an additional booster and will have 10 minutes to modify their decks with these new cards. After round three deck size must be a minimum of 40 cards. Participants will then be paired for the next round. This pattern will continue until there in one overall winner. Round for this event will discontinue at 2pm Saturday and any remaining player’s decks will be collected and boxed by judges at the tournament reporting desk. The final rounds will continue on Sunday at 9am. This is in an effort to reduce conflict with the MTG Open Sealed event which starts at 2pm.","28-Oct-12"],["Sunday",10,"10:00am","WS\/P","Panel Room","GM Roundtable – Enhanced Story Telling","Day: Sunday\nTime: 10:00am to 12:00pm\nPanelists: Alex Flagg, Douglas Lloyd, Eric Seaton, Steve Saunders\n\nJoin these GMs as they discuss ways to turn a game from simple words on a page, into an immersive world – LARPing without leaving the table. How can the use of props, miniatures, music, battle mats, costumes, voices, and more enhance the game-play experience? How do you weigh time preparing vs reward? When do you stop using tools to enhance story telling and when do you leave the story to the players imaginations?","1-Jan-13"],["Sunday",10,"12:00pm","WS\/P","Panel Room","Project London Screening","Day: Sunday\nTime: 12:00pm  to 2:00pm\nPanelists: Project London\n\nProject London is an independent, live action movie with 774 vivid visual effects and animations created with the open source software. \n\nNebraska Higgins plunges into a world of struggle and intrigue after Joint Command kills his father, Arizona, a hero known by his large robotic exo-suit. ","1-Jan-13"],["Sunday",11,"2:00pm","BG",3,"Board Game Library (Sign out Games to Play) ","By GottaCon\nDay: Friday, Saturday, and Sunday\nTime: All Slots\n\nThis year GottaCon is pleased to continue to have a library of board games that our attendees are free to sign out and play. Sign out games from the Event Registration Desk by requesting a game from our available titles and leaving behind a piece of ID. GottaCon would like to thank Days of Wonder, Mayfair Games, Rio Grande, Fantasy Flight Games, and AEG for making additions this year.","18-Oct-12"],["Sunday ",11,"2:00pm","BG","BG10","Bodger Games","By Nathan Bosa\nDay: Saturday and Sunday\nStart Time: 2:00pm, multiple sessions\nNumber of of participants: 2 to 4\n\nLooking for some wacky entertainment with a little dose of destruction? Every Bodgers game brings home fun for the whole family as you dive into the maniacal and mechanical mayhem of the always zany and sometimes dangerous goblin Bodgers. Come try out Three exciting Bodger Games by Privateer Press: ‘Infernal Contraption’, ‘Scrappers’, and ‘Heap’. No experience necessary","4-Nov-12"],["Sunday",11,"2:00pm","BG","BG09","DEMO - 7 Wonders","By Duncan Hauser\nDay: Sunday\nStart Time: 2:00pm\nNumber of participants: 2 to 7 (multiple sessions)\n\nCome build your wonder and make your civilization one that will never be forgotten.\n\n7 Wonders lasts three ages. In each age, players receive seven cards from a particular deck, choose one of those cards, then pass the remainder to an adjacent player. The game ends at the end of the third age. It sounds simple, but there are many ways to win!","4-Jan-13"],["Sunday",11,"2:00pm","BG","VCON 1\nVCON 2","DEMO - VCON presents: \n10 Days in... ","By Rick Arino of VCon\nDay: Sunday \nStart Time: 2:00pm\nNumber of participants: 2+\n\nDo you like to travel around the world? Of course you do! But this is a little different. Rather than play one of the ‘10 Days in…’ game, we’re combining them! Yes… it’s 10 Days in the Americas, Europe, Africa and Asia. Tiles are arranged on a player's tray, then a new tile is drawn. It can be used to replace a tile on one of the \"days.\" Then that tile or the drawn tile is discarded face-up to one of three discard piles. Tiles may not be rearranged, only replaced. But in this version you’ll have numerous tiles from various boards to choose from. All the standard travel rules apply… but now there are more options. You still must complete your journey correctly, connecting by foot, air, automobile, rail and sea! Whoever is the first to connect all 10 days wins the game. This event will be run on both tables.","1-Jan-13"],["Sunday",11,"2:00pm","BG","BG01","German Games Afternoon","By Michael Poplawski \nDay: Sunday\nStart Time: 2:00pm\nMaximum of participants: 6\n\nMichael Poplawski presents German Games Afternoon at GottaCon! Come demo several Spiel des Jahres winners and nominees, including Zug um Zug Märklin, Auf Achse, Die Speicherstadt, Bezzerwizzer, Funkenschlag, Thurn und Taxis and more! Michael also provides a free service for importing games from Germany. German Games Night takes place regularly throughout the year. Play great games and have fun learning about Germany, the German language, and German games.","27-Nov-12"],["Sunday",11,"2:00pm","BG","M3\nGamers 1","Open Gaming With M3 Gamers\n- table 1","By M3 Gamers\nDay: Sunday\nStart Time: 2:00pm\nMaximum number of participants: 6 (multiple sessions)\n\nCome get a few last last games in with us. We'll be playing a variety of games are are willing to take on all comers. ","9-Dec-12"],["Sunday",11,"2:00pm","BG","M3\nGamers 2","Open Gaming With M3 Gamers\n- table 2","By M3 Gamers\nDay: Sunday\nStart Time: 2:00pm\nMaximum number of participants: 6 (multiple sessions)\n\nCome get a few last last games in with us. We'll be playing a variety of games are are willing to take on all comers. ","9-Dec-12"],["Sunday",11,"2:00pm","BG","BG12","Steve Jackson Games \nOpen Demo","By: MIB5799 of Steve Jackson Game\nDay: Friday and Sunday\nStart Time: 7:00pm(Friday) and 2:00pm(Sunday)\nMaximum number of participants: 8\n\nKill the monsters - Steal the treasure - Stab your buddy. It's the Munchkin Way. MIB 5799 will be running open demos of Munchkin and other Steve Jackson Games for anyone who cares to drop in and play. Swag and Prizes will be awarded.","18-Nov-12"],["Sunday",11,"2:00pm","BG","BG11","The Core Gamers: Through the Ages: A Story of Civilization Tournament - Final","By Credence Holmes\nDay: Saturday and Sunday\nStart Time: 9:00am(Saturday) and 2:00pm(Sunday)\nNumber of participants:  4 to 8\n\nWelcome to our Through the Ages Final, where the top players of our previous round get to compete for a great prize! The winner is chosen through a points system based on: number of wins, a vote on biggest impact on game (Best card choice, best military action, etc.), and a vote for most fun player in game (Roleplay, card choices, etc.) Most games are 3 players; some may be 2 or 4 player.\n\nThere'll be some adaptations to the rules: 1) Each player starts with 1 defense card 2) A notification card is placed in the deck 8-16 cards from the end of the age based upon the number of players playing. 3) Some cards have adjustments found at http:\/\/thecoregamers.yolasite.com\/games.php ","24-Dec-11"],["Sunday",11,"9:30am\n(slot 10)","BG","BG02\nto\nBG08","The Great Canadian Board Game Blitz Qualifier","By GottaCon\nDay: Sunday\nStart Time: Registration at 9:30am games start at 10:00am\nPrice: Free\nMaximum number of participants: 28\nPrizes: Our sponsors have provided some prizes and GottaCon has gathered up some additional prizes as well. Each round a random prize will be awarded and there will be prizes for top finishing ranks based on attendance.\n\nFor complete details on this event please go here:  http:\/\/www.gottacon.com\/?page_id=1313#blitz\nor please speak with the event registration desk or the organizers of the event.","18-Oct-12"],["Sunday",11,"1:00pm","EG",12,"PC - Minecraft Building Judging","By GottaCon and BC Gamer\nDay: Sunday\nTime: 1:00pm\nGenre: Indie - Sandbox\nOfficial Website: https:\/\/minecraft.net\/\n\nShow us your digital creativity. We will have a Minecraft server running all weekend where individual players and building teams will construct anything they can imagine. The creations will be judged on Sunday by our panel of expert architectural critics.","5-Nov-12"],["Sunday",11,"2:00pm","EG","12\/13","Logitech PC and \nMad Catz Console Freeplay","Day: Friday, Saturday, and Sunday\nTime: All Slots\n\nCome and play some games at the Logitech PC LAN on the free-play stations or Mad Catz Console LAN. **The Logitech PC LAN free-play stations may not be used to participate in Premium tournaments.","30-Dec-12"],["Sunday",11,"2:00pm","EG",12,"PC - Free-play Servers ","By BC Gamer\nDay: Friday, Saturday, Sunday\nTime: All slots\n\nBC Gamer will be hosting the following servers all weekend long for players to join at their leisure: Team Fortress 2, Chivalry: Medieval Warfare, Counter-Strike: Source, Counter-Strike: Global Offensive, Minecraft, KillingFloor, TeamSpeak 3. End of Reality is hosting Shootmania:Storm and Battlefield 3.","8-Dec-12"],["Sunday",11,"2:00pm","EG",12,"PC – Premium StarCraft II Tournament - \nRound 2 – Bracket Play","By GottaCon and LANcouver\nSponsored by: Antec and Kingston HyperX\nDay: Sunday\nTime: 2:00pm to 5:00pm\u2028\nPrice: You must qualify to play in this tournament.\nPrizes: The first place player will receive a prize package from Antec and Kingston HyperX. The second place player will receive a prize package from Antec and Kingston HyperX. The third place player will receive a prize package from Antec and Kingston HyperX.\nMaximum number of participants: 8\n\nRound 2 – Bracket Play\n(Format: Single elimination bracket, best-of-three, best-of-five semi finals and finals will be best-of-seven finals if time allows.)\nChampionship Bracket: 8 players from Round 1 move to bracket play. The bracket continues until there is one winner. Prizes awarded for 1st, 2nd and 3rd places.\nFor complete rules: http:\/\/www.gottacon.com\/?page_id=1331#sc2","28-Oct-12"],["Sunday",11,"2:00pm","EG",12,"PC - Tricky Truck: Time Trails Finals","By GottaCon and BC Gamer\nDay: Sunday\nTime: 2:00pm\nGenre: Indie - Racing\nOfficial Website: http:\/\/www.gravitysensation.com\/trickytruck\/\n\nThe ridiculousness of this simple game is sure to bring a smile to any one's face. You must navigate difficult terrain and park a large truck as quickly as possible. Sound easy? We will have a station running all weekend for people to hone their skills. Final time trials will take place on Sunday.","5-Nov-12"],["Sunday",11,"2:00pm","EG",13,"Xbox 360 - Premium Call of Duty Modern Warfare Black Ops 2 (2vs2)","By GottaCon and IRL Events\nSponsored by: Astro Gaming and GUNNAR Optiks\nDay: Sunday\nTime: 2:00pm\nTeam Size: 2 Players\nPrice: Requires video game add-on\nMaximum number of teams: 16\nPrizes: The first place team will receive a prize package from Astro Gaming and GUNNAR Optiks valued at over $600. The second place team will receive a prize package from Astro Gaming and GUNNAR Optiks valued at over $300. The third place team will receive a prize package from Astro Gaming valued at over $200.\n\nThis event is a 2 Versus 2 format tournament that pits two teams of players against each other in a fierce firefight of Modern Warfare! It is a double elimination format and teams will not be counted out until their second loss. If a player who wants to participate does not have a teammate they can partner up with random gamers who also don’t have a teammate. Players will use a default profile. No personal profiles, No recoveries and or HD swaps will be allowed. These matches will be set up via Private match so all weapon and perk unlocks will be available. MLG rule sets will be followed for this event and full rules and restrictions will be made available on the GottaCon website.\n\nPlayers may register at the GottaCon Event Registration up to 1 hour before the tournament starts, after which they must register with IRL Events in the console area. All players must-sign in at least 15 minutes before the start of the tournament.\n\nDue to the game rating of “M” for Mature anyone under the age of 17 is required to get parental permission to compete. Please find a parental consent form HERE: http:\/\/www.gottacon.com\/components\/egpermission2012.pdf","11-Dec-12"],["Sunday",11,"10:00am\n(slot 10)","Minis","M01","Warhammer 40K Two Day GottaCon Championship Tournament - Day 2","By GottaCon.\nDay: Sunday\nTime: 10:00am to 6:00pm\nPrice: $50 (includes full weekend entry)\nMaximum number of participants: 64\nPrizes: Prizes will be awarded in the following categories; first, second, third overall score, best painted army, best sportsmanship, and best general. \n\nFor complete details on this event please go here:  http:\/\/www.gottacon.com\/components\/2013warhammerrules.pdf\nor please speak with the event registration desk or the organizers of the event.","17-Oct-12"],["Sunday",11,"10:00am\n(slot 10)","Minis","M02","Warhammer Fantasy Two Day GottaCon Championship Tournament - Day 2","By GottaCon.\nDay: Sunday\nTime: 10:00am to 6:00pm\nPrice: $50 (includes full weekend entry)\nMaximum number of participants: 50\nPrizes: Prizes will be awarded in the following categories; first, second, third overall score, best painted army, best sportsmanship, and best general. \n\nFor complete details on this event please go here:  http:\/\/www.gottacon.com\/components\/2013warhammerrules.pdf\nor please speak with the event registration desk or the organizers of the event.","17-Oct-12"],["Sunday",11,"2:00pm","Minis","M04","DEMO - Infinity","Day: Friday, Saturday, and Sunday\nStart Time: 7:00pm(Friday), 9:00am(Saturday), and 2:00pm(Sunday)\nNumber of participants: As seating allows\n\nOne hundred and seventy-five years into the future Humanity has managed to survive despite itself, but for how much longer? Infinity is a game with 28mm high metal miniatures that simulates combat and special operations in a science fiction environment with Manga aesthetics. No experience is necessary. Miniatures will be provided.","30-Oct-12"],["Sunday",11,"2:00pm","Minis","M03","DEMO - Malifaux Demo Games","Day: Friday, Saturday, Sunday\nTime: All daytime slots\nMaximum number of participants: As Seating Allows\n\nTrigger-happy gunslingers, misguided Victorian science, hungry undead, and monsters hidden in every shadow; these are the terrors that will plague you in Malifaux. Are you willing to risk your soul for a chance at great wealth and power? Because it's the only thing you have worth trading. In Malifaux, you lead your crew in the battle for control of The Breach, a dark portal to a world of limitless magic. A Demonstrator will be on hand to provide introductory games to those wishing to learn this game. No Experience Necessary. Miniatures will be provided.","30-Oct-12"],["Sunday",11,"2:00pm","Minis","M03","DEMO - Warmachine\/Hordes Demo Games ","Day: Friday, Saturday, Sunday\nTime: All daytime slots\nMaximum number of participants: As Seating Allows\n\nIn the Game WARMACHINE players take on the role of warcasters as they lead their titanic forces into battle. Warcasters possess significant martial prowess of their own as well as having hardened warriors and magical spells to bring to bear. No Experience Necessary. Miniatures provided.","30-Oct-12"],["Sunday",11,"2:00pm","Minis","M03","Warmachine\/Hordes Iron Arena ","By GottaCon\nSponsored by: Wiser's Collectibles \nDay: Friday, Saturday, and Sunday\nTime: All Slots\n\nAll weekend, day or night, Warmachine and Hordes players at GottaCon 2013 will be able to participate in the Iron Arena! Bring an army and play against an \nOpponent in this open-play format. You decide upon the points value for the games. Collect points and redeem them to pick up some great prizes!!","17-Oct-12"],["Sunday",11,"9:30am\n(slot 10)","Minis","M03","Warmachine\/Hordes Two Day Steamroller GottaCon Championship - Day 2","By GottaCon\nSponsor: Privateer Press and One Stop Shop Cards & Games\nDay: Sunday\nTime: 9:30am to 6:30pm\nPrice: $50 (includes full weekend entry and any of the Warmachine tournaments)\nMaximum number of participants: 32\nPrizes: Prizes will be awarded in the following categories; first, second, and third overall score as well as best painted army.\n\nStarting Saturday morning at 9:30am our feature Warmachine\/Hordes GottaCon Steamroller Championship tournament begins. Day one will see three rounds of play and day two will see the final three rounds of play. Rules and restrictions as per the official Steamroller tournament format.","17-Oct-12"],["Sunday",11,"2:00pm","RPG","R05","Desolation \n– Strange Skies","By Jonathan Yeo\nDay: Sunday\nStart Time: 2:00pm\nNumber of participants: 4 to 6\n\nThe Great Western Caravan is returning from the Warlands, an extended trade route that occurs every three years. It is heading towards Penroe, a frontier town that seem much bigger and sturdier than it should be. It is said that Penroe was built upon an ancient ruins although no one knows whose ruins they were. The secret is soon to be discovered; as is the cataclysm...Pre-generated characters provided.","6-Nov-12"],["Sunday",11,"2:00pm","RPG","R11","Mistborn Adventure Game\n– Crafty Games: Dance of Deceit","By Ryan Downing\nDay: Saturday and Sunday\nStart Time: 7:00pm(Saturday) and 2:00pm(Sunday)\nMaximum number of participants: 6\n\nIn the world of Mistborn, wars are waged in the halls of noble estates as they are the fields of battle. Assigned the unenviable task of keeping the peace at the Ackroyal ball, you soon find yourselves embroiled in a war of intrigue, deception, and conspiracy that tugs on the very foundations of society. Tread carefully, for in the Final Empire, the ballroom can be the most dangerous battlefield of all! Come learn how to play the Mistborn Adventure Game, set in the world of Brandon Sanderson’s best-selling Mistborn novels, in this demo.","29-Dec-12"],["Sunday",11,"2:00pm","RPG","R08","Mutant Future \n– Froth Barrel: The Eastern Block Cowboy Rides Again","By Pat “Lord Blackthorne” Klassen of The Froth Barrel Sodality\nDay: Sunday\nStart Time: 2:00pm\nNumber of participants: 2 to 6\n\nWelcome to the future. Humans as a race no longer exist and the unified races of earth are still recovering technologically from the 2nd war against the cybernetic collective. You find yourself in a small frontier town that has a giant black scorpion as a mayor and who is looking for help liberating the town from the clutches of a gang of resource looters.","13-Nov-12"],["Sunday",11,"2:00pm","RPG","R01","Pathfinder RPG \n– Pathfinder Society: Severing Ties","By Todd Conrod\nDay: Saturday and Sunday\nStart Time: 9:00am(Saturday) and 2:00pm(Saturday and Sunday)\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 1 to 5.\n\nThe Pathfinder Society has discovered a new Aspis Consortium base in the pirate city of Riddleport and sends a small team of agents to infiltrate the rival cell disguised as newly hired mercenaries from Magnimar. After proving their value to the Aspis Consortium by carrying out a number of tasks throughout the City of Cyphers, the Pathfinders can learn the location of one of the consortium's local allies and ensure that the support the Aspis Consortium is counting on from their friends won't come.","6-Nov-12"],["Sunday",11,"2:00pm","RPG","R02","Pathfinder RPG \n– Pathfinder Society: The Disappeared","By Mike Dowd\nDay: Saturday and Sunday\nStart Time: 9:00am(Saturday), 2:00pm(Saturday and Sunday), and 7:00pm(Saturday)\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 1 to 5.\n\nA powerful ally of the Pathfinder Society has disappeared, and no one but the Pathfinders even remembers that she ever existed. Can the PCs discover the fate of their missing associate, or will all memory of her be erased completely from history?","6-Nov-12"],["Sunday",11,"2:00pm","RPG","R03","Pathfinder RPG \n– Pathfinder Society: The Sanos Abduction","Day: Saturday and Sunday\nStart Time: 2:00pm\nNumber of participants: 4 to 6\nA Pathfinder Society Scenario designed for levels 3 to 7.\n\nThe Pathfinders are sent to the Sanos Forest in central Varisia to assist an agent researching the fey who inhabit the remote wood. But like many seemingly routine tasks in a Pathfinder's adventuring career, the simple support mission quickly turns into an adventure the PCs aren't soon to forget—presuming they survive.","6-Nov-12"],["Sunday",11,"2:00pm","RPG","R09","Rolemaster Classic\n– Relic Seeker","By Wendy Maiuro\nDay: Sunday\nStart Time: 2:00pm\nNumber of participants: 2 to 5\n\nIndiana Jones has nothing on you!  Whips, dirty leather hats and 5 day growth beard.  Lara Croft is too busy fighting her machines and crying about her daddy. However you and your team are after a prize that Indy and Lara would never dare to steal.  They would hesitate to even think about it.  Tis TREASURE me matey's and ancient treasure at that!  Off the coast of China the treasure of Gan Ning lies, waiting for brave adventurers to find it! In the true spirit of treasure hunting, Indiana Jones, and Lara Croft comes Relic Seeker.  Pre Gen characters provided.  No experience with Rolemaster needed.","6-Nov-12"],["Sunday",11,"2:00pm","RPG","R07","Savage Worlds \n– Outlaws in Suicide Bluff","By Duncan MacRae\nDay: Sunday\nStart Time: 2:00pm\nNumber of participants: 2 to 5\n\nA town in the old west is being threatened by a group of outlaws. The sheriff assembles a posse to deal out some old west justice!","6-Nov-12"],["Sunday",11,"2:00pm","RPG","R04","Savage Worlds\n– Chickens in the Mist","By Jeff Wilke\nDay: Sunday\nStart Time: 2:00pm\nNumber of participants: 3 to 6\n\nThe O'Conner brothers own and operate a small chicken farm in the hinterlands of Golan County, Texas. Unbeknownst to most citizens, the brothers also run an illegal cockfighting operation on the side. Unfortunately, the high-class attendees of these illegal matches have become somewhat jaded towards the normal brand of bloodsport, which has caused the brothers to seek out more exotic match-ups. In this case, the matches have progressed to fighting giant, carnivorous, mutant chickens in a great bloodletting of claws, beaks, and feathers.","6-Nov-12"],["Sunday",11,"2:00pm","RPG","R06","Warhammer Fantasy Roleplay 3rd Edition\n– Cheap Tickets","By Bryan Skinner\nDay: Sunday\nStart Time: 2:00pm\nNumber of participants: 2 to 4\n\nCheap Tickets is a Demo Scenario for Warhammer Fantasy Roleplay 3rd Edition by Andy Jones.\nRemember all those scenarios that used to start in the local tavern, and forced you to endure an obviously constructed encounter to get the adventure started? Well, this scenario bypasses all of that; yes, the characters were in the local tavern quaffing ale, but they became so drunk they can’t remember the back story to save their lives, and to be honest they are having trouble remembering their names, as well as the amount of alcohol they consumed. It is where they have woken up that will have them concerned!","1-Jan-13"],["Sunday",11,"2:00pm","RPG","R10","Zombie Squad RPG \n– Sweet Meats","By Todd Glawson\nDay: Saturday and Sunday\nStart Time: 9:00am(Saturday and Sunday) and 2:00pm(Sunday)\nMaximum number of participants: 6\n\nEach player will have 2 characters: one male and one female. The object of the game is to get out of the city and to the safety of the open country.  Every couple for themselves OR you could work together as a larger group to get through the chaos and survive.  Along the way you will find weapons to combat the Zombies. But surely at the sacrifice of a character or two.","6-Nov-12"],["Sunday",11,"1:00pm","Special Event",19,"Society for Creative \nAnachronism Demonstration","Time: 1:00pm to 2:00pm","1-Jan-13"],["Sunday",11,"2:00pm","Special Event",18,"Lego - Blind Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will have an ongoing blind build competition while our booths are open. Drop in, attempt to make the model and put your score on the leaderboard. We will be bringing a set of blind build stands where the participant won't be able to see what they are building but everyone else will!","24-Dec-12"],["Sunday",11,"2:00pm","Special Event",18,"Lego - Kid Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will be hosting a kid ( and grown up kid ) build zone for the duration of Gottacon. You are welcome to come build at any time using the club's public brick buckets even if we are not manning our booth at the time. Parents are asked to monitor their children and everyone is welcome to leave your creations for the rest of the attendees to admire afterwards.","1-Jan-13"],["Sunday",11,"2:00pm","Special Event",18,"Lego - Speed Build","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will have an ongoing speed build competition while our booths are open. Drop in, attempt to make the model as fast as possible, and put your score on the leaderboard.","24-Dec-12"],["Sunday",11,"2:00pm","Special Event",18,"Lego - VicWars","By VicLUG\nDay: Friday, Saturday, and Sunday\nTime: While VicLUG booth is open\n\nVicLUG will be hosting their tabletop minifig game, VicWars, again this year with a few new rule additions for returning fans. Games will run for 2 hours and are drop in\/out, very easy to pickup. Appropriate for any age but parents need to attend their children. Check times posted on game table for any schedule changes.","1-Jan-13"],["Sunday",11,"2:00pm","TCG","Please\nVisit WOW\nTO Centre\nArea 6","DEMO - World of Warcraft - WoW Demo Event","By GottaCon and Skyhaven Games\nDay: Friday, Saturday, and Sunday\nTime: All daytime slots.\n\nCome learn to play the World of Warcraft Trading Card Game! Each demo will take only a short ten minutes, and we'll step you through the basics of the game! Then, if you like, you can enter our Beginner's Sealed Event, and play with a preconstructed starter. Play two rounds, get two free booster packs!","3-Nov-12"],["Sunday",11,"2:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering - Intro Deck Duels Event","By GottaCon, Wizards of the Coast and Yellowjacket.\nDay: All weekend\nStart Time: 7:00PM Friday Night, ending Sunday at 4:00PM\nPrice: Free with MTG weekend pass or $15 at the Yellowjacket tournament reporting centre.\nMaximum number of participants: 150\nPrizes: To Be Determined\n\nEach participant will receive a random Intro Duel Deck. Participants may face off against any other Intro Pack Convention League participants in one game at any time over the span of the weekend and report the results, who won and who lost, on their record sheet as well as to the Yellowjacket reporting centre. Players are paired against other players and may not play the same player two (2) times in a row. The winner of the match will be granted two random cards from a pool of cards. The winner then may view and select one of those cards to keep and add it to their intro deck if they so choose and return the other card to the pool or cards. The loser will receive one random card to keep and add to their deck should they choose to. Decks must be a minimum 40 cards. There is no limit to the number of individual opponents you can play.","28-Oct-12"],["Sunday",11,"2:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n- GottaCon MTG Open (2013) \nPart 3 (Finals) Draft","Day: Sunday\nStart Time: 2:00pm\nPrice: You must qualify to play in this non-sanctioned tournament.\nMaximum number of participants: 16\nPrizes: Prizes will be awarded based on attendance.\n\nWelcome to the GottaCon MTG Open Tournament. This tournament consists of three formats (two qualifiers and one final) in which participants face off for hundreds of dollars in prizes. Qualifier finish order will be determined by the formats detailed below. In each format there is a prize pool to be won.\n\nIn Part three (the finals), the top 16 from the previous two qualifiers duke it out in a single elimination Drafts. The finalists will be divided into two pods of eight (8) and each finalist will be provided with three (3) boosters of Gatecrash to draft a deck consisting of no less than 40 cards. The tournament will be single elimination best of 3 games with no time limits. The top player from each pod will face off in the finals in a best of three (or five if time allows) standard constructed event. You must qualify to play in this non-sanctioned tournament. Prizes will be award to the top 16 based on overall MTG Open attendance.","28-Oct-12"],["Sunday",11,"2:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– Gunslinging ","By GottaCon and Yellowjacket Comics and Toys.\nStart time: All weekend at select times at the Yellowjacket tournament reporting centre\nPrice: Free\n\nFace off against professional level MTG players from BC. Win a game and you win a booster!","9-Dec-12"],["Sunday",11,"2:00pm","TCG","Please\nVisit MTG\nTO Centre\nArea 6","Magic: The Gathering \n– Pickup Draft","By Yellowjacket Comics and Toys.\nDay: Friday, Saturday, and Sunday\nTime: All Slots\nPrice: $15\nPrizes: 5-3-2-2","9-Dec-12"],["Sunday",11,"2:30pm","WS\/P","Panel Room","“Unusual” Fandoms: Bronies","Day: Sunday\nTime: 2:30pm to 4:30pm\nPanelists: Nicole Matthews, Tessa Burger, Alison Schuss, Philip Armor, Ken Atkinson\n\nJoin us as we discuss an often misunderstood, and largely criticized, aspect of fandom: Bronies. What is a Brony and Pegasister? Why does a cartoon, often seen as something only for little girls, have such a strong fan base among men, with the average age of the male fan at 21-years-old? We will attempt to dispel some of the myths about Bronies, and try to create a conversation about how we, as a geek community, can better support this area of fandom.","1-Jan-13"],[null,null,null,null,null,"BG = ","Board Game",null],[null,null,null,null,null,"EG = ","Electonic Game",null],[null,null,null,null,null,"Minis = ","Miniatures",null],[null,null,null,null,null,"RPG = ","Role-Playing Game",null],[null,null,null,null,null,"TCG = ","Trading Card Game",null],[null,null,null,null,null,"WS\/P = ","Workshop\/Panel",null],[null,null,null,null,null,null,null,null]]},{"title":"Sheet2","data":[[null]]},{"title":"Sheet3","data":[[null]]}]}